<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>La f&aacute;brica de virus de Bulgaria</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>La f&aacute;brica de virus de Bulgaria</CENTER></H2>

<P><CENTER>Por Vesselin Bontchev</CENTER></P>

<P><CENTER><BR>
En la tercera y &uacute;ltima parte de este interesant&iacute;simo<BR>
trabajo, Vesselin Bontchev nos cuenta por qu&eacute; en Bulgaria<BR>
se crean tantos virus e intenta una explicaci&oacute;n para la<BR>
creaci&oacute;n de virus en todo el mundo.<BR>
</CENTER></P>

<H3>&iquest;Por qu&eacute; se crean tantos virus en Bulgaria?</H3>

<P>Los virus de computadoras se crean en todas partes del<BR>
mundo, no s&oacute;lo en Bulgaria. Sin embargo, la proporci&oacute;n de<BR>
virus creados en nuestro pa&iacute;s es extremadamente alta. Por<BR>
lo tanto, en el mundo entero existen diversos<BR>
condicionantes que convierten la actividad de escribir<BR>
virus en algo tentador, pero en Bulgaria tambi&eacute;n existen<BR>
ciertas situaciones espec&iacute;ficas.</P>

<P>Motivos espec&iacute;ficos por los que se escriben virus en<BR>
Bulgaria.</P>

<P>El primero y m&aacute;s importante de todos es la existencia de<BR>
una enorme cantidad de gente joven altamente calificada,<BR>
genios en computaci&oacute;n, que no est&aacute;n activamente<BR>
relacionados con la vida econ&oacute;mica del pa&iacute;s.<BR>
La computarizaci&oacute;n en Bulgaria comenz&oacute; sin razones<BR>
econ&oacute;micas. Debido a que nuestro pa&iacute;s era socialista, su<BR>
econom&iacute;a era de tipo administrativa. La econom&iacute;a en tales<BR>
condiciones no necesitaba ser computarizada. En realidad,<BR>
las computadoras y la econom&iacute;a planificada son algo<BR>
incompatibles, las computadoras ayudan a producir m&aacute;s en<BR>
menos tiempo y con menos esfuerzo y dinero, mientras que<BR>
el objetivo de un administrador de econom&iacute;as planificadas<BR>
es cumplimentar el plan exactamente como fue prefijado,<BR>
ni en m&aacute;s ni en menos tiempo, sin utilizar ni m&aacute;s ni<BR>
menos dinero. Sin embargo, los l&iacute;deres pol&iacute;ticos<BR>
comunistas de Bulgaria decidieron que deb&iacute;amos<BR>
computarizarnos, principalmente para ser capaces de<BR>
suministrar computadoras a la Uni&oacute;n Sovi&eacute;tica y<BR>
neutralizar de este modo los efectos del embargo.</P>

<P>Si bien la computarizaci&oacute;n en s&iacute; misma no es un hecho<BR>
negativo, cometimos un error muy grave. La econom&iacute;a<BR>
B&uacute;lgara era muy d&eacute;bil (en la actualidad lo es a&uacute;n m&aacute;s)<BR>
pero ten&iacute;amos una gran cantidad de gente con una<BR>
excelente preparaci&oacute;n. Por lo tanto no deb&iacute;amos haber<BR>
tratado de producir hardware cuando ten&iacute;amos excelentes<BR>
posibilidades en el campo de la industria del software,<BR>
en el que se necesita primordialmente &quot;materia gris&quot;<BR>
(brainware). Sin embargo, Bulgaria hizo exactamente lo<BR>
opuesto. En lugar de comprar el hardware comenzamos a<BR>
producirlo (especialmente clones Apple e IBM ilegales).<BR>
En lugar de producir nuestro propio software y tratar de<BR>
venderlo en el Oeste, comenzamos a robar programas de<BR>
computaci&oacute;n del Oeste, cambiar algunas notas de copyright<BR>
en ellos, y luego revenderlos (especialmente en Bulgaria<BR>
y en la Uni&oacute;n Sovi&eacute;tica, y en otros paises del antiguo<BR>
bloque del Este).</P>

<P>En ese momento la mayor&iacute;a del software del Oeste ten&iacute;a<BR>
protecciones para evitar copias. En lugar de entrenar a<BR>
nuestra gente capacitada en la escritura de nuestros<BR>
propios programas, comenzamos a entrenarlos para poder<BR>
violar las estructuras de protecci&oacute;n contra copias.<BR>
Obtuvimos un gran &eacute;xito en esta tarea. Los piratas<BR>
inform&aacute;ticos B&uacute;lgaros son quiz&aacute;s los m&aacute;s capacitados
y<BR>
mejores para vencer las barreras que imponen los<BR>
programas con protecci&oacute;n contra copias. Quiz&aacute;s ellos no<BR>
ten&iacute;an un real deseo de crear y vender sus propios<BR>
programas, ya que debido a la total ausencia de<BR>
legislaci&oacute;n de copyright sobre software de computadoras,<BR>
era imposible vender m&aacute;s de dos o tres ejemplares de un<BR>
programa en Bulgaria. El resto se copiaba.</P>

<P>Teniendo en cuenta que la introducci&oacute;n de computadoras en<BR>
las oficinas de Bulgaria no fue un proceso natural, sino<BR>
que se debi&oacute; a una orden administrativa, con frecuencia<BR>
estas computadoras no se utilizaban,  s&oacute;lo se las<BR>
consideraba como un objeto que daba mayor prestigio. Era<BR>
muy com&uacute;n ver sobre el escritorio del director de una<BR>
compa&ntilde;&iacute;a, cerca del tel&eacute;fono, una computadora personal.<BR>
El director casi nunca utilizaba la computadora, sin<BR>
embargo algunas veces sus hijos ven&iacute;an a la oficina para<BR>
usarla, para jugar o para investigar los componentes<BR>
internos de la m&aacute;quina. Si bien el precio de las<BR>
computadoras personales en Bulgaria era demasiado elevado<BR>
como para que una persona particular tuviese una, era<BR>
algo com&uacute;n utilizar la computadora de la oficina para<BR>
tareas personales. Al mismo tiempo la educaci&oacute;n sobre<BR>
computaci&oacute;n fue ampliamente difundida en Bulgaria. Todo<BR>
el mundo fue educado y preparado en este campo, desde<BR>
ni&ntilde;os muy peque&ntilde;os en el kindergarten hasta maestros<BR>
mayores que estaban a punto de jubilarse. Debido a que<BR>
esta clase de ciencia es comprendida con mayor facilidad<BR>
por mentes j&oacute;venes, no resulta para nada sorprendente que<BR>
las personas que adquirieron mayor capacitaci&oacute;n en este<BR>
campo hayan sido los j&oacute;venes. Muy j&oacute;venes y sin madurez<BR>
moral. Utilizamos un gran esfuerzo ense&ntilde;ando a esta gente<BR>
a programar, pero olvidamos educarlos en lo que a &eacute;tica<BR>
de la computaci&oacute;n se refiere. Adem&aacute;s, la falta de respeto<BR>
por el trabajo de los dem&aacute;s es un problema habitual en<BR>
las sociedades socialistas.</P>

<P>La segunda raz&oacute;n principal es la pr&aacute;ctica difundida de
la<BR>
pirater&iacute;a de software (que fue, en realidad, una especie<BR>
de pol&iacute;tica estatal) y las bajas retribuciones de los<BR>
programadores.</P>

<P>Como lo mencion&eacute; anteriormente, Bulgaria tom&oacute; una<BR>
decisi&oacute;n equivocada encarando la  producci&oacute;n de<BR>
computadoras y robando programas. A&uacute;n no existe<BR>
legislaci&oacute;n sobre copyright relacionada con el software<BR>
de computadoras. Debido a ello, la pirater&iacute;a de software<BR>
ha sido una pr&aacute;ctica muy ampliamente difundida. En<BR>
realidad, casi todos los productos de software utilizados<BR>
eran copias ilegales. La mayor&iacute;a de la gente que las<BR>
utilizaba jam&aacute;s vio los diskettes ni la documentaci&oacute;n<BR>
originales. Con gran frecuencia no exist&iacute;a documentaci&oacute;n<BR>
alguna.</P>

<P>Debido a que con gran frecuencia se copiaban toda clase<BR>
de programas (desde jueguitos hasta sistemas de<BR>
autoedici&oacute;n), esto ayud&oacute; en gran medida a que se<BR>
difundieran los virus de computadoras.</P>

<P>Al mismo tiempo, la baja valuaci&oacute;n que ten&iacute;a el trabajo<BR>
de un programador promedio, convert&iacute;an en pr&aacute;cticamente<BR>
inexistentes las posibilidades de vender sus productos de<BR>
software. Aun en la actualidad, un programador en<BR>
Bulgaria puede recibir una retribuci&oacute;n de 100 a 120 veces<BR>
menor que un programador del mismo nivel en Estados<BR>
Unidos.</P>

<P>Este hecho ocasion&oacute; que mucha gente joven se resintiera<BR>
contra la sociedad que no era capaz de evaluar su<BR>
capacidad como deb&iacute;an. Existe s&oacute;lo un paso en la<BR>
transformaci&oacute;n de esta gente joven en creadores de virus<BR>
destructivos. Algunos de ellos (por ejemplo, el Dark<BR>
Avenger) dieron ese paso.</P>

<P>La tercera raz&oacute;n principal es la absoluta falta de<BR>
legislaci&oacute;n contra la creaci&oacute;n y deliberada distribuci&oacute;n<BR>
de virus de computadoras y contra el acceso ilegal y la<BR>
modificaci&oacute;n de informaci&oacute;n de computaci&oacute;n en general.</P>

<P>Debido a la falta de leyes de copyright sobre software de<BR>
computaci&oacute;n, en Bulgaria no existen cosas tales como el<BR>
derecho de propiedad sobre la informaci&oacute;n  de una<BR>
computadora. Por lo tanto, la modificaci&oacute;n o a&uacute;n la<BR>
destrucci&oacute;n de dicha informaci&oacute;n no se considera delito,<BR>
ya que no se atenta contra la propiedad de nadie.</P>

<P>La legislaci&oacute;n B&uacute;lgara es terriblemente vieja en este<BR>
sentido. M&aacute;s aun, incluso si se aceptara la ley de<BR>
propiedad en el futuro, su aplicaci&oacute;n como sanci&oacute;n no<BR>
podr&iacute;a efectuarse a delitos cometidos antes de ser<BR>
sancionada. En consecuencia, los escritores de virus<BR>
todav&iacute;a no tienen motivo alguno para preocuparse.</P>

<P>Este es el motivo por el cual la creaci&oacute;n de nuevos virus<BR>
de computadoras se ha convertido en una especie de<BR>
deporte o entretenimiento en Bulgaria.</P>

<P>El siguiente motivo en importancia es la d&eacute;bil<BR>
organizaci&oacute;n demostrada por la lucha contra los virus de<BR>
computadoras. En este mismo momento nuestro pa&iacute;s est&aacute;<BR>
sumido en una profunda crisis econ&oacute;mica. Carecemos de<BR>
fondos para todo, incluyendo para insumos b&aacute;sicos como<BR>
alimentos y combustibles. Al mismo tiempo, la<BR>
organizaci&oacute;n de lucha contra los virus requerir&iacute;a fondos<BR>
para establecer una red de centros de prueba de virus que<BR>
recopilara e investigara los virus de computadoras,<BR>
centros equipados con el mejor hardware disponible, y que<BR>
pudieran comunicarse de manera efectiva entre s&iacute; y con<BR>
otros centros similares en el resto del mundo. El &uacute;nico<BR>
sistema que permite semejante grado de eficiencia es el<BR>
correo electr&oacute;nico, y Bulgaria reci&eacute;n comienza a<BR>
transitar sus primeros pasos en comunicaciones mediante<BR>
computadoras. Todo esto requiere gran cantidad de dinero,<BR>
dinero que nuestro gobierno no tiene en este momento.<BR>
Otra raz&oacute;n es la opini&oacute;n incorrecta que tiene la sociedad<BR>
sobre el problema de los virus de computaci&oacute;n.<BR>
Todav&iacute;a, las v&iacute;ctimas del ataque de un virus de<BR>
computadora se consideran como v&iacute;ctimas de una mala<BR>
broma, no como v&iacute;ctimas de un delito.<BR>
Por &uacute;ltimo, el motivo menos importante, en mi opini&oacute;n, es<BR>
la disponibilidad y f&aacute;cil acceso a la informaci&oacute;n de<BR>
determinado tipo.<BR>
Entre los piratas inform&aacute;ticos B&uacute;lgaros circula toda<BR>
clase de trucos e informaci&oacute;n sobre c&oacute;mo enga&ntilde;ar a
un<BR>
sistema operativo. Algunos de estos trucos frecuentemente<BR>
se publican en revistas relacionadas con la ciencia de la<BR>
computaci&oacute;n. Como mencion&eacute; anteriormente, existe incluso<BR>
un BBS especializado, dedicado a la divulgaci&oacute;n de virus<BR>
y un &aacute;rea especial (local para Bulgaria) en FidoNet,<BR>
dedicada a la creaci&oacute;n de virus. Todo esto sin mencionar<BR>
el ampliamente conocido archivo INTERxyy, publicado como<BR>
shareware por Ralf Brown de Estados Unidos. Es muy<BR>
popular en Bulgaria, ya que contiene una enorme cantidad<BR>
de trucos no documentados cuidadosamente descriptos.<BR>
Sin embargo, a pesar de lo comentado &eacute;sta no es una raz&oacute;n<BR>
importante. Por lo general, aquellas personas que deciden<BR>
crear un virus ya saben c&oacute;mo hacerlo, o al menos, pueden<BR>
arreglarse por s&iacute; mismos. No necesitan tomar un virus<BR>
existente y modificarlo.<BR>
Prueba de ello es que prevalecen los virus B&uacute;lgaros<BR>
originales sobre las variantes de los virus conocidos,<BR>
como as&iacute; tambi&eacute;n el hecho de que much&iacute;simas nuevas
ideas<BR>
para creaci&oacute;n de virus fueron inventadas e implementadas<BR>
por primera vez en Bulgaria.</P>

<H3>Motivos generales</H3>

<P>Debido a que los virus tambi&eacute;n se crean en otras partes<BR>
del mundo, deben existir tambi&eacute;n razones generales que<BR>
favorecen esta actividad. Dichas razones son por<BR>
supuesto, v&aacute;lidas tambi&eacute;n para Bulgaria. Veamos entonces<BR>
estas razones.</P>

<H3>Deseo de gloria.</H3>

<P>Cada  programador sue&ntilde;a que su programa tenga amplia<BR>
difusi&oacute;n y uso. Un gran n&uacute;mero de muy buenos<BR>
programadores escriben y distribuyen excelentes paquetes<BR>
de software de manera gratuita, con la &uacute;nica finalidad de<BR>
tener mayor cantidad de usuarios que empleen sus<BR>
paquetes. Sin embargo, para que se utilice un programa<BR>
debe ser suficientemente bueno. Y no todos los<BR>
programadores est&aacute;n en condiciones de crear un programa<BR>
tan bueno como para que los usuarios lo utilicen en forma<BR>
masiva, aunque sea gratis. Al mismo tiempo, los virus de<BR>
computadoras se difunden muy ampliamente,<BR>
independientemente de la voluntad de los usuarios e<BR>
incluso contra ella. Por lo tanto, cuando un escritor de<BR>
virus lee en un diario que su virus se descubri&oacute; en el<BR>
otro extremo del mundo experimenta una especie de<BR>
pervertido placer. Algunas personas escriben virus s&oacute;lo<BR>
para ver sus nombres (o lo de los virus por ellos<BR>
creados) publicados en los diarios. Esta raz&oacute;n tiene<BR>
adem&aacute;s otro aspecto. En el comienzo de la era de los<BR>
virus cuando la idea de un virus de computadora era algo<BR>
totalmente nuevo, s&oacute;lo los muy buenos programadores eran<BR>
capaces de crear un virus. Luego se convirti&oacute; en una idea<BR>
com&uacute;n que si una persona pod&iacute;a crear un virus, era un<BR>
gran programador. Este mito podr&iacute;a haberse justificado en<BR>
los comienzos, pero ahora no tiene sentido alguno.<BR>
Igualmente, los piratas inform&aacute;ticos j&oacute;venes comienzan a<BR>
escribir virus, solo para ponerse a prueba y demostrar a<BR>
sus amigos y al resto del mundo qu&eacute; buenos programadores<BR>
son. Algunos de ellos ser&iacute;an en realidad incapaces de<BR>
inventar algo original, ese es el motivo por el que<BR>
simplemente toman alg&uacute;n virus conocido, lo modifican<BR>
levemente y difunden esta nueva mutaci&oacute;n. Ello explica el<BR>
motivo por el que hay tanta cantidad de variantes de los<BR>
primeros virus simples creados: BRAIN, JERUSALEM, STONED,<BR>
VIENNA, CASCADE... Un ejemplo t&iacute;pico es el escritor de<BR>
virus Italiano que se asign&oacute; el nombre de Cracker Jack.</P>

<H3>Simple curiosidad humana.</H3>

<P>Uno debe admitir que la idea de un programa de<BR>
computadora que sea capaz de propagarse, reproducirse,<BR>
ocultarse a los ojos del usuario (quien cree mantener su<BR>
computadora bajo control), y en general comportarse como<BR>
un ser vivo aut&eacute;ntico es realmente fascinante. La simple<BR>
curiosidad humana es motivo suficiente para que algunas<BR>
personas, si son suficientemente j&oacute;venes e<BR>
irresponsables, traten de crear un virus de computadora.<BR>
Alguno de ellos logran hacerlo. Un n&uacute;mero cada vez mayor,<BR>
si consideramos la cantidad de nuevos virus aparecidos<BR>
seg&uacute;n los &uacute;ltimos informes. Algunos de estos j&oacute;venes<BR>
creadores alegan que escriben virus &quot;s&oacute;lo para ellos&quot;,<BR>
&quot;s&oacute;lo para divertirse,&quot; y que &quot;no los propagan.&quot;
Sin<BR>
embargo, es frecuentemente imposible poder mantener un<BR>
control total sobre la diseminaci&oacute;n de un virus de<BR>
computadora &quot;exitoso&quot;. Cuanto m&aacute;s inteligentes sean estos<BR>
virus mayor ser&aacute; la probabilidad de que puedan &quot;escapar.&quot;<BR>
Existe una idea de ense&ntilde;ar a los alumnos c&oacute;mo se crean<BR>
los virus, por supuesto en un entorno severamente<BR>
restringido. Quiz&aacute;s al menos para algunos, &eacute;sto dejar&aacute;<BR>
satisfecha su curiosidad y no los tentar&aacute; para escribir<BR>
sus propios virus. Es posible que si obligamos a cada<BR>
estudiante de computaci&oacute;n a aprender los teoremas del Dr.<BR>
Fred Cohen sobre aspectos matem&aacute;ticos de los virus de<BR>
computadoras, si tomamos un examen e interrogamos sobre<BR>
c&oacute;mo se dise&ntilde;a un esquema de protecci&oacute;n contra virus
o<BR>
c&oacute;mo se debe proceder para ayudar a un conjunto de<BR>
usuarios atacados por un virus como trabajo durante un<BR>
curso, quiz&aacute;s en este caso estos alumnos tendr&aacute;n m&aacute;s
que<BR>
suficiente material sobre el problema de los virus de<BR>
computadoras y no desear&aacute;n oir hablar sobre el tema nunca<BR>
m&aacute;s, mucho menos, crear sus propios virus.</P>

<H3>F&aacute;cil acceso a la informaci&oacute;n.</H3>

<P>Se puede encontrar con gran facilidad toda la informaci&oacute;n<BR>
necesaria para escribir un programa de virus. Esta<BR>
informaci&oacute;n por lo general es m&aacute;s f&aacute;cil de encontrar
que<BR>
en Bulgaria.</P>

<P>La persona que desea crear un virus promedio s&oacute;lo tiene<BR>
que hojear los manuales, que por lo general no est&aacute;n<BR>
disponibles en Bulgaria. Sin embargo, la utilidad del<BR>
f&aacute;cil acceso a esta informaci&oacute;n es mucho mayor que el<BR>
da&ntilde;o causado por el hecho de que la misma sea utilizada<BR>
por los escritores de virus.</P>

<H3>Intereses militares.</H3>

<P>Es com&uacute;n escuchar comentarios acerca que los<BR>
superpoderosos est&aacute;n trabajando sobre un proyecto que<BR>
consiste en c&oacute;mo utilizar los virus de computadoras para<BR>
destruir el software de las computadoras del enemigo.<BR>
Este hecho es muy probable al punto tal que en varios<BR>
paises se est&aacute; llevando a cabo esta investigaci&oacute;n.<BR>
Existen informes al respecto de USA, Francia y la USSR.<BR>
Esto no es nada raro, forma parte del derecho que tiene<BR>
cada fuerza militar ha investigar cualquier nueva idea y<BR>
considerar la posible utilidad y/o amenaza que ello<BR>
podr&iacute;a representar para la defensa nacional. Sin embargo,<BR>
es algo<BR>
improbable que los virus de computadoras se puedan usar<BR>
con estos fines. Tal como sucede con los virus vivos, los<BR>
de computadoras se pueden propagar s&oacute;lo entre individuos<BR>
con sistema inmunol&oacute;gico muy similar, es decir entre<BR>
computadoras compatibles. La clase de computadoras<BR>
personales m&aacute;s ampliamente difundidas son IBM PC,<BR>
Macintosh, Amiga y Atari ST. Por lo tanto no es nada<BR>
sorprendente que la amplia mayor&iacute;a de los virus de<BR>
computadoras existentes sean capaces de infectar s&oacute;lo a<BR>
este tipo de computadora. Al mismo tiempo, los virus que<BR>
infectan una clase de computadora (por ejemplo, las IBM<BR>
PC), no pueden propagarse (e incluso correr) en otra (por<BR>
ejemplo, una Macintosh). Por lo general, no pueden correr<BR>
incluso en dos sistemas operativos diferentes aunque se<BR>
utilicen en la misma computadora. Aun una versi&oacute;n<BR>
diferente del mismo sistema operativo podr&iacute;a ocasionar<BR>
grandes problemas en la propagaci&oacute;n de un virus<BR>
espec&iacute;fico, al punto tal que podr&iacute;a llegar a anular su<BR>
funcionamiento. Dentro de las fuerzas armadas nunca se<BR>
asignan tareas importantes a las computadoras personales<BR>
comunes. Por lo tanto aun en el caso de que se infectaran<BR>
con cualquier virus, e incluso si &eacute;ste destruyera todos<BR>
los datos almacenados en esas m&aacute;quinas, los da&ntilde;os<BR>
ocasionados no ser&iacute;an de gran importancia.<BR>
Las computadoras que se utilizan para asuntos realmente<BR>
importantes, como proyectos de coheter&iacute;a u orientaci&oacute;n<BR>
misil&iacute;stica, son siempre equipos especializados. Sus<BR>
programas generalmente cuentan con codificaci&oacute;n por<BR>
hardware y s&oacute;lo se puede ingresar datos en ellas. No es<BR>
posible incorporar un diskette IBM PC infectado en las<BR>
computadoras que controlan el sistema NORAD. Al mismo<BR>
tiempo, las computadoras que pueden controlar diferentes<BR>
dispositivos importantes por lo general son incompatibles<BR>
incluso entre ellas. En consecuencia, aun en el caso de<BR>
que alguien escriba un virus para una computadora de<BR>
coheter&iacute;a o misil&iacute;stica especializada, este virus no<BR>
podr&iacute;a infectar a las computadoras de un bombardero<BR>
estrat&eacute;gico o incluso a aquellas que pertenecen a un<BR>
sistema misil&iacute;stico diferente. Por lo tanto este virus no<BR>
se propagar&iacute;a demasiado. Finalmente, el virus debe<BR>
colocarse en alg&uacute;n lugar de las computadoras del enemigo.<BR>
Debido a que, tal como vimos anteriormente, no puede<BR>
propagarse de una computadora a otra de diferente clase,<BR>
obviamente alguien tiene que colocarlo en la computadora<BR>
de la v&iacute;ctima. Pero si usted puede acceder a las<BR>
computadoras del enemigo, no necesita un virus. Puede<BR>
llevar a cabo la misma tarea de manera mucho m&aacute;s f&aacute;cil (y<BR>
frecuentemente con mayor &eacute;xito) &quot;de forma manual&quot;, o con<BR>
un caballo de Troya o una bomba l&oacute;gica.</P>

<H3>Intereses corporativos.</H3>

<P>Tambi&eacute;n se especula con gran frecuencia que las grandes<BR>
compa&ntilde;&iacute;as de software y los procedimientos de software<BR>
antivirus crean o propagan deliberadamente los virus de<BR>
computadoras.</P>

<P>Hay alguna raz&oacute;n detr&aacute;s de esta afirmaci&oacute;n. En realidad<BR>
el temor a los virus puede hacer que el usuario compre<BR>
solo software original (algunas veces bastante caro), y<BR>
no utilice copias pirateadas, shareware o freeware. Al<BR>
mismo tiempo, las compa&ntilde;&iacute;as que producen software<BR>
antivirus est&aacute;n interesadas en que se vendan sus<BR>
productos. Y seguramente se vender&aacute;n si el usuario<BR>
necesita protecci&oacute;n antivirus. Por lo tanto, es bastante<BR>
improbable que una compa&ntilde;&iacute;a de software (produzca o no<BR>
software antivirus) asuma el riesgo de que se sepa que<BR>
propaga virus de manera deliberada. Probablemente<BR>
recibir&iacute;a como respuesta el boycot de sus usuarios y las<BR>
p&eacute;rdidas ser&iacute;an mucho mayores que las ganancias. Y con<BR>
respecto a los fabricantes de software antivirus, no<BR>
necesitan escribir sus propios virus para poder vender<BR>
sus programas. Es suficiente para ellos con utilizar la<BR>
ligereza que los medios de comunicaci&oacute;n emplen<BR>
habitualmente para encarar el problema, y consiste en<BR>
mencionar la cantidad de virus que existen y cu&aacute;ntos de<BR>
ellos puede neutralizar con &eacute;xito su maravilloso<BR>
producto.</P>

<P>El impacto de los virus B&uacute;lgaros en el occidente y en la<BR>
industria de software nacional.</P>

<P>Mientras que una enorme parte de los virus existentes se<BR>
producen en Bulgaria, una parte relativamente peque&ntilde;a de<BR>
ellos se propaga con &eacute;xito en el Oeste. Entre m&aacute;s de  160<BR>
virus B&uacute;lgaros, solo algunos pocos (DARK AVENGER, V2000,<BR>
V2100, PHOENIX, DIAMOND,NOMENKLATURA, VACSINA, YANKEE<BR>
DOODLE) est&aacute;n relativamente difundidos. Al mismo tiempo,<BR>
algunos de ellos (DARK AVENGER, V2000, YANKEE DOODLE,<BR>
VACSINA) est&aacute;n ampliamente difundidos. Seg&uacute;n John McAfee,<BR>
alrededor del  10% de todas las infecciones de los<BR>
Estados Unidos est&aacute;n ocasionadas por virus de origen<BR>
B&uacute;lgaro, generalmente el virus DARK AVENGER. En el Oeste<BR>
Europeo este virus comparte su popularidad con los virus<BR>
YANKEE DOODLE y VACSINA.</P>

<P>De los virus mencionados anteriormente, la mayor parte<BR>
est&aacute;n escritos por el Dark Avenger, excepto el virus<BR>
YANKEE DOODLE y VACSINA. Casi todos sus virus (en este<BR>
caso, con la excepci&oacute;n de DIAMOND, que es el menos<BR>
discutido) son extremadamente destructivos. Los virus<BR>
PHOENIX y NOMENKLATURA alteran la FAT  de una manera tan<BR>
sutil, que cuando el usuario percibe el da&ntilde;o, no hay<BR>
forma de desinfectar los archivos afectados e incluso, no<BR>
es posible determinar cu&aacute;les son esos archivos. La &uacute;nica<BR>
manera de hacerlo es reformateando el disco r&iacute;gido.</P>

<P>Es dif&iacute;cil estimar los costos de todos los da&ntilde;os<BR>
ocasionados por los virus B&uacute;lgaros. Existen informes<BR>
provenientes de Alemania en los que se indica que<BR>
alrededor de 10,000,000 de marcos por da&ntilde;os ser&iacute;a la suma<BR>
acumulada s&oacute;lo por casos atribuibles al virus VACSINA. Es<BR>
probable, sin embargo, que estas cifras est&eacute;n bastante<BR>
sobrestimadas.<BR>
La enorme cantidad de virus B&uacute;lgaros conocidos ocasiona<BR>
tambi&eacute;n un da&ntilde;o indirecto a la comunidad occidental, aun<BR>
en aquellos casos en los que los virus no salieron de<BR>
Bulgaria, pero s&oacute;lo algunos ejemplos de ellos fueron<BR>
suministrados a los investigadores de antivirus. Estos<BR>
investigadores han desarrollado programas antivirus<BR>
contra estos virus (por las dudas que alguno de ellos<BR>
lograra salir de Bulgaria). Por lo tanto, debieron<BR>
invertir tiempo y esfuerzos en lograrlo. Adem&aacute;s, el<BR>
usuario est&aacute; obligado a comprar nuevos programas<BR>
antivirus (o pagar por actualizaciones de los que ya<BR>
posee), a fin de sentirse totalmente seguro y protegido<BR>
contra estos virus. Al mismo tiempo, la creaci&oacute;n y<BR>
propagaci&oacute;n de virus B&uacute;lgaros ocasiona un gran da&ntilde;o
a la<BR>
econom&iacute;a B&uacute;lgara. En Bulgaria, los virus B&uacute;lgaros est&aacute;n<BR>
mucho m&aacute;s difundidos. M&aacute;s del 80% de los alrededor de 160<BR>
virus B&uacute;lgaros conocidos se han detectado en nuestro pa&iacute;s<BR>
de manera casual. Sin embargo, es dif&iacute;cil evaluar e<BR>
incluso poder estimar los costos exactos de los da&ntilde;os<BR>
ocasionados, ya que en Bulgaria el concepto &quot;propiedad de<BR>
informaci&oacute;n de computaci&oacute;n&quot;, simplemente no existe en
el<BR>
sentido legal. Sucede lo mismo con el costo de esta<BR>
informaci&oacute;n. En realidad, la creaci&oacute;n de virus de<BR>
computadoras ocasiona tambi&eacute;n da&ntilde;os indirectos a nuestra<BR>
econom&iacute;a. En primer t&eacute;rmino, gran cantidad de gente<BR>
sumamente capaz est&aacute; perdiendo su tiempo e inteligencia<BR>
en crear virus destructivos, en lugar de emplear esas<BR>
energ&iacute;as en algo &uacute;til.<BR>
En segundo t&eacute;rmino, el hecho de que los programadores<BR>
B&uacute;lgaros usen su tiempo para crear virus de computadoras<BR>
destruye su reputaci&oacute;n totalmente. Ninguna compa&ntilde;&iacute;a
de<BR>
software seria acepta mantener relaci&oacute;n alguna con<BR>
programadores o compa&ntilde;&iacute;as de software B&uacute;lgaras, porque<BR>
temen que el software suministrado pueda ser pirateado o<BR>
contenga alg&uacute;n virus.</P>

<H3>Conclusi&oacute;n.</H3>

<P>La creaci&oacute;n de virus en Bulgaria es un hobby ampliamente<BR>
difundido. La mayor&iacute;a de los principales escritores de<BR>
virus son conocidos, pero no se toma ninguna medida<BR>
contra ellos. El trabajo que realizan ocasiona una gran<BR>
cantidad de da&ntilde;os a la comunidad Occidental, como as&iacute;<BR>
tambi&eacute;n a la econom&iacute;a nacional. En consecuencia, es<BR>
urgente tomar medidas legales en esta direcci&oacute;n; medidas<BR>
que logren que la creaci&oacute;n de virus y la propagaci&oacute;n<BR>
deliberada de los mismos se consideren un acto delictivo.<BR>
Esta es la &uacute;nica manera en que se puede detener, o al<BR>
menos reducir esta amenaza.<BR>
</BODY>
</HTML>
