<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Analisis de virus</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Analisis de Virus</CENTER></H2>

<P><CENTER>Por Fernando Bonsembiante</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P><CENTER>En este n&uacute;mero analizamos un virus argentino nuevo, que<BR>
nos acerc&oacute; un lector de Bah&iacute;a Blanca.</CENTER></P>

<P>&nbsp;</P>

<P>Recibimos en nuestra redacci&oacute;n la siguiente carta de un<BR>
lector de Bah&iacute;a Blanca:</P>

<P>A fin de colaborar con su publicaci&oacute;n les facilito<BR>
un disco conteniendo un virus, segun entiendo bastante<BR>
nuevo. Lo detect&eacute; en el colegio al cual concurro la noche<BR>
del 20/4. A toda prisa desarroll&eacute; una vacuna beta para<BR>
detectarlo (y en la medida de lo posible erradicarlo) y<BR>
realic&eacute; un r&aacute;pido an&aacute;lisis del mismo, donde saqu&eacute;
las<BR>
siguientes conclusiones:</P>

<P>-Se trata de un virus de boot sector.<BR>
-Al igual que otros virus (Michelangelo, Anti Tel, etc.)<BR>
disminuye la cantidad de memoria instalada reportada por<BR>
el BIOS en 2Kb, por lo cual su presencia se delata al<BR>
ejecutar un simple CHKDSK o MEM.<BR>
-Alamcena la copia del Boot Sector siempre en el sector<BR>
f&iacute;sico ubicado en el cilindro 0, lado 1, sector 3. Esto<BR>
sin considerar el tipo de medio en el cual se encuentre<BR>
(es decir, no considera si se trata de un disco de 360k,<BR>
1.2M, etc&eacute;tera) Esto causa que en discos de poca<BR>
capacidad sobreescriba el cluster 2 o 3, o en discos de<BR>
alta capacidad escriba sobre uno de los primeros sectores<BR>
del directorio ra&iacute;z.<BR>
-Seleccion&eacute; un string de identificaci&oacute;n con cierto<BR>
criterio, pero no tuve todav&iacute;a tiempo de desensamblarlo y<BR>
buscar un string mejor, (a&uacute;n as&iacute; intuyo que seleccion&eacute;<BR>
una parte de la rutina de control de la interrupci&oacute;n 10h<BR>
o 21h, pues viene luego de una secuencia de PUSH AX, PUSH<BR>
BX, PUSH CX, etc., lo cual implica una rutina que no<BR>
modifique registros) El string es el siguiente:</P>

<P>1E 06 16 56 80 FC 02 72 62 80 FC 03 77 5D 80 FA 00<BR>
75</P>

<P>El mismo es utilizado en mi vacuna para detectar el<BR>
virus.<BR>
-Me llama la atenci&oacute;n el tiempo que tarda en cargar el<BR>
sistema desde un disco infectado y la presencia de<BR>
sectores defectuosos falsos (creados por el virus).<BR>
Todav&iacute;a no pude determinar la causa de esos factores.<BR>
-Hasta donde pude determinar, el virus no afecta los<BR>
discos de 3.5, al menos no como drive B.</P>

<P>Me tom&eacute; la libertad de asignarle un nombre al virus<BR>
en cuesti&oacute;n, el cual tiene un elevado nivel de<BR>
integraci&oacute;n (estimo que su longitud no supera los 512<BR>
bytes). De no haber sido bautizado previamente, ser&iacute;a mi<BR>
intenci&oacute;n denominarlo CAMOUFLAGE II. Al d&iacute;a de la fecha,<BR>
aqu&iacute; en Bah&iacute;a Blanca circula la versi&oacute;n 100 del<BR>
Scan/Clean, quien no pudo detectar el presente virus, ni<BR>
sus versiones 91 o 97.<BR>
De no poder distribuirse la vacuna que realic&eacute;, creo<BR>
que ser&iacute;a conveniente publicar el string y las<BR>
instrucciones para a&ntilde;adirlo al SCAN a fin de que no se<BR>
propague. Aqu&iacute; en la ciudad se transform&oacute; en epidemia.</P>

<P>Alejandro G. Stankevicius</P>

<P>Inmediatamente procedimos a desensamblar el virus y a<BR>
analizarlo. El resultado de nuestro an&aacute;lisis fue<BR>
ligeramente distinto al de Alejandro, pero b&aacute;sicamente<BR>
igual en los puntos fundamentales.</P>

<P>Este virus infecta el boot sector de los diskettes<BR>
ubicados en el drive A, independientemente de su formato,<BR>
y del disco r&iacute;gido infecta la tabla de particiones. En<BR>
los discos r&iacute;gidos pone la tabla de particiones original<BR>
en el sector 7, cilindro 0, cabeza 0. Este lugar es muy<BR>
usado por los virus ya que normalmente no se guardan<BR>
datos en ese lugar. En los diskettes pone el boot<BR>
original en el sector 3, cilindro 0, cabeza 1. En los<BR>
diskettes causa el problema de sobreescribir una parte de<BR>
la informaci&oacute;n del disco, o el directorio ra&iacute;z.<BR>
Cuando el virus se carga en memoria reduce en dos la<BR>
cantidad de memoria instalada que reporta el BIOS, como<BR>
hacen la mayor&iacute;a de los virus de boot, pero &eacute;ste tiene<BR>
una particularidad. En vez de restarle dos al valor ya<BR>
existente en ese lugar, pone el valor 638 decimal, con lo<BR>
cual indica que hay 638k de memoria instalada. El<BR>
problema surge si hay menos de 640k de memoria real, en<BR>
ese caso indicar&iacute;a que hay m&aacute;s memoria de la que<BR>
realmente hay, causando problemas. Eso no suele suceder<BR>
con las m&aacute;quinas de ahora, que todas tienen por lo menos<BR>
640k de memoria, pero en m&aacute;quinas m&aacute;s antiguas<BR>
seguramente cause algun problema. Como al copiarse a<BR>
memoria alta tampoco verifica si hay o no 640k de<BR>
memoria, seguramente el virus se cuelgue al intentar<BR>
ejecutarse.<BR>
La causa de que el virus tarde tanto en cargar el sistema<BR>
se debe a que cada vez que bootea incrementa en uno un<BR>
contador de veces que se boote&oacute;. Para hacerlo debe<BR>
escribir el virus en el boot sector o en la tabla de<BR>
particiones cada vez que bootea, por eso se hace m&aacute;s<BR>
lento el proceso. Cuando dicho contador llega a 65535, o<BR>
sea a 0FFFFh, o sea que booteo esa cantidad de veces con<BR>
el virus, cada vez que se llame a la interrupci&oacute;n 13h se<BR>
escribir&aacute; en la pantalla el mensaje 'LAVOT NO ENSE&Ntilde;A'.<BR>
Esto nos hace sospechar que el virus fue creado como<BR>
venganza o protesta contra un profesor. El mensaje est&aacute;<BR>
encriptado de una forma muy b&aacute;sica en el c&oacute;digo del virus<BR>
y no se ve a simple vista.<BR>
Para infectar, en el caso de que haya booteado de<BR>
diskette, simplemente se copia en la tabla de particiones<BR>
en el momento de bootear, si &eacute;sta no est&aacute; previamente<BR>
infectada. Cuando el virus est&aacute; en memoria, cada vez que<BR>
se acceda a la disketera A para lectura o escritura va a<BR>
infectar el diskette que contenga a menos que ya est&eacute;<BR>
previamente infectado. Cada vez que infecta un nuevo<BR>
disco, r&iacute;gido o floppy, pone en cero el contador de veces<BR>
que el mismo fue booteado. S&oacute;lamente lo incrementa cuando<BR>
se bootea de un diskette infectado.</P>

<P>El string elegido por Alejandro est&aacute; justamente en la<BR>
rutina que reemplaza la interrupci&oacute;n 13h, de servicios de<BR>
disco del Bios (la &uacute;nica tomada por el virus, por otra<BR>
parte). Un string mejor y mas dificil de que cause falsas<BR>
alarmas o identificaciones incorrectas es</P>

<P>2E C7 06 04 00 00 00 33 DB B8 01 03 B9 01 00 33 D2 9C 2E</P>

<P>que es justamente parte de la rutina que infecta los<BR>
diskettes. Por lo general es adecuado elegir como string<BR>
de identificaci&oacute;n parte de las rutinas de infecci&oacute;n, que<BR>
son segmentos mucho m&aacute;s cr&iacute;ticos del c&oacute;digo y dif&iacute;ciles<BR>
de cambiar.</P>

<P>Para agregar este string en el Scan debemos usar un<BR>
archivo de definici&oacute;n de virus externo. Este archivo se<BR>
crea con un editor de texto cualquiera que permita<BR>
guardar el archivo en ASCII puro, y tiene la siguiente<BR>
forma:</P>

<P>#Camouflage II<BR>
&quot;2E C7 06 04 00 00 00 33 DB B8 01 03 B9 01 00 33 D2 9C<BR>
2E&quot; Camouflage_II</P>

<P>Este archivo se guarda con el nombre, por ejemplo,<BR>
ext.vir y se llama al Scan con los par&aacute;metros, por<BR>
ejemplo</P>

<P>Scan C: /EXT c:\ext.vir</P>

<P>Con esto se le indica al Scan que busque tambien los<BR>
virus definidos en ext.vir. Pueden usarse conjuntamente<BR>
con esta opci&oacute;n cualquier otra que se use normalmente.
</BODY>
</HTML>
