<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Correo</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Correo</CENTER></H2>

<P>&nbsp;</P>

<H3>Colecci&oacute;n de virus</H3>

<P>Sres de Virus Report:</P>

<P>     He leido con mucho entusiasmo su revista, y me ha<BR>
surgido una idea, la cual me gustar&iacute;a contarles.<BR>
     En 1991, si mal no recuerdo, sufr&iacute; el ataque del hoy<BR>
famoso &quot;Stoned Virus&quot;, por el cual tuve que reformatear<BR>
el disco r&iacute;gido. Una vez formateado, hice lo mismo con<BR>
los diskettes, exepto con uno infectado.<BR>
     De ah&iacute; me surgi&oacute; la idea de conseguir y guardar m&aacute;s<BR>
virus, todos los que pudiera. En este momento s&oacute;lo tengo<BR>
cuatro virus, (Stoned B, 4096, Jerusalem B, Michelangelo)<BR>
que consegu&iacute; de unos amigos. Los cuatro diskettes, as&iacute;<BR>
como me los dieron los guard&eacute; y no los toqu&eacute; m&aacute;s, pues
no<BR>
tengo los conocimientos como para hacerlo sin peligro, ni<BR>
siquiera los escaneo, pues temo que me infecten.<BR>
     Concretamente, la idea es hacer una especie de<BR>
&quot;biblioteca de virus&quot;. Ustedes podr&iacute;an brindar a sus<BR>
lectores algunos peque&ntilde;os pero &uacute;tiles consejos de como<BR>
una vez detectado un virus archivarlo en forma ordenada.<BR>
&iquest;Y todo esto por que? No se, s&oacute;lo me gusta la idea. Es<BR>
como coleccionar armas antiguas. Todos sabemos para que<BR>
sirven, pero el coleccionista s&oacute;lo las tiene para<BR>
deleitarse admir&aacute;ndolas, retoc&aacute;ndolas, para sentirse<BR>
orgulloso de ellas y mostr&aacute;rselas a sus amigos. Con los<BR>
virus es lo mismo.</P>

<P>Atentamente. Pablo Villarroya.</P>

<P>&nbsp;</P>

<P>VR: La idea de un m&eacute;todo de almacenar virus es algo que<BR>
ya pas&oacute; por nuestras cabezas. Tenemos un sistema, que<BR>
usamos para la colecci&oacute;n de virus interna de la revista,<BR>
que pensamos publicar en poco tiempo, ya que ese m&eacute;todo<BR>
sirve tanto para clasificar y ordenar virus como para<BR>
enviarlos a los investigadores que sepan que hacer con<BR>
ellos. Como ya algunos lectores nos han enviado algunos<BR>
virus para que examinemos, creemos que es necesario dar<BR>
algunas pautas m&iacute;nimas para su recolecci&oacute;n.</P>

<P>&nbsp;</P>

<H3>Hackers</H3>

<P>Sres de Virus Report:</P>

<P>     Genial la nota del hacker. El motivo de mi carta es<BR>
el siguiente: estoy recopado con el tema del hacking.<BR>
Creo que todos alguna vez tuvimos la idea de convertirnos<BR>
en hackers, sobre todo despu&eacute;s de ver la pel&iacute;cula &quot;Juegos<BR>
de guerra&quot;. Espero que en otros n&uacute;meros de la revista se<BR>
trate el tema de las comunicaciones, y sigan las<BR>
entrevistas a los hackers. Otra pregunta: &iquest;Hay algun<BR>
lugar donde pueda comunicarme con alg&uacute;n hacker en el<BR>
pa&iacute;s? &iquest;El grupo PUA todav&iacute;a est&aacute; activo? Tambien
me<BR>
gustar&iacute;a saber si hay alg&uacute;n libro sobre el tema.</P>

<P>Gustavo Olgiati, Esquel, Chubut.</P>

<P>VR: Justamente en este n&uacute;mero comentamos &quot;Juegos de<BR>
guerra&quot;, una pel&iacute;cula que ya es un cl&aacute;sico del tema.<BR>
Vamos a seguir tratando el tema, con respecto a los<BR>
libros, nuestro colaborador Mart&iacute;n Sal&iacute;as est&aacute; trabajando<BR>
en el comentario de varios libros sobre hacking,<BR>
lamentablemente hay pocos de ellos en castellano.<BR>
     Como sabr&aacute;s, los hackers son bastante elusivos, no<BR>
les gusta dar la cara. Estamos tratando de hacer contacto<BR>
con otros hackers para hacerles entrevistas pero es un<BR>
poco dif&iacute;cil encontrarlos. Por eso no podemos darte<BR>
informaci&oacute;n sobre como comunicarte con ellos. El grupo<BR>
PUA no est&aacute; activo, incluso el Dr. Trucho, su fundador,<BR>
est&aacute; desde hace algunos a&ntilde;os en el exterior por razones<BR>
de estudio.<BR>
</BODY>
</HTML>
