<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>No existe el crimen perfecto</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>NO EXISTE EL CRIMEN PERFECTO</CENTER></H2>

<P><CENTER>Por el Lic. Juan SANTA ANA</CENTER></P>

<P>     Maximiliano era una persona de peque&ntilde;a contextura y<BR>
de personalidad introvertida, circunstancias que durante<BR>
su ni&ntilde;ez lo hicieron blanco de bromas, y forjaron en &eacute;l<BR>
cierto resentimiento hacia el pr&oacute;jimo. Pero su<BR>
inteligencia era lo que sobresal&iacute;a.<BR>
     Terminada la escuela secundar&iacute;a comenz&oacute; a trabajar<BR>
en un centro de c&oacute;mputos, donde aprendi&oacute; todo muy<BR>
r&aacute;pidamente. Poco a poco fue adquiriendo experiencia,<BR>
convirti&eacute;ndose en una de esas personas que sin t&iacute;tulo<BR>
universitario son excelentes analistas y mejores<BR>
programadores. Fue as&iacute; que en base a sus antecedentes<BR>
laborales comenz&oacute; a trabajar en una importante agencia de<BR>
automotores, con un equipo IBM 36 y en lenguaje BASIC. El<BR>
sistema de contabilidad general que hab&iacute;a en esos<BR>
momentos no le gusto porque ten&iacute;a innumerables<BR>
deficiencias. Por eso decidi&oacute; rehacerlo a su gusto en el<BR>
mismo lenguaje, tarea que le demand&oacute; mucho tiempo y<BR>
esfuerzo, pero cumpli&oacute; su objetivo.<BR>
     Si bien la perfecci&oacute;n no existe, se pod&iacute;a decir que<BR>
el sistema era casi perfecto, cubr&iacute;a todas las<BR>
necesidades del usuario. Lo que no cubr&iacute;a las<BR>
expectativas de Maximiliano era su sueldo, pero por su<BR>
car&aacute;cter jamas dijo nada, el s&oacute;lo esperaba que<BR>
reconocieran el valor de su trabajo.<BR>
     Un d&iacute;a, nuestro analista revisaba un programa<BR>
listador de la contabilidad, que sumaba todos los recibos<BR>
de los planes de ahorro, y se dio cuenta de que<BR>
totalizaba de menos y que nadie lo noto. Esto era porque<BR>
s&oacute;lo miraban el resultado final y nunca se verificaba la<BR>
sumatoria. Fue en ese momento cuando tuvo una idea<BR>
&quot;genial&quot;, para cobrarse lo que seg&uacute;n el le correspondia.<BR>
Pero para concretarla precisaba la complicidad de Marta,<BR>
la cajera de la empresa, que siempre se estaba quejando<BR>
de sus necesidades econ&oacute;micas. No se anim&oacute; a confiarle su<BR>
idea hasta el d&iacute;a que la vio realmente apremiada<BR>
econ&oacute;micamente. Le dijo que si ella quer&iacute;a dinero, el la<BR>
podr&iacute;a ayudar. Cuando cobrara las cuotas de los planes de<BR>
ahorro para los nuevos veh&iacute;culos, en caso de colocar una<BR>
fecha anterior al a&ntilde;o en curso, siempre tendr&iacute;a un<BR>
sobrante de caja, y nadie lo notar&iacute;a. Eso s&iacute;, el sobrante<BR>
tendr&iacute;a que ser compartido entre los dos.<BR>
     La duda se instal&oacute; en Marta y le hizo muchas<BR>
preguntas. Las respuestas eran muy t&eacute;cnicas y no las<BR>
entend&iacute;a, lo &uacute;nico que qued&oacute; claro era que &quot;no
va a pasar<BR>
nada, yo se como arreglar todo&quot;.<BR>
     La idea de Maximiliano se basaba en lo siguiente:<BR>
todo cliente que ven&iacute;a a pagar se tenia que llevar un<BR>
recibo. Si este recibo sal&iacute;a mal en el momento de la<BR>
impresi&oacute;n, se pod&iacute;a reimprimir, pero la rutina de<BR>
reimpresi&oacute;n no realizaba los asientos contables del<BR>
dinero ingresado, dado que ya lo hab&iacute;a hecho la primera<BR>
ruitina. Por lo tanto, si se agregaba al programa una<BR>
instrucci&oacute;n para que a fecha incorrecta utilizara la<BR>
rutina de reimpresi&oacute;n, iba a dar como resultado un recibo<BR>
sin imputaciones y que no existir&iacute;a para la contabilidad.<BR>
Al no tener imputaciones eso facilitaba el manejo del<BR>
dato. El recibo tenia que existir para mantener<BR>
correlativos los n&uacute;meros, y en caso de un posible reclamo<BR>
figurar en los listados, por lo tanto modific&oacute; el sistema<BR>
para que estos recibos aparecieran en los listados, pero<BR>
no fueran sumados. Eso dio los resultados deseados, un<BR>
sobrante de caja al poner una fecha incorrecta. Tambi&eacute;n<BR>
fue necesario arreglar los programas de balance mensual<BR>
(cierre de mes). A mediados de a&ntilde;o las &quot;modificaciones&quot;<BR>
estuvieron listas y las instal&oacute; en el sistema. Todo fue<BR>
bien, a tal punto que el &quot;prestigioso&quot; analista renuncio<BR>
al puesto, debido a que iba a poner una casa de venta de<BR>
insumos para computaci&oacute;n.<BR>
     Era el mes de diciembre y Maximiliano dejar&iacute;a de<BR>
trabajar los primeros d&iacute;as de enero, por tal motivo la<BR>
empresa tomo un nuevo empleado para c&oacute;mputos, que<BR>
aprender&iacute;a la mec&aacute;nica del sistema junto a &eacute;l. Previo
a<BR>
su retiro, el empleado infiel procedi&oacute; a adelantar la<BR>
fecha del equipo y grabar nuevamente todos los programas.<BR>
En caso de existir alg&uacute;n problema alegar&iacute;a que los mismos<BR>
fueron modificados con posterioridad a su partida, como<BR>
los mostraba la fecha de grabaci&oacute;n.<BR>
     Todo parec&iacute;a ser el crimen perfecto, pero, como<BR>
veremos, eso no existe.<BR>
     Los primeros d&iacute;as de Enero el nuevo empleado se hizo<BR>
cargo del sistema, y comenzo a trabajar en el balance<BR>
anual, dado que la empresa &quot;era muy prolija en su<BR>
contabilidad&quot;. Pronto not&oacute; que en los listados anuales no<BR>
cerraron los n&uacute;meros. Angel, as&iacute; se llamaba el nuevo<BR>
empleado, por temor de haber cometido un error, comenzo<BR>
un estudio minucioso del sistema, tarea que le demand&oacute;<BR>
varios d&iacute;as, hasta que vio en el programa de emisi&oacute;n de<BR>
recibo la famosa pregunta que si la fecha era incorrecta<BR>
s&oacute;lo imprima y no sume. El nuevo encargado de computos no<BR>
entend&iacute;a lo que pasaba, pero se dio cuenta que estaba<BR>
ante las pruebas de una estafa. Avis&oacute; a los directivos de<BR>
la empresa y estos dieron aviso a la polic&iacute;a.<BR>
     Los investigadores policiales se hicieron presentes,<BR>
por casualidad el mismo d&iacute;a que la D.G.I. La empresa dej&oacute;<BR>
a &eacute;stos &uacute;ltimos la primera inspecci&oacute;n del sistema<BR>
contable, manifestando que cumpl&iacute;a con todos los<BR>
requisitos exigidos por esa Direcci&oacute;n, haciendo alarde de<BR>
la prolijidad del sistema. Cuando le toc&oacute; el turno a la<BR>
polic&iacute;a, lo primero que hicieron fue restaurar las copias<BR>
de seguridad, estas ten&iacute;an las verdaderas fechas de<BR>
grabaci&oacute;n de los programas, que eran anteriores al retiro<BR>
del empleado. Luego inspeccionaron por m&aacute;s de doce horas<BR>
cada uno de los programas hasta determinar la operatoria.<BR>
     Se realiz&oacute; un inventario sobre la suma robada, y dio<BR>
un total de U$ 150.000 en los seis meses de &quot;trabajo&quot; del<BR>
sistema modificado. La empresa cit&oacute; a Maximiliano, sin<BR>
decirle lo que pasaba. Este pens&oacute; que era alguna consulta<BR>
sobre el sistema y fue sin sospechar nada. Cuando lleg&oacute;<BR>
se encontro con los investigadores y con la mirada<BR>
asombrada de sus compa&ntilde;eros, los que pensaban que ese<BR>
hombre era incapaz de matar una mosca.<BR>
     Permanecio tranquilo durante el interrogatorio<BR>
policial, cre&iacute;a que podr&iacute;a excusarse por la fecha de<BR>
grabaci&oacute;n de los programas. Cuando supo que los backup<BR>
(copias de seguridad) ten&iacute;an las fechas ciertas de<BR>
grabaci&oacute;n se desmoron&oacute;, para colmo, Marta estaba siendo<BR>
interrogada en otro sector de la empresa y no sab&iacute;a que<BR>
pasaba. Ambos terminaron confesando.<BR>
     Los estafadores, cajera y analista intentaron<BR>
disminuir la pena reintegrando parte del dinero, pero de<BR>
todas formas fueron detenidos por la justicia.<BR>
</BODY>
</HTML>
