<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Juegos de guerra</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Juegos de Guerra</CENTER></H1>

<P><CENTER>Esta vez nos remontamos hacia atr&aacute;s en el tiempo y<BR>
analizamos este cl&aacute;sico film sobre infiltraciones, a 10<BR>
a&ntilde;os de su estreno. Veamos la influencia que caus&oacute; en la<BR>
segunda generaci&oacute;n de hackers, y qu&eacute; tan realista era la<BR>
historia.</CENTER></P>

<P><CENTER>por Mart&iacute;n Sal&iacute;as</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P>Para comenzar a hablar sobre esta pel&iacute;cula,<BR>
recordemos brevemente su argumento:<BR>
Todo comienza cuando el gobierno norteamericano<BR>
decide probar a los oficiales encargados de disparar los<BR>
misiles nucleares apuntados hacia la URSS (que por<BR>
aquelos d&iacute;as a&uacute;n era el lado de los malos). Para ello<BR>
prepara un simulacro de tercera guerra. En el &uacute;ltimo<BR>
momento, y ante la perspectiva de aniquilar a millones de<BR>
personas, un alto porcentaje de los oficiales, no<BR>
dispara. Esto, por supuesto, pone los pelos de punta a la<BR>
Casa Blanca (vale la pena recordar que nos encontr&aacute;bamos<BR>
en plena era Reagan).<BR>
Finalmente se decide que el NORAD, el centro<BR>
inform&aacute;tico del Departamento de Defensa, ejerza el<BR>
control sobre las lanzaderas nucleares directamente a<BR>
trav&eacute;s de sus computadoras, sin intervenci&oacute;n humana.<BR>
Paralelamente, el film nos presenta a David<BR>
Lightman, un adolescente con algunos problemas de<BR>
comportamiento cuyo hobby, obviamente, son las<BR>
computadoras.<BR>
David es un hacker de nivel medio. En su habitaci&oacute;n<BR>
podemos observar una Tandy Radio Shack TRS-80 (todo un<BR>
cl&aacute;sico de principios de los `80), con arcaicas<BR>
disketteras de 8 pulgadas y, por supuesto, un modem.<BR>
El chico, que se entretiene modificando sus malas<BR>
notas hackeando la computadora del colegio, tiene como<BR>
maestros a un par de miembros de lo que parece ser el<BR>
staff de desarrollo de una compa&ntilde;&iacute;a.<BR>
Leyendo una revista de computaci&oacute;n encuentra el<BR>
aviso del inminente lanzamiento de un juego que promete<BR>
ser muy novedoso. Sin perder tiempo, intenta contactar<BR>
con la empresa productora con la esperanza de &quot;bajarse&quot;<BR>
el programa.<BR>
Para ello recurre a una vieja t&eacute;cnica de las<BR>
conocidas como hack-hack, o hackear a lo bruto. Bas&aacute;ndose<BR>
en la caracter&iacute;stica telef&oacute;nica del tel&eacute;fono que figura<BR>
en el aviso, pone a correr un programa que disca todos<BR>
los n&uacute;meros del 0000 al 9999, y cada vez que recibe<BR>
portadora (el pitido de identificaci&oacute;n de un modem),<BR>
graba el n&uacute;mero y contin&uacute;a.<BR>
De esta manera encuentra todos los n&uacute;meros de esa<BR>
zona que corresponden a computadoras (estos n&uacute;meros, como<BR>
medio de seguridad, generalmente no figuran en la gu&iacute;a).<BR>
Cuando el programa ya ha encontrado unos cuantos<BR>
comienza al probarlos. Contacta con diversas empresas,<BR>
por ejemplo una l&iacute;nea a&eacute;rea, y finalmente, accede a un<BR>
sistema que no se identifica. Prueba varias claves pero<BR>
no pasa nada, hasta que pide un listado de juegos. El<BR>
sistema, entonces, muestra una serie de t&iacute;tulos de<BR>
estrategia, desde ajedrez, asano por varios de<BR>
simulaciones militares, hasta llegar a &quot;Guerra<BR>
termonuclear global&quot;. sin embargo, no puede logonearse<BR>
(ingresar al sistema para utilizarlo).<BR>
Pasa bastante tiempo intentndo pero la computadora<BR>
siempre lo rechaza.<BR>
Cuando consulta con sus gurus (del equipo de<BR>
desarrollo), ellos le hacen notar la presencia de un<BR>
juego titulado &quot;El acertijo de Falken&quot;, y le sugieren que<BR>
este puede ser el nombre del autor, lo que es algo con lo<BR>
que empezar a trabajar.<BR>
As&iacute; comienza la b&uacute;squeda de datos sobre el tal<BR>
Falken, del que descubre, biblioteca del colegio<BR>
mediante, que es un te&oacute;rico de la heur&iacute;stica (una rama de<BR>
la inform&aacute;tica que estudia los sistemas de aprendizaje),<BR>
especilizado en el desarrollo de sistemas que aprenden a<BR>
jugar a trav&eacute;s de la experiencia.<BR>
Poniendo en pr&aacute;ctica otras conocidas t&eacute;cnicas de<BR>
hacking, empieza a probar como passwords palabras<BR>
relacionadas con la vida del profesor, hasta encontrar la<BR>
adecuada: Joshua, el nombre del hijo del cient&iacute;fico.<BR>
Una vez logrado el acceso, la computadora lo saluda<BR>
como si se tratara del mismo Falken, y le propone jugar.<BR>
El chico, obviamente, corre directamente a &quot;Guerra<BR>
termonuclear global&quot;, y, eligiendo encarnar a los rusos,<BR>
lanza un ataque tremendo sobre EEUU.<BR>
Previsiblemente, la computadora a la que accedi&oacute; no<BR>
es la que pertenece a la empresa de juegos sino un de las<BR>
del mencionado NORAD. El soft de &eacute;sta ha sido<BR>
desarrollado por Falken, y el sistema en cuesti&oacute;n se<BR>
encarga de &quot;jugar&quot;, permanentemente a la tercera guerra,<BR>
bas&aacute;ndose en distintas hip&oacute;tesis de conflicto, calculando<BR>
cu&aacute;les son las mejores posibilidades para el caso de una<BR>
guerra real.</P>

<P>El resto de la pel&iacute;cula narra los problemas que suscita<BR>
el juego del lado del NORAD mismo, cuyos sistemas no<BR>
diferencian la simulaci&oacute;n de un ataque real, creando un<BR>
l&iacute;o may&uacute;sculo. Pero esto no vale la pena contarlo. En<BR>
todo caso, si el lector no ha visto la pel&iacute;cula, es<BR>
preferible que la busque en su video club favorito (es<BR>
bastante f&aacute;cil de conseguir), y as&iacute; limitar este art&iacute;culo<BR>
a ver el efecto que &eacute;sta produjo en el p&uacute;blico.</P>

<P>M&aacute;s all&aacute; de ser la primera vez que la figura del hacker<BR>
llegaba a los medios realmente masivos en forma directa<BR>
(hasta ese entonces s&oacute;lo se hab&iacute;an escrito cr&oacute;nicas
sobre<BR>
casos puntuales en la prensa, que, en todo caso,<BR>
resultaban poco esclarecedoras y bastante<BR>
mistificadoras), el film dej&oacute; claro en la conciencia<BR>
colectiva la fragilidad de los sistemas de seguridad de<BR>
los organismos supuestamente ultra-secretos.<BR>
Era com&uacute;n escuchar por esa &eacute;poca que la historia<BR>
estaba basada en un hecho real, y tambi&eacute;n comentarios<BR>
entremezclados y exagerados de otros casos.<BR>
La realidad es que el argumento es mayormente<BR>
ficticio, aunque se basa en sucesos cercanos como la<BR>
famosa intromisi&oacute;n por miembros Chaos Computer Club de<BR>
Alemania en computadoras de la NASA.<BR>
Adem&aacute;s la pel&iacute;cula muestra, como hemos visto,<BR>
t&eacute;cnicas reales de hacking, aunque algunas de ellas est&eacute;n<BR>
simplificadas por la maquinaria hollywoodense, y algunos<BR>
planteos inquietantes para ese momento (en determinado<BR>
momento, la amiga de David le pregunta si no le va a<BR>
costar una fortuna que su computadora disque las diez mil<BR>
combinaciones de la caracter&iacute;sitca telef&oacute;nica, y &eacute;l
le<BR>
responde que &quot;hay maneras de que las llamadas salgan<BR>
gratis&quot;. Esto es una velada alusi&oacute;n a las blue boxes o<BR>
mecanismos similares.)<BR>
El efecto que la pel&iacute;cula caus&oacute; entre los<BR>
aficionados a la computaci&oacute;n fue devastador. El<BR>
incremento inmediato de los intrusos en sistemas ajenos<BR>
fue notable meses despu&eacute;s, y la proliferaci&oacute;n de BBS<BR>
dedicados a los hackers fu&eacute; tremendo.<BR>
Una nueva generaci&oacute;n de piratas inform&aacute;ticos creci&oacute;<BR>
a la luz del film, y innumerables period&iacute;stas comenzaron<BR>
a investigar las actividades de &eacute;stos grupos.<BR>
Esto tuvo un doble efecto, ya que por un lado<BR>
multiplic&oacute; las actividades il&iacute;citas y por otro caus&oacute;
gran<BR>
alarma entre los organismos oficiales.<BR>
Poco tiempo despu&eacute;s comenz&oacute; la cacer&iacute;a por parte del<BR>
FBI y otras agencias de tres letras que culminar&iacute;a con el<BR>
desbaratamiento de varias de las bandas de hackers m&aacute;s<BR>
famosas, como la Legion of Doom, el Inner Circle, y el<BR>
procesamiento judicial por fraudes, abusos de sistemas<BR>
telef&oacute;nicos e inform&aacute;ticos y otros cargos de varios de<BR>
sus miembros, y tambi&eacute;n de algunos ejemplares aut&oacute;nomos.<BR>
Pero eso ya es otra historia, sobre la que<BR>
hablaremos en m&aacute;s adelante, si les interesa el tema.</P>

<P>T&iacute;tulo en castellano: Juegos de Guerra<BR>
T&iacute;tulo original: War Games<BR>
A&ntilde;o de estreno: 1983<BR>
Director: Jhon Badham<BR>
Gui&oacute;n: Lawrence y Walter F. Parkes<BR>
Int&eacute;rpretes: Matthew Broderick, Dabney Coleman, Jhoon<BR>
Wood.
</BODY>
</HTML>
