<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Seguridad en Novell</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Seguridad en una red Novell</CENTER></H1>

<P><CENTER><BR>
por Aldo Castelar</CENTER></P>

<P><CENTER><BR>
Existen en la actualidad gran cantidad de redes<BR>
instaladas, y la mayor&iacute;a usan el software de Novell. Esta<BR>
red es popular por su potencia, por su capacidad para<BR>
manejar una gran cantidad de m&aacute;quinas y por su seguridad.<BR>
Pero... &iquest;Es tan segura como parece?</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P>Una red local, especialmente si es bajo Novell, basa<BR>
su seguridad en la existencia de un solo server, o sea,<BR>
un solo lugar donde est&aacute;n f&iacute;sicamente todos los datos. Al<BR>
instalarla se toma la precauci&oacute;n de que s&oacute;lo tenga acceso<BR>
f&iacute;sico a &eacute;ste la gente que cumple funciones de<BR>
supervisi&oacute;n. El resto se maneja con cuentas que le dan<BR>
determinados privilegios de acceso a ciertas partes de la<BR>
informaci&oacute;n, solamente lo que necesita para cumplir con<BR>
su trabajo. Este esquema es fundamental, ya que ser&iacute;a un<BR>
desastre que cualquier persona pueda modificar por<BR>
ejemplo la planilla de c&aacute;lculos donde est&aacute;n los sueldos y<BR>
decida aument&aacute;rselos sin consultar a su jefe.<BR>
Un problema de seguridad puede pasar principalmente<BR>
por dos lados: o que un usuario adquiera privilegios que<BR>
no le correspondan o que consiga el nombre y el password<BR>
de un usuario con m&aacute;s nivel de acceso que &eacute;l. La primera<BR>
de las posibilidades implicar&iacute;a que alguien cambie o por<BR>
error o a prop&oacute;sito su cuenta en el server. La segunda es<BR>
m&aacute;s peligrosa, ya que en el caso de que accediera con la<BR>
cuenta de otro estar&iacute;a definitivamente desafiando la<BR>
seguridad del sistema con malas intenciones. Para esto<BR>
s&oacute;lo necesitar&iacute;a saber el password de algun otro usuario<BR>
con m&aacute;s privilegios, ya que los nombres no son secretos.<BR>
Una medida de seguridad que implementa el software<BR>
de Novell es la posibilidad de que las passwords est&eacute;n o<BR>
no encriptadas. Utilizando el comando del sistema<BR>
operativo que permite que las passwords no se encripten<BR>
se podr&iacute;a monitorear la actividad de la red y robar<BR>
passwords. De todas formas, esto no es un peligro muy<BR>
com&uacute;n, ya que habr&iacute;a que utilizar equipos especiales para<BR>
captar las se&ntilde;ales de los cables de la red y analizarlas.<BR>
Obviamente esto se dar&iacute;a solo en casos como de espionaje<BR>
industrial, los empleados de la empresa dif&iacute;cilmente<BR>
puedan tener acceso a este tipo de equipos.<BR>
Como siempre, las principales fallas en la seguridad<BR>
se deben a un software mal instalado y no a problemas del<BR>
mismo software. Netware tiene, apenas se instala, los<BR>
nombres de usuario GUEST y SUPERVISOR que no tienen<BR>
passwords. Esto es as&iacute; porque la compa&ntilde;&iacute;a que lo produce<BR>
piensa que sus clientes tomar&aacute;n en cuenta que dejarlos o<BR>
no as&iacute; es su propia responsabilidad. Si el que instal&oacute; la<BR>
red no se preocup&oacute; en cambiarlos, esto es un problema<BR>
grave de seguridad. La cuenta SUPERVISOR puede llegar a<BR>
ser especialmente peligrosa ya que puede dar acceso total<BR>
a la red. Otras cuentas que pueden no tener password<BR>
tienen nombres como TAPE, BACKUP, SERVER, REMOTE,<BR>
CONNECT, NOVELL, etc. Si un usuario puede utilizar SYSCON<BR>
para obtener una lista de todos los nombres de usuario,<BR>
quiz&aacute; encuentre alguna cuenta sin password y la use para<BR>
sus propios fines.<BR>
Algunas de dichas cuentas pueden tener como parte<BR>
del proceso de entrada al sistema un batch que ejecuta<BR>
determinados programas. Por ejemplo, una sistema de<BR>
backup autom&aacute;tico, que ejecuta los programas necesarios<BR>
para llevarlo a cabo. Esto es especialmente peligroso ya<BR>
que para realizar un backup se debe entrar con<BR>
privilegios de supervisor, para que el software permita<BR>
acceder a toda la informaci&oacute;n de la red. En el caso de<BR>
que una persona pueda utilizar esa cuenta y abortar el<BR>
batch con control-C, tendr&iacute;a control total sobre el<BR>
server.<BR>
Existen algunos programas que permitir&iacute;an a<BR>
cualquier usuario tener acceso total. Estos est&aacute;n hechos<BR>
por hackers, dise&ntilde;ados para entrar ilegalmente a una red<BR>
Novell, y son un peligro para su seguridad.<BR>
ThiefNov: Es un residente que captura nombres de<BR>
usuario y passwords, cada vez que un usuario trata de<BR>
acceder a la red copia su nombre y password en un archivo<BR>
oculto.<BR>
TempSup: Es un programa que crea un usuario dentro<BR>
de la red. Tiene dos partes, un programa que crea un<BR>
usuario pero con los mismos privilegios del usuario que<BR>
lo ejecute, y un m&oacute;dulo que le da a cualquier usuario<BR>
derechos de supervisor.<BR>
NetCrack: Es un programa que trabaja mediante la<BR>
fuerza bruta. Trata, para un determinado nombre de<BR>
usuario, de adivinar su password probando todas las<BR>
combinaciones de letras desde AAA en adelante. Este<BR>
m&eacute;todo se puede prevenir con la opci&oacute;n del sistema<BR>
operativo de red de detectar intrusos. De esta forma, si<BR>
un usuario trata de acceder tres veces seguidas con<BR>
password equivocada, cierra la cuenta hasta que un<BR>
supervisor la vuelva a habilitar.
</BODY>
</HTML>
