<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>El Chacal frente a la justicia</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Los hackers y la justicia</CENTER></H2>

<P><CENTER>Por el Lic Juan SANTA ANA</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P><CENTER>No siempre los hackers pasan inadvertidos. Quiz&aacute; alguien<BR>
nota que algo raro sucede en las redes de comunicaciones<BR>
y trata de que la Justicia lo evite. A veces lo logran, a<BR>
veces no.<BR>
</CENTER></P>

<P>En el primer numero de Virus Report, el hacker llamado<BR>
&quot;El Chacal&quot;, mencion&oacute; que conoc&iacute;a al Dr. Trucho
y a<BR>
Nibler con los que encararon proyectos juntos, inclusive<BR>
la &quot;PUA&quot; (Piratas Unidos Argentinos). Seg&uacute;n dice, &quot;surgi&oacute;<BR>
como una broma en su momento y tom&oacute; cierta envergadura<BR>
despu&eacute;s&quot;. Dicha envergadura la tom&oacute; cuando se vieron<BR>
involucrados en una investigaci&oacute;n que estaba realizando<BR>
un Juzgado Federal.<BR>
A mediados del a&ntilde;o 1987 una firma denunci&oacute; que habiendo<BR>
solicitado a la Empresa Nacional de Telecomunicaciones<BR>
(ENTEL) el acceso a la red internacional de datos<BR>
(ARPAC), la facturaci&oacute;n del servicio fue aumentando a tal<BR>
punto que se hizo necesario suspenderlo. A pesar de ello<BR>
la cuenta sigui&oacute; aumentando. Esto dio la pauta de la<BR>
existencia de un intruso en el sistema. La empresa era<BR>
tambi&eacute;n usuaria de la red Delphi, donde tambien notaron<BR>
irregularidades.<BR>
La compa&ntilde;&iacute;a telef&oacute;nica constat&oacute; los n&uacute;meros
hacia donde<BR>
se dirigieron las llamadas, que correspondieron a<BR>
distintos usuarios de redes en los siguientes pa&iacute;ses<BR>
Suiza, Canad&aacute;, Estados Unidos, Alemania, Australia, Hong<BR>
Kong, Reino Unido, y Escocia. La polic&iacute;a, por intermedio<BR>
de Interpol, trat&oacute; de localizar a los destinatarios de<BR>
las comunicaciones. Todo parec&iacute;a f&aacute;cil, luego de obtener<BR>
esta informaci&oacute;n habr&iacute;a que recorrer el camino inverso y<BR>
se detectar&iacute;a al intruso. Pero aparecieron varios<BR>
imprevistos. Los primeros fueron Jur&iacute;dicos. Por ejemplo,<BR>
en Alemania para identificar a un abonado se requiere la<BR>
autorizaci&oacute;n de la Corte Suprema de ese pa&iacute;s. Las otras<BR>
comunicaciones fueron hechas a lugares p&uacute;blicos donde no<BR>
constataba el interlocutor.<BR>
Algunos de las llamadas inform&aacute;ticas fueron las<BR>
siguientes: en Suiza el n&uacute;mero correspondi&oacute; a la Escuela<BR>
Polit&eacute;cnica Federal de Zurich, en Canad&aacute; el destinatario<BR>
era una central que permitia hacer llamadas locales<BR>
dentro de la Provincia de Alberta, no pudiendo detectarse<BR>
al usuario final, en Australia los n&uacute;meros no<BR>
correspondian a ning&uacute;n abonado, en Hong Kong era el<BR>
servicio de Informaci&oacute;n de Datos, en Alemania el<BR>
Instituto de Matem&aacute;tica, y en Estados Unidos los<BR>
destinatarios fueron General Electric y Compuserve.<BR>
La investigaci&oacute;n Judicial sigui&oacute; su curso hasta Octubre<BR>
de 1987, cuando el periodista Enrique Monz&oacute;n del diario<BR>
Clar&iacute;n, en el Suplemento Joven, realiz&oacute; una Nota sobre<BR>
los &quot;Piratas Inform&aacute;ticos&quot; y en unos de sus parrafos<BR>
present&oacute; a los hacker porte&ntilde;os que se agrupaban bajo el<BR>
nombre &quot;Piratas Unidos Argentinos&quot; (PUA).<BR>
Los integrantes de PUA hab&iacute;an dejado con anterioridad<BR>
mensajes en la computadora del periodista haciendo<BR>
referencia a sus actividades, pero hasta el momento nunca<BR>
los profundizaron, ni dieron la cara. Luego de arreglar<BR>
una contrase&ntilde;a en una reuni&oacute;n de usuarios de inform&aacute;tica,<BR>
&quot;El Chacal&quot; se dio a conocer, y se llev&oacute; a cabo el<BR>
reportaje en un caf&eacute;.<BR>
En la entrevista, &quot;El Chacal&quot; manifesto que &quot;la red<BR>
Delphi tiene una falla interesante. Bajo ciertas<BR>
condiciones bastante particulares, cuando uno entra,<BR>
antes de aparecer el pedido del nombre se queda<BR>
enganchado con los usuarios que est&aacute;n en linea&quot;. Otro<BR>
reporteado del grupo fue &quot;Goblin&quot; y dijo &quot;preferimos<BR>
visitar Estados Unidos. Por ejemplo, a trav&eacute;s de CIBA Y<BR>
ARPAC entramos a General Electric, o a Compuserve&quot;.<BR>
Despu&eacute;s de la publicaci&oacute;n de la nota period&iacute;stica no
hizo<BR>
falta mucho m&aacute;s para que la investigaci&oacute;n se orientara<BR>
hacia el grupo &quot;Piratas Unidos Argentinos&quot;, y que la<BR>
empresa que comercializaba la red Delphi reconociera que<BR>
la estaban &quot;hackeando&quot;. Si bien un directivo de la misma<BR>
desminti&oacute; dicho acontecimiento, algunos mails dejados en<BR>
Delphi, no dec&iacute;an lo mismo. Tambi&eacute;n informaciones<BR>
period&iacute;sticas anteriores a la citada, aparecidas en &quot;La<BR>
Naci&oacute;n&quot; y &quot;La Raz&oacute;n&quot; entre los d&iacute;as
23/09/87 y 25/09/87<BR>
ya hac&iacute;an referencia de estos visitantes clandestinos.<BR>
Dejaron un mail pidiendo disculpas por los reportajes,<BR>
que dec&iacute;a en sus partes m&aacute;s destacadas: &quot;1) La intenci&oacute;n<BR>
de P.U.A no ha sido nunca la de provocar perjuicios<BR>
significativos a usuarios particulares de Delphi ni de<BR>
ning&uacute;n otra base. M&aacute;s aun, de las declaraciones del<BR>
Chacal recogidas en la nota, puede observarse la<BR>
distinci&oacute;n que establecemos entre el hacking &eacute;tico y el<BR>
hacking no tan bueno efectuado por personas no tan<BR>
buenas&quot;, en otro p&aacute;rrafo continua diciendo: &quot;3) No ha<BR>
sido la intenci&oacute;n de P.U.A da&ntilde;ar la imagen de Delphi, en<BR>
la nota al Chacal no se hace ninguna menci&oacute;n expresa o<BR>
alusi&oacute;n indirecta a sus fallas de seguridad&quot;<BR>
Los damnificados del hacking estaban desorientados y<BR>
evaluaron entre el ambiente inform&aacute;tico quienes ten&iacute;an<BR>
capacidad y conocimientos para realizar esta tarea.<BR>
Entonces apuntaron a los responsables de dos BBS, a los<BR>
que nunca se les comprob&oacute; nada.<BR>
Los resultados de las llamadas al exterior continuaron<BR>
siendo a lugares p&uacute;blicos, y sin poder hallar a los<BR>
responsables, por los tanto los integrantes de P.U.A. no<BR>
fueron identificados por la Justicia. Siempre quedo la<BR>
duda si ellos fueron los unicos responsables de los todos<BR>
los hechos que se les atribuian. El expediente Judicial<BR>
fue archivado.<BR>
Este nuevo tipo de &quot;delito&quot; en esos a&ntilde;os parecia que<BR>
estaba muy lejos de la Argentina, sobre todo por las<BR>
deficientes comunicaciones, condici&oacute;n que a&uacute;n continua,<BR>
pero comenzaron a hacer tomar conciencia a la Justicia de<BR>
la necesidad de una legislaci&oacute;n adecuada para los<BR>
acontecimientos inform&aacute;ticos, dado que en el caso de<BR>
haberse identificados a los integrantes de P.U.A, dudo<BR>
mucho que se los pudiera haber procesado judicialmente.<BR>
</BODY>
</HTML>
