<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Untitled Document</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Correo</CENTER></H1>

<P>&nbsp;</P>

<H3>Assembler</H3>

<P>Sres. de Virus Report</P>

<P>Les escribo con respecto a la nota &quot;Conceptos de<BR>
Assembler&quot;. Como se poco del tema, pero me parece<BR>
realmente interesante, desear&iacute;a que sigan con notas como<BR>
esa.<BR>
Como no dispongo de un ensamblador me gustar&iacute;a que den un<BR>
ejemplo de como crear un archivo .COM con el Debug que<BR>
viene con el DOS 5.0. Tambien me gustar&iacute;a, si fuera<BR>
posible, una tabla con el significado de los caracteres<BR>
del 00 al 1F.<BR>
Gracias, Paco de Varela. (Franciso Pedro Vertedor)</P>

<P>VR: Como habr&aacute;s visto, la nota sobre assembler en<BR>
realidad es una serie de notas. Tenemos planeado qu sea<BR>
una serie larga, as&iacute; que vas a tener assembler para rato.<BR>
Para ensamblar los programas o ejemplos que vayan<BR>
apareciendo, pod&eacute;s bajarte del BBS de Magazine Publishing<BR>
(951-1792) el A86, un assembler shareware. Con el Debug<BR>
pod&eacute;s hacer solamente programas muy peque&ntilde;os porque es<BR>
muy complicado usarlo para programar.<BR>
Con respecto a los caracteres que nombr&aacute;s, o 'de<BR>
control', su significado depende del contexto, o sea, de<BR>
para que se usen. No tienen un significado &uacute;nico que<BR>
pueda expresarse en una tabla.</P>

<H3>Jerusalem y Sunday</H3>

<P>Sres. de Virus Report</P>

<P>Ante todo quiero felicitarlos por los primeros n&uacute;meros de<BR>
su revista, ya que los temas que tocan son muy<BR>
importantes.<BR>
Les cuento un caso que me sucedi&oacute;: Un d&iacute;a me prestaron un<BR>
diskette que me hab&iacute;an dicho que ten&iacute;a virus, aunque yo<BR>
cre&iacute;a que era una broma. Cuando lo reviso con el scan 99<BR>
me aparece el virus &quot;Jerusalem&quot;, entonces decid&iacute; borrarlo<BR>
en ese mismo momento. Una vez borrado, us&eacute; el diskette.<BR>
Al d&iacute;a siguiente scaneo el r&iacute;gido y me aparece el virus<BR>
Jerusalem, pero no pod&iacute;a borrarlo porque me hab&iacute;a<BR>
infectado el scan del disco r&iacute;gido. Us&eacute; el scan 99 de un<BR>
diskette, pero tambi&eacute;n se me infect&oacute; porque el diskette<BR>
no estaba protegido. Despu&eacute;s us&eacute; el scan 93, que me<BR>
detect&oacute; el virus Sunday. Extra&ntilde;ado, consegu&iacute; un scan
99<BR>
limpio, y cuando scaneaba con este me dec&iacute;a que ten&iacute;a el<BR>
Jerusalem. Luego de muchas pruebas lo pude borrar con<BR>
clean c: /a /m /sp /chkhi [sunday].<BR>
Ahora, mi duda es si este virus puede volver a aparecer,<BR>
y por que el scan 99 y el 93 me indicaban distintos<BR>
virus. &iquest;Era porque ten&iacute;a ambos?.<BR>
Desde ya muchas gracias.</P>

<P>Julio Pablo Comadira</P>

<P>VR: Primero que nada, seguramente tuviste poco cuidado al<BR>
revisar y limpiar el diskette, porque qued&oacute; el virus en<BR>
&eacute;l. Por eso te infect&oacute; el disco r&iacute;gido. Seguramente,<BR>
ahora que el scan no detecta nada, ya no ten&eacute;s ning&uacute;n<BR>
virus en el disco. El scan 99 y el scan 93 detectan<BR>
distintos virus porque el Sunday es una variante del<BR>
Jerusalem. Algunas versiones del scan los diferencian,<BR>
pero las versiones mas modernas, para optimizar su c&oacute;digo<BR>
y velocidad, s&oacute;lo buscan lo que tienen en comun entre<BR>
ellos y los detectan como un solo virus.
</BODY>
</HTML>
