<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Untitled Document</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>De mi propia invenci&oacute;n</CENTER></H1>

<P>:</P>

<P>Entrevistamos a Hugo Pe&ntilde;a, un argentino que cre&oacute; algunos<BR>
virus, entre los que se encuentran el Xuxa y el Anti-D.<BR>
Se define como un artista y justifica haber creado sus<BR>
virus como un mensaje de amor y paz.<BR>
</P>

<P>VR &iquest;Cual es tu edad y ocupaci&oacute;n?<BR>
HP Tengo 27 a&ntilde;os y mi ocupaci&oacute;n actual es la de artista.<BR>
VR &iquest;Qu&eacute; tipo de artista?<BR>
HP Soy un creador. Soy un artista multifac&eacute;tico. A veces<BR>
creo programas y a veces creo historias.<BR>
VR &iquest;Qu&eacute; tipo de historias?<BR>
HP Historias que se me ocurren. Bueno, uno es<BR>
continuamente creador... En realidad todos somos<BR>
artistas.<BR>
VR Con respecto a los virus que hiciste...<BR>
HP El primero fue el llamado Xuxa<BR>
VR &iquest;Y el Anti-D, no fue anterior?<BR>
HP Fueron muy simult&aacute;neos. En realidad, la maquinaria que<BR>
moviliz&oacute; al virus fue similar, lo que cambi&oacute; fue la<BR>
orientaci&oacute;n del programa.<BR>
VR &iquest;C&oacute;mo se te ocurri&oacute; hacer virus?<BR>
HP Continuamente me veo bombardeado de mensajes<BR>
publicitarios de todo tipo, por ejemplo me molesta la<BR>
propaganda de hepatalgina en el subte. Entonces yo dec&iacute;a:<BR>
&iquest;por qu&eacute; tengo que ser v&iacute;ctima de todos esos mensajes<BR>
publicitarios de productos comerciales, de religiones, de<BR>
sectas, de ideas pol&iacute;ticas, por qu&eacute; yo no puedo<BR>
transmitir mi mensaje?. Todo el mundo puede transmitir su<BR>
mensaje, &iquest;Por qu&eacute; yo no puedo transmitir el m&iacute;o? Yo
no s&eacute;<BR>
mucho de publicidad, no tengo los medios necesarios para<BR>
publicitarlo en forma masiva, bueno la manera m&aacute;s c&oacute;moda<BR>
para m&iacute; fue crear algo que se reproduzca solo para<BR>
generar mi propio mensaje que yo quer&iacute;a transmitir a la<BR>
gente.<BR>
VR &iquest;Cu&aacute;l es el mensaje?<BR>
HP El mensaje es de amor, es el mensaje de Xuxa. Ya<BR>
sabemos que ella cambi&oacute; su carrera para dedicarse a los<BR>
ni&ntilde;os, a transmitir mensajes de amor, de paz. En realidad<BR>
fue una prueba piloto, lo que yo querr&iacute;a transmitir son<BR>
muchas cosas. Una de esas cosas fue que vean a Xuxa. De<BR>
ah&iacute; la necesidad de publicitarla, avisando que empieza su<BR>
programa, en este caso.<BR>
El virus empieza a sonar a la hora del comienzo del<BR>
programa de Xuxa.<BR>
VR &iquest;Y en anti-D?<BR>
HP Surgi&oacute; de una manera similar. La caracter&iacute;stica<BR>
principal o el s&iacute;ntoma que lo detecta es que te anula la<BR>
tecla &quot;D&quot;. Y surgi&oacute; como especie de venganza. A m&iacute;
se me<BR>
rompi&oacute; la barra espaciadora del teclado, no sab&iacute;a bien si<BR>
eso se deb&iacute;a a fallas del fabricante, o tal vez a una<BR>
conspiraci&oacute;n. Entonces por eso se me ocurri&oacute; anular la<BR>
&quot;D&quot;.<BR>
VR &iquest;Por qu&eacute; justamente la &quot;D&quot;?<BR>
HP Siempre se dice la &quot;D&quot; de dedo.<BR>
VR &iquest;Fue muy dif&iacute;cil hacer un virus?<BR>
HP No fue dif&iacute;cil. Fueron muchas cosas que confluyeron en<BR>
ese momento. Una de ellas fue que tuve un muy buen<BR>
profesor de assembler donde estudi&eacute;. Otra fue mi grado de<BR>
desocupaci&oacute;n en ese momento... Siempre aburre trabajar en<BR>
los mismos lenguajes, y bueno, el hecho de hacer cosas en<BR>
assembler era un camino inexplorado.<BR>
VR Y justo hiciste un virus en assembler, de entre todas<BR>
las cosas que se pueden hacer.<BR>
HP Fue la &uacute;nica manera que tuve para transmitir mi<BR>
mensaje en forma masiva. Yo no tengo los medios para<BR>
poder anunciar por televisi&oacute;n. Esta era la &uacute;nica manera.<BR>
Uno crea una especie de vida y le dice a esa vida que<BR>
vaya y transmita ese mensaje. Tal vez todo ser vivo tiene<BR>
un mensaje para transmitir. Ellos sobreviven al ataque<BR>
cruel de aquellos que quieren anular ese mensaje. Porque<BR>
quieren que no se difunda.<BR>
VR Tus virus son bastante benignos en general. &iquest;Qu&eacute;<BR>
opin&aacute;s de virus tan destructivos como el Michelangelo,<BR>
por ejemplo?<BR>
HP Supongo que tiene que ver mucho con la personalidad<BR>
del creador. En toda idea que se transmite puede haber un<BR>
mensaje destructivo o un mensaje pac&iacute;fico. En pa&iacute;ses en<BR>
guerra, sus pobladores se ven presionados por esos<BR>
mensajes de ir a la guerra y matar al enemigo. Eso es un<BR>
mensaje destructivo que uno recibe, y bueno, esto ser&iacute;a<BR>
similar.<BR>
VR Entonces vos pens&aacute;s que un virus es un mensaje.<BR>
HP Claro, siempre est&aacute; lo dual, en todas las cosas, &iquest;no?<BR>
Los extremos, lo negro y lo blanco, lo bueno y lo malo.<BR>
No hay que relacionar el virus con lo malo, con lo<BR>
destructivo. El virus, independientemente de su actividad<BR>
ben&eacute;fica o maligna, tiene su propia existencia. Existe<BR>
porque es inevitable.<BR>
VR &iquest;C&oacute;mo inevitable?<BR>
HP Claro, como uno puede hacer un virus maligno tambi&eacute;n<BR>
puede hacer uno benigno.<BR>
VR &iquest;Quer&eacute;s decir que de cualquier forma alguien lo har&iacute;a?<BR>
HP Y, todav&iacute;a no se descubri&oacute; la f&oacute;rmula de la paz
y del<BR>
bien. El mal existe entre nosotros.<BR>
VR Vos habl&aacute;s de un mensaje para difundir. &iquest;Diseminas tus<BR>
virus, entonces?<BR>
HP Eso es un momento crucial. Cuando en un principio<BR>
escrib&iacute;a mis virus y experimentaba, no ten&iacute;a la m&aacute;s<BR>
m&iacute;nima intenci&oacute;n. Lo hac&iacute;a con fines experimentales,
para<BR>
mi propia recreaci&oacute;n. Lleg&oacute; un momento cuando estuvieron<BR>
terminados, en el caso del Xuxa, o del Anti-D, no se cual<BR>
fue primero, fue una especie de pregunta que me hice.<BR>
&iquest;Para qu&eacute; los hice, si despu&eacute;s no los voy a distribuir?.<BR>
Es una pregunta que sigo haci&eacute;ndome todas las noches.<BR>
VR &iquest;Pero los distribuiste?<BR>
HP No se sabe. Es muy dif&iacute;cil contestar a esa pregunta,<BR>
porque uno a veces accidentalmente puede llegar a<BR>
contaminarse, cosa que me pas&oacute;.<BR>
VR &iquest;Tuviste tu m&aacute;quina contaminada por tus propios virus?<BR>
HP S&iacute;, fue muy divertido. Ellos mismos contagiaron mis<BR>
programas. Y otra cosa curiosa. Cuando estaba<BR>
experimentando con estos virus ten&iacute;a algunos otros<BR>
conocidos, y un d&iacute;a me llen&eacute; de Xuxas y de Ninas. (Nina<BR>
es un virus b&uacute;lgaro no muy complicado) Y se me ocurri&oacute;<BR>
que ser&iacute;a bueno hacer virus diferenciados por sexo. Virus<BR>
que tengan en sus c&oacute;digos la posibilidad de mezclarse y<BR>
crear una nueva generaci&oacute;n.<BR>
VR Habl&aacute;s mucho de virus y de vida. &iquest;Pens&aacute;s que los
virus<BR>
son seres vivos?<BR>
HP Y, no s&eacute;. Eso es muy pol&eacute;mico, decir qu&eacute; es la vida
y<BR>
qu&eacute; no es la vida. &iquest;Por qu&eacute; decir a partir de ac&aacute;
es<BR>
caliente y a partir de all&aacute; fr&iacute;o? &iquest;Por qu&eacute; a
partir de<BR>
ac&aacute; es vida y a partir de all&aacute; no es vida?... &iquest;Por
qu&eacute;<BR>
eso de etiquetar tan tajantemente? Eso forma parte de una<BR>
necesidad de clasificaci&oacute;n, de autoritarismo. Tendr&aacute;n<BR>
caracter&iacute;sticas de seres vivos, o tendr&aacute;n caracter&iacute;sticas<BR>
que no lo hacen entrar en esa categor&iacute;a. No hay que<BR>
preocuparse por ese tipo de cosas. No es importante.<BR>
Tienen caracter&iacute;sticas que los hacen parecer a lo que<BR>
ser&iacute;a un virus org&aacute;nico, biol&oacute;gico. Y tambi&eacute;n
est&aacute; en<BR>
discusi&oacute;n si &eacute;stos son seres vivos o no, ah&iacute; est&aacute;n
esos<BR>
l&iacute;mites. Y bueno, no soy yo el que los va a poner.<BR>
VR &iquest;Qu&eacute; pens&aacute;s de gente como Patricia Hoffman o John<BR>
McAfee, que se dedican a estudiar los virus y<BR>
combatirlos?<BR>
HP Bueno, primero, es que ellos hacen su trabajo. Eso de<BR>
estudiarlos, me parece muy interesante. Ojal&aacute; yo tuviera<BR>
cientos de virus para dejarlos libres en mi m&aacute;quina. Pero<BR>
de ellos mismos, opino que est&aacute;n equivocados.<BR>
VR &iquest;Equivocados por qu&eacute;?<BR>
HP Porque ser&iacute;a como una caza furtiva. Incluso est&aacute;n en<BR>
t&eacute;rminos de desigualdad de condiciones. Ellos tienen el<BR>
conscenso de la gente y de los grupos de poder. Pobres<BR>
virus, ellos est&aacute;n indefensos frente a eso.<BR>
VR Veo que segu&iacute;s hablando de los virus como si fueran<BR>
animalitos.<BR>
HP Animalitos, s&iacute;, pobrecitos. Quien hace un virus sabe<BR>
que en realidad son simples instrucciones. Como cuando<BR>
uno habla con una m&aacute;quina despachadora de gaseosas o<BR>
cuando uno habla con una radio que se descompuso, uno<BR>
termina hablando con las paredes... y con los virus. Pero<BR>
si vamos a hablar t&eacute;cnicamente de lo que es un virus, no<BR>
hay por qu&eacute; hablarles, no hay que temer por ello. Veo que<BR>
tu preocupaci&oacute;n se centra en eso, si el virus es vivo o<BR>
no. Si uno le habla a una cosa descompuesta o algo por el<BR>
estilo, uno le habla a los virus. Es una forma m&aacute;s<BR>
ilustrativa para el pueblo.<BR>
VR Entonces no hac&eacute;s diferencia entre hacer un virus y<BR>
hacer un anti-virus.<BR>
HP No, yo no me voy a poner en esa de formar dos bandos,<BR>
los que hacen antivirus son enemigos de los otros. Eso es<BR>
libre, cada uno hace el programa que quiere.<BR>
VR Volviendo al tema de los virus da&ntilde;inos, hay gente que<BR>
perdi&oacute; mucha informaci&oacute;n, mucho trabajo, dinero,<BR>
esfuerzo.<BR>
HP S&iacute;, yo no estoy de acuerdo con los virus malignos, yo<BR>
nunca har&iacute;a virus que da&ntilde;en.<BR>
VR Incluso los virus benignos puede crear colisiones con<BR>
otros programas, incompatibilidades, o pueden romper<BR>
informaci&oacute;n.<BR>
HP Bueno, hay gente inexperta que pueden provocar da&ntilde;os<BR>
no previstos por ellos mismos. Pero uno, que tiene los<BR>
suficientes conocimientos, puede llegar a controlar esas<BR>
situaciones.<BR>
VR Entonces un virus bien hecho no ser&iacute;a peligroso para<BR>
vos y ser&iacute;a algo bueno.<BR>
HP Ser&iacute;a una manera de transmitir algo, que uno se ve<BR>
imposibilitado de transmitirlo por otros medios. Siempre<BR>
un virus tiene un mensaje, por algo se hace.<BR>
VR &iquest;Cu&aacute;l es el mensaje del virus Anti-D, cuando una<BR>
persona se puede volver loca pensando que se rompi&oacute; el<BR>
teclado porque no funciona la tecla?<BR>
HP El mensaje ser&iacute;a &iexcl;PELOTUDO!, ser&iacute;a una especie de<BR>
labor educativa. Vos dec&iacute;s: 'no la tecla &quot;D&quot;', es un<BR>
desaf&iacute;o que le est&aacute;s planteando. Lo somet&eacute;s a un especie<BR>
de desaf&iacute;o donde tiene que saber qu&eacute; est&aacute; pasando.
Y<BR>
despu&eacute;s de enterarse, esa persona va a salir enriquecida,<BR>
porque es experiencia adquirida.<BR>
VR &iquest;No pens&aacute;s que la gente tiene otras cosas m&aacute;s<BR>
importantes que hacer?<BR>
HP S&iacute;, pero yo no puedo estar en un virus pregunt&aacute;ndole a<BR>
la gente '&iquest;qu&eacute; ten&eacute;s que hacer hoy?'. Cuando vos prend&eacute;s<BR>
la televisi&oacute;n y recib&iacute;s esas frases que tratan de vender,<BR>
no te est&aacute;n pidiendo permiso.<BR>
VR Claro, pero apagar el televisor es muy f&aacute;cil.<BR>
HP Apag&aacute; la computadora.<BR>
VR Bueno, mucha gente apag&oacute; la computadora el d&iacute;a del<BR>
Michelangelo.<BR>
HP Y para eso est&aacute;n los anti-virus. Ahora encontramos la<BR>
utilidad de los anti-virus. El que quiere tener virus que<BR>
no compre anti-virus y que no los use. Y si no, que<BR>
compre anti-virus.<BR>
VR Pero la mayor parte de la gente no quiere tener virus.<BR>
HP Eso es cierto. Porque es algo nuevo, siempre lo nuevo<BR>
recibe una resistencia.<BR>
VR &iquest;Pens&aacute;s que en alg&uacute;n momento la gente va a querer<BR>
tener virus?<BR>
HP &iquest;Por qu&eacute; no? Los virus biol&oacute;gicos siempre tuvieron<BR>
relaci&oacute;n con las enfermedades y ahora se est&aacute;<BR>
investigando con los avances tecnol&oacute;gicos, se est&aacute;n<BR>
encontrando utilidades como por ejemplo hacer que<BR>
sinteticen medicamentos. Y bueno, as&iacute; podemos llegar a<BR>
tener virus que te solucionen problemas, como errores de<BR>
compilaci&oacute;n, qu&eacute; se yo.<BR>
VR Mucha gente odia a los virus y a los que los hacen.<BR>
HP S&iacute;, los odian, es cierto. Parte se debe a que no s&eacute;<BR>
qui&eacute;n se le ocurri&oacute; relacionar virus con destrucci&oacute;n,<BR>
pero no siempre es as&iacute;. Entonces el miedo, el<BR>
desconocimiento de la gente que no sabe como act&uacute;an, la<BR>
gente puede imaginarse cosas fantasiosas de lo que puede<BR>
hacer un virus, ese tipo de cosas influyen en lo que<BR>
piensa la gente. A lo mejor eso es lo que provoca que la<BR>
gente los odie.<BR>
VR &iquest;Tus virus tienen alguna caracter&iacute;stica que los<BR>
diferencie de los dem&aacute;s?<BR>
HP No, todo virus es distinto, pero con respecto a la<BR>
t&eacute;cnica no tienen nada muy diferente. Puede llegar a<BR>
tener a lo mejor marcas que no fueron detectadas por que<BR>
no afectan al funcionamiento del virus pero que est&aacute;n<BR>
ah&iacute;. Como mensajes, nombres. Por ejemplo est&aacute; mi nombre,<BR>
Hugo, est&aacute; dentro del c&oacute;digo, medio escondido, pero el<BR>
que lo sabe leer lo encuentra.<BR>
VR &iquest;Qu&eacute; opin&aacute;s de los autores de otros virus, conoces<BR>
alguno?<BR>
HP Conozco el autor del Piazzolla. Lo felicito porque<BR>
dentro de todo es una tarea muy creativa. Cuando te<BR>
contest&eacute; que era artista es porque de alguna manera es<BR>
arte. Porque estimula la imaginaci&oacute;n, es una creaci&oacute;n.<BR>
VR &iquest;Y conoc&eacute;s a alg&uacute;n otro autor de virus?<BR>
HP As&iacute; personalmente, no.<BR>
VR &iquest;Para vos los dem&aacute;s autores de virus tambi&eacute;n son<BR>
artistas?<BR>
HP S&iacute;, son medio artistas.<BR>
VR &iquest;Incluso los que hacen virus destructivos como Dark<BR>
Avenger? (Dark Avenger es un famoso autor b&uacute;lgaro de<BR>
virus, muchos de ellos muy destructivos).<BR>
HP Pero como yo no los conozco personalmente no te puedo<BR>
decir si son todos iguales, si tienen los mismos<BR>
objetivos. Parece que no, hay muchas variedades. Hay<BR>
algunos que s&oacute;lo molestan, otros que destruyen, hay<BR>
algunos que simplemente se reproducen y no hacen nada y<BR>
hay otros que los hacen por investigaci&oacute;n.<BR>
VR &iquest;En alg&uacute;n momento pod&eacute;s pasar al ataque, a hacer
un<BR>
virus maligno?<BR>
HP No, no est&aacute; en mis planes. Lo que puede pasar es lo<BR>
siguiente: en la actualidad hay mucha gente que con la<BR>
fama y el auge de los virus, quiere experimentar y por<BR>
ejemplo cambiar cierta porci&oacute;n del c&oacute;digo de alg&uacute;n
virus<BR>
conocido, entonces puede pasar que ma&ntilde;ana se encuentre un<BR>
Xuxa que rompa todo el disco r&iacute;gido a alguien, y eso no<BR>
podemos evitarlo porque son mutaciones de otros virus.<BR>
VR Que hace otra gente...<BR>
HP Claro, y no pod&eacute;s proteger los c&oacute;digos de un virus, no<BR>
es ejecutable como los dem&aacute;s programas. Mejor dicho, si,<BR>
pero son f&aacute;ciles de seguir por quien sabe hacerlo. Son<BR>
instrucciones que las pod&eacute;s cambiar y ya es otro virus o<BR>
una variedad de un virus. Hubo casos de variaciones de<BR>
virus conocidos.<BR>
VR Si te echaran del trabajo, o algo as&iacute;, &iquest;har&iacute;as un<BR>
virus como venganza? Es decir &iquest;utilizar&iacute;as ese<BR>
conocimiento para hacer el mal?<BR>
HP Claro, cuando uno quiere vengarse quiere romperle la<BR>
cara al otro, herirlo f&iacute;sicamente, puede hacerle mil<BR>
cosas, y dentro de esas posibilidades puede estar el<BR>
virus, &iquest;por qu&eacute; no? Si vos agarr&aacute;s una botella de agua<BR>
mineral y se la romp&eacute;s en la cabeza a alguien, fue usada<BR>
como arma, y no fue creada para el mal. Originariamente<BR>
esa botella ten&iacute;a un aspecto inocente, solamente serv&iacute;a<BR>
para tomar. Si ma&ntilde;ana se comete una injusticia, se puede<BR>
usar un virus como arma, son cosas que uno puede evaluar.<BR>
Pero no est&aacute; en mis planes distribuir un virus que haga<BR>
da&ntilde;o.<BR>
VR &iquest;Qu&eacute; le dir&iacute;as a la gente a la que se le ocurre
hacer<BR>
un virus?<BR>
HP Que lo disfrute mucho. Que sea capaz de inventar<BR>
nuevos virus y de ir m&aacute;s all&aacute;. De intentar hacer algo<BR>
nuevo. As&iacute; como se habla de distintas categor&iacute;as de<BR>
virus, distintas generaciones. Siempre hay muchas<BR>
posibilidades para hacer en un virus.<BR>
VR &iquest;Por ejemplo?<BR>
HP Y no te voy a contar porque son los pr&oacute;ximos virus asi<BR>
que eso lo reservamos para cuando salgan.<BR>
VR Pero hay virus encriptados, stealth...<BR>
HP Ves, bueno eso fue una evoluci&oacute;n natural que sigui&oacute;<BR>
del virus m&aacute;s simple hasta mayores sofistificaciones.<BR>
Tiene que ver con lo art&iacute;stico y el desaf&iacute;o de hacer algo<BR>
nuevo. Todas esas mejoras que se hicieron en los virus<BR>
fueron surgiendo naturalmente. Se fueron sofisticando<BR>
cada vez m&aacute;s a medida que era necesario. Esta lucha entre<BR>
los que tratan de eliminar al virus y ellos que buscan<BR>
sobrevivir, es una analog&iacute;a con teor&iacute;as como la<BR>
evolucionista.<BR>
VR Una evoluci&oacute;n natural, pero dirigida tal vez.<BR>
HP S&iacute; de alguna manera dirigida, tendr&iacute;a muchas<BR>
caracter&iacute;sticas similares.<BR>
VR &iquest;Qu&eacute; le dir&iacute;as a las personas que han perdido<BR>
informaci&oacute;n, meses de trabajo como consecuencia de un<BR>
virus?<BR>
VR Primero le dir&iacute;a que Xuxa no fue. Y le dir&iacute;a lo mismo<BR>
que si fuera una v&iacute;ctima de un robo, un asalto.<BR>
VR &iquest;Pero si una persona perdi&oacute; informaci&oacute;n por culpa
de<BR>
uno de tus virus?<BR>
HP Eso no va a pasar.<BR>
VR &iquest;C&oacute;mo pod&eacute;s estar seguro?<BR>
HP Porque el virus lo hice yo. Y ellos tienen en sus<BR>
c&oacute;digos instrucciones para no da&ntilde;ar. Son simples<BR>
instrucciones, borrar, destruir, o simplemente tocar<BR>
bellas melod&iacute;as. Es como comprarse cualquier aparato<BR>
electr&oacute;nico y en &eacute;l vengan instrucciones para da&ntilde;arte.<BR>
Esto es similar. Los programas hacen lo que vos les<BR>
digas. Tal vez la pregunta se refiere a que la gente<BR>
puede pensar que un virus puede llegar a ser tan vivo que<BR>
puede llegar a decidir qu&eacute; hacer, voy a agarrar a este y<BR>
le destruyo todo.<BR>
VR Puede ser por un error tuyo.<BR>
HP Eso pasa mucho. Lo normal ser&iacute;a poner lo que ponen los<BR>
productos comerciales: &quot;No nos hacemos responsable por<BR>
los da&ntilde;os causados&quot;, as&iacute; como las pel&iacute;culas de
acci&oacute;n y<BR>
violencia, pueden causar da&ntilde;os en algunos pobres ni&ntilde;os<BR>
inocentes, nadie se hace responsable por eso. Es una<BR>
advertencia que hay que poner en los virus.<BR>
VR Pero los virus no es algo voluntario, vos no te<BR>
contagi&aacute;s un virus porque quer&eacute;s.<BR>
HP No, es como un mosquito que te pica y vos no lo<BR>
llam&aacute;s.<BR>
VR &iquest;Y entonces que tiene que ver la advertencia?<BR>
HP De alguna manera vos no sab&eacute;s qui&eacute;n cre&oacute; el mosquito<BR>
para que te digan que te puede picar, y en cambio el Xuxa<BR>
lo hice yo y puedo decir que tengas cuidado, que puede<BR>
da&ntilde;ar si ten&eacute;s alg&uacute;n programa raro. Hasta ahora no<BR>
ocurri&oacute;. Podemos habilitar una oficina, tal vez cuando<BR>
tenga plata. Le devolvemos la plata que perdi&oacute;. Mi virus<BR>
no est&aacute; relacionado con la gente que perdi&oacute; informaci&oacute;n.<BR>
Mi virus no es una herramienta para hacer da&ntilde;o.<BR>
</BODY>
</HTML>
