<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Virus Imposibles</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Virus imposibles</CENTER></H1>

<P><CENTER>Por Fernando Bonsembiante</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P><CENTER>En los medios no especializados muchas veces aparecen<BR>
noticias sobre virus. Lamentablemente, debido a la falta<BR>
de informaci&oacute;n de que sufren, suelen tener graves<BR>
errores. A veces parecen hechos a prop&oacute;sito para aumentar<BR>
las ventas de sus publicaciones, mostrando a los virus<BR>
m&aacute;s peligrosos de lo que son.</CENTER></P>

<P>&nbsp;</P>

<H3>Virus de modem</H3>

<P>El a&ntilde;o pasado, con el esc&aacute;ndalo del Michel&aacute;ngelo,
se<BR>
habl&oacute; en muchos lugares de que el virus infectaba las<BR>
m&aacute;quinas a trav&eacute;s del modem. Esto est&aacute; originado por
una<BR>
exceso de anlog&iacute;a con el virus biol&oacute;gico. La idea es que<BR>
si uno puede contagiarse de un resfr&iacute;o con solamente<BR>
hablar con una persona, tambien podr&iacute;a contagiarse de un<BR>
virus inform&aacute;tico en una comunicaci&oacute;n con una m&aacute;quina<BR>
infectada. Esto no puede ser m&aacute;s erroneo. Es imposible<BR>
que un virus pase por el modem sin que lo notemos. Para<BR>
contagiarse un virus por modem deber&iacute;amos bajar de un BBS<BR>
un archivo infectado y luego ejecutarlo, pero ser&iacute;a<BR>
equivalente a haber conseguido dicho archivo de otra<BR>
fuente por diskette, el hecho de que pase por modem no<BR>
aumenta el peligro. Siempre tenemos que ejecutar el<BR>
programa infectado para que el virus pueda activarse. En<BR>
el caso de los virus de boot sector, como el<BR>
Michelangelo, esto es todav&iacute;a menos probable. Deber&iacute;amos<BR>
bajar de un BBS una imagen de disco completa infectada,<BR>
luego re-crearla en un diskette, y bootear con &eacute;l para<BR>
poder infectarnos. Es una secuencia demasiado complicada<BR>
como para ser muy peligrosa. Adem&aacute;s, menos del 1 por<BR>
ciento de los programas shareware se distribuyen en forma<BR>
de imagen de disco. Otro punto en contra a estos virus<BR>
por modem es que los BBS son extremadamente cuidadosos en<BR>
cuanto a los virus, es muy dificil encontrar archivos<BR>
infectados en ellos.<BR>
Otro argumento que se da a favor de los virus por modem<BR>
es la existencia de un supuesto sub-carrier en los modems<BR>
de 2400 o mas velocidad. Este ser&iacute;a como el carrier<BR>
normal que transmite datos, pero se tratar&iacute;a de un<BR>
carrier paralelo no usado por los protocolos comunes de<BR>
transmision, pero que un virus podr&iacute;a utilizar para<BR>
propagarse. Primero que nada, el mismo criterio de que<BR>
debemos ejecutar un programa para que el virus pueda<BR>
activarse es v&aacute;lido ac&aacute;. Por otra parte, no existe ningun<BR>
sub-carrier, ser&iacute;a un desperdicio de ancho de banda muy<BR>
grande, porque un modem de 2400 que pudiera transmitir<BR>
algo m&aacute;s adem&aacute;s de lo normal ser&iacute;a vendido como un
modem<BR>
de mas velocidad, ese ser&iacute;a el efecto pr&aacute;ctico de dicho<BR>
sub-carrier. La idea alocada de un sub-carrier puede<BR>
venir de que los modems de mas de 2400 fabricados por US<BR>
Robotics, norma HST, tienen dos carriers distintos,<BR>
porque usan dos canales de datos, uno en un sentido de<BR>
alta velocidad, para datos, y uno en el otro sentido de<BR>
baja velocidad, para comandos. Pero es simplemente una<BR>
norma que tiene una sola direccion de transferencia de<BR>
alta velocidad, switcheable de acuerdo a los comandos<BR>
recibidos por el canal lento. Esto de ninguna forma sirve<BR>
para transmitir un virus. Y en el caso de que el virus<BR>
pueda aprovechar el procesador y la memoria del mismo<BR>
modem para transmitirse, tambien es una locura. Los<BR>
modems usan procesadores distintos y muy poca memoria, y<BR>
las implementaciones son tan distintas que ser&iacute;a<BR>
imposible dise&ntilde;ar un virus para modems.</P>

<H3>Virus que infectan ROM - Eprom</H3>

<P>Este es otro mito que a veces se escucha. Los virus que<BR>
pueden modificar la memoria ROM o meterse en ella. Si<BR>
esto fuera posible, los virus ser&iacute;an extremadamente<BR>
peligrosos, ya que la ROM controla toda las operaciones<BR>
de la m&aacute;quina y es lo primero en ejecutarse cuando<BR>
encendemos nuestra computadora. Pero el mismo nombre de<BR>
la memoria lo dice, ROM, Read Only Memory, es imposible<BR>
que un virus pueda modificarla o introducirse en ella.<BR>
La memoria Eprom ser&iacute;a posible modificarla, en principio.<BR>
El problema es que para modificarla se debe primero<BR>
borrar utilizando rayos ultravioletas o una fuente de<BR>
electricidad, y para grabarla nuevamente debe tambien<BR>
usarse una fuente externa de electricidad. Mientras no<BR>
existan virus que traigan sus propias bater&iacute;as<BR>
el&eacute;ctricas, es imposible que suceda.<BR>
La unica forma de que haya un virus en estos tipos de<BR>
memoria ser&iacute;a que el fabricante ya lo incluyera en esta.<BR>
Esto no ser&iacute;a un virus en realidad, sino un troyano,<BR>
porque si bien podr&iacute;a hacer da&ntilde;o no podr&iacute;a reproducirse
a<BR>
otras m&aacute;quinas. Lo &uacute;nico que podr&iacute;a hacerse ser&iacute;a<BR>
introducir una rutina que infecte la m&aacute;quina con un<BR>
virus, pero ya no tendr&iacute;amos en si un virus sino un<BR>
'dropper', una rutina depositadora de virus.</P>

<H3>Virus que infectan CMOS</H3>

<P>La memoria CMOS es modificable por programa y adem&aacute;s no<BR>
se borra al apagar la m&aacute;quina, ya que queda energizada<BR>
por una pila. Es usada para guardar cierta informaci&oacute;n<BR>
b&aacute;sica para el BIOS, como ser las caracter&iacute;sticas f&iacute;sicas<BR>
del sistema. Este podr&iacute;a ser un excelente blanco para un<BR>
virus, ya que no se borrar&iacute;a al apagar la PC. El problema<BR>
es que es muy poca memoria como para guardar algo que<BR>
valga la pena. Adem&aacute;s, est&aacute; casi toda usada para guardar<BR>
datos del BIOS, y si este detecta informaci&oacute;n inv&aacute;lida<BR>
resetea los valores autom&aacute;ticamente, o causa problemas de<BR>
funcionamiento en la m&aacute;quina. Por otro lado, esta memoria<BR>
tampoco se ejecuta en ningun momento, son solo datos, por<BR>
lo cual el virus nunca se activar&iacute;a.<BR>
Otra posiblidad es que un virus utilice estos datos como<BR>
parte del ataque al sistema o como defensa. Recientemente<BR>
se habl&oacute; de un virus que modifica el CMOS para evitar que<BR>
el sistema bootee de disketera y siempre bootee con el<BR>
virus cargado del disco r&iacute;gido. Esto es algo muy<BR>
relativo, ya que no todos los BIOS soportan esta funcion,<BR>
y la CMOS no es standard en estos tipos de datos. Lo que<BR>
puede suceder es que el virus trate de modificar la<BR>
secuencia de booteo y termine modificando, en un BIOS<BR>
ligeramente distinto, por ejemplo la velocidad del BUS, y<BR>
la m&aacute;quina deje de funcionar. Un virus as&iacute; podr&iacute;a<BR>
existir, es mas, existen reportes sobre &eacute;l, pero ser&iacute;a<BR>
extremadamente inestable debido a lo poco confiable que<BR>
es ese manipuleo del CMOS. El virus que hace esto,<BR>
llamado CMOS1, ser&iacute;a por lo tanto poco peligroso.</P>

<H3>Virus que infectan etiquetas de disco</H3>

<P>A principios de este a&ntilde;o sali&oacute; en una revista<BR>
norteamericana una nota donde se hablaba de un supuesto<BR>
virus infecta la etiqueta del disco (volume label o<BR>
nombre del disco). Este virus se esconder&iacute;a en la<BR>
etiqueta del disco y se ejecutar&iacute;a desde all&iacute;.<BR>
Lamentablemente estas etiquetas son simplemente el nombre<BR>
de un archivo especial de cero bytes de contenido, el<BR>
espacio que ocupa realmente en el disco es el mismo que<BR>
el de cualquier entrada de directorio. Lo que ocupa un<BR>
nombre de archivo en un directorio son 32 bytes, y una<BR>
etiqueta ocupa lo mismo por ser no mas que eso. En ese<BR>
lugar cabe el virus m&aacute;s peque&ntilde;o conocido, que solo tiene<BR>
30 bytes, pero como una entrada de directorio no es<BR>
ejecutable por si misma, esto es absolutamente imposible.<BR>
No confundir estos imposibles virus de etiqueta de disco<BR>
con los virus de directorio o de FAT, como el Dir II, que<BR>
se basan en un principio completamente distinto.</P>

<H3>Virus que pasan por la l&iacute;nea el&eacute;ctrica</H3>

<P>Otro tipo de virus imposibles son los que se transmiten<BR>
por v&iacute;a de la corriente el&eacute;ctrica. Esto se origin&oacute;
como<BR>
una broma, pero nunca est&aacute; de m&aacute;s aclararlo. La energ&iacute;a<BR>
el&eacute;ctrica que alimenta nuestras m&aacute;quinas no tiene ninguna<BR>
relaci&oacute;n con el software que ellas ejecutan. Si bien un<BR>
problema el&eacute;ctrico puede causar errores en el sofware,<BR>
esos errores son f&iacute;sicos, por ejemplo, una parte de la<BR>
memoria corrupta por no haber recibido corriente<BR>
el&eacute;ctrica en un momento determinado. Nunca la energ&iacute;a<BR>
el&eacute;ctrica puede por si misma modificar el contenido de la<BR>
memoria o del disco, ya que para eso necesitar&iacute;a violar<BR>
las leyes de la f&iacute;sica que pemiten que funcionen los<BR>
chips que componen las PC. Si bien se pueden transmitir<BR>
datos en forma de ondas dentro de la corriente el&eacute;ctrica,<BR>
decir que eso pueda afectar el funcionamiento de la<BR>
m&aacute;quina ser&iacute;a equivalente a decir que la composici&oacute;n<BR>
qu&iacute;mica del papel en el que est&aacute; impreso esta nota puede<BR>
cambiar su significado.</P>

<H3>Virus que se meten en archivos de datos</H3>

<P>Como dijimos antes, es imposible que un virus se active<BR>
si no se ejecuta como programa. Un virus que se meta<BR>
integramente en un archivo de datos no ser&iacute;a ejecutado<BR>
nunca. La &uacute;nica posibilidad ser&iacute;a que el virus est&eacute;
parte<BR>
en un ejecutable y parte en un archivo de datos, y al<BR>
ejecutarse ese programa cargar&iacute;a el resto del virus de<BR>
ese archivo. En ese caso dicho archivo funcionar&iacute;a como<BR>
un overlay para el virus. De esta forma, si tratamos a<BR>
los archivos ejecutables como datos, o sea, si no los<BR>
ejecutamos o los guardamos simplemente dentro de un<BR>
archivo .ZIP por ejemplo, o los guardamos como backup,<BR>
aunque tengan virus no pueden afectarnos de ninguna<BR>
forma.</P>

<H3>Virus que pasan de un tipo de computadora a otra</H3>

<P>Este es otro imposible, pero que tiene algo de verdad. Un<BR>
virus no puede pasar de un tipo de computadora a otra,<BR>
por ejemplo un virus de Mac no puede infectar una PC, ni<BR>
viceversa. Esto se debe a que tanto el procesador como el<BR>
sistema operativo son totalmente distintos, y no existe<BR>
la compatibilidad necesaria como para correr programas de<BR>
una en la otra. La posibilidad es por ejemplo, en<BR>
m&aacute;quinas Unix, que aunque tengan distinto hardware y<BR>
procesador comparten un sistema operativo. En este caso<BR>
el virus podr&iacute;a pasar como c&oacute;digo fuente de una a la otra<BR>
y ser recompilado, con lo cual podr&iacute;a ser ejecutado. Este<BR>
es el caso de por ejemplo el gusano de Internet, que a<BR>
pesar de no ser un virus, utilizaba este mecanismo para<BR>
diseminarse entre las distintas m&aacute;quinas de la red, todas<BR>
bajo sistema operativo Unix.</P>

<H3>Virus heridos</H3>

<P>Por &uacute;ltimo, un caso del que se habl&oacute; por televisi&oacute;n
hace<BR>
un tiempo en este pa&iacute;s, fue el de una persona que dijo<BR>
que si se remov&iacute;a mal un virus era todav&iacute;a m&aacute;s peligroso<BR>
que el virus original. La frase fue 'un virus herido es<BR>
peligroso como un animal herido'. Esto es un error, ya<BR>
que un virus mal removido es un programa al que le falta<BR>
una parte, pero el efecto que puede causar es<BR>
impredecible pero nunca muy complicado. No puede destruir<BR>
una m&aacute;quina, o formatear un disco, o borrar archivos.<BR>
Puede colgarse, por ejemplo, o hacer que el programa<BR>
infectado no funcione. No existen virus que detecten que<BR>
est&aacute;n semi destruidos y tomen represalias debido a esto.<BR>
Para hacerlo deber&iacute;an ser extremadamente complejos, y si<BR>
el intento de remoci&oacute;n destruy&oacute; la parte donde hac&iacute;an<BR>
esta comprobaci&oacute;n jam&aacute;s podr&iacute;an darse cuenta de lo<BR>
sucedido. Ser&iacute;a igual a cualquier programa corrupto,<BR>
dejar&iacute;a de funcionar correctamente, pero no ser&iacute;a<BR>
peligroso por ello.</P>

<H3>Conclusion</H3>

<P>Todos estos ejemplos nos demuestran que debemos ser<BR>
cuidadosos cuando nos hablan de un virus nuevo, y tenemos<BR>
que tomar las cosas con precauci&oacute;n. Un virus no es mas<BR>
que un programa, no tiene nada m&aacute;gico que lo haga<BR>
superior a cualquiera que tengamos en nuestra m&aacute;quina,<BR>
por lo tanto debemos tener sentido comun y pensar bien<BR>
antes de creer cualquier rumor que aparezca en cualquier<BR>
medio. Si creemos cualquier cosa estaremos aterrorizados<BR>
por cualquier bromista o ignorante que quiera hacernos<BR>
pasar un mal rato.<BR>
</BODY>
</HTML>
