<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Los piratas del chip</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Los piratas del chip</CENTER></H1>

<P><CENTER>Subtitulado &quot;La mafia inform&aacute;tica al desnudo&quot;,
este<BR>
fabuloso trabajo de investigaci&oacute;n sobre el tema, es quiz&aacute;<BR>
una obra imprescindible para cualquier persona interesada<BR>
 en la seguridad inform&aacute;tica.</CENTER></P>

<P><CENTER>por Mart&iacute;n Sal&iacute;as</CENTER></P>

<P>&nbsp;</P>

<P>Todo comenz&oacute; cuando la Bell Telephone decidi&oacute; reemplazar<BR>
a las operadoras por sistemas electr&oacute;nicos. Para ello, en<BR>
primer lugar, cambi&oacute; el sistema de discado por pulsos (el<BR>
que a&uacute;n utilizamos en la Argentina), por el de tonos.<BR>
     Al evitar la intervenci&oacute;n humana, las comunicaciones<BR>
se agilizaron terriblemente, a la vez que se convert&iacute;an<BR>
en algo totalmente an&oacute;nimo e incontrolable.<BR>
     Los precursores de lo que desembocar&iacute;a en el moderno<BR>
arte del hacking fueron los phreakers, inquietos<BR>
jovenzuelos entusiastas de la libertad absoluta. Surgidos<BR>
en el entorno de las revueltas estudiantiles y el<BR>
hippismo en plenos a&ntilde;os sesenta, cre&iacute;an que las centrales<BR>
telef&oacute;nicas de Ma Bell (como llaman al imperio<BR>
telef&oacute;nico) deb&iacute;an ser utilizadas indiscriminadamente por<BR>
el p&uacute;blico. Power to the people. El poder al pueblo.<BR>
Entre tanta agitaci&oacute;n ideol&oacute;gica comenzaron a surgir<BR>
algunos verdaderos expertos en el tema.<BR>
     El momento culminante llegar&iacute;a cuando la propia<BR>
Bell, en un rapto de estupidez, difundi&oacute; entre sus<BR>
t&eacute;cnicos (varios miles distribuidos por todos los EEUU)<BR>
un bolet&iacute;n explicando el sistema de frecuencias que se<BR>
utilizaba (adem&aacute;s de los tonos que emit&iacute;a un tel&eacute;fono<BR>
normal al pulsar el teclado), para transmitir informaci&oacute;n<BR>
sobre ruteo y tarifas. Como era de esperar, estos<BR>
&quot;secretos&quot; se difundieron a una velocidad sorprendente<BR>
entre los j&oacute;venes estudiantes e ingenier&iacute;a, dando lugar a<BR>
toda una industria subterr&aacute;nea de manipulaci&oacute;n de las<BR>
l&iacute;neas.<BR>
     En poco tiempo aparecieron las cajas azules,<BR>
peque&ntilde;os dispositivos que emit&iacute;an los pitidos necesarios<BR>
para comunicarse entre cualquier punto sin pagar,<BR>
conociendo apenas algunas reglas de env&iacute;o e la<BR>
informaci&oacute;n en el orden y momento preciso.</P>

<P>     El primer cap&iacute;tulo de este interesant&iacute;simo libro<BR>
narra con lujo de detalle esta &eacute;poca inici&aacute;tica del<BR>
delito inform&aacute;tico.<BR>
     Con la liviandad y el sentido de la an&eacute;cdota que<BR>
conforman lo mejor del nuevo periodismo, Clough<BR>
(inform&aacute;tico brit&aacute;nico de carrera, convertido en uno de<BR>
los principales especialistas en virolog&iacute;a inform&aacute;tica<BR>
por causas de fuerza mayor) y Mungo (un joven periodista<BR>
estadounidense especializado en el tema) llevan adelante<BR>
las m&aacute;s de trescientas p&aacute;ginas del libro con ritmo e<BR>
inter&eacute;s crecientes.<BR>
     Construyen una verdadera cronolog&iacute;a del hacking, y<BR>
aportan, cosa poco com&uacute;n, un detallado an&aacute;lisis de los<BR>
or&iacute;genes y derivaciones del fen&oacute;meno.<BR>
     As&iacute;, comienzan con los inocentes d&iacute;as del<BR>
surgimiento del phreaking, poblados de personajes<BR>
notables como el insigne Captain Crunch, quien se<BR>
divert&iacute;a llamando desde una cabina telef&oacute;nica con su caja<BR>
azul a distintas centrales alrededor del mundo hasta dar<BR>
toda la vuelta y hacer sonar la cabina de al lado para<BR>
hablar con s&iacute; mismo. Como Joe Engressia, el joven ciego<BR>
que hac&iacute;a phreaking silbando los tonos, cuyo verdadero<BR>
sue&ntilde;o era conseguir trabajar en Bell. Como los famosos<BR>
Steven Wozniack y Steven Jobs, fundadores de la exitosa<BR>
Apple Corporation, que financiaron gran parte del<BR>
proyecto de la m&iacute;tica Apple II fabricando y vendiendo<BR>
cajas azules por todo el pa&iacute;s.</P>

<P>     La historia contin&uacute;a con la aparici&oacute;n de las redes<BR>
inform&aacute;ticas y sus entradas telef&oacute;nicas. Con la aparici&oacute;n<BR>
de los modems caseros y la transformaci&oacute;n de la palabra<BR>
hacker, utilizada inicialmente para denominar a los<BR>
genios de la programaci&oacute;n, en un t&eacute;rmino que inspiraba<BR>
pavor: el utilizado para nombrar a los intrusos en<BR>
sistemas ajenos.<BR>
     Los autores exponen los inicios y desarrollo de las<BR>
t&eacute;cnicas favoritas de los hackers: la ingenier&iacute;a social,<BR>
aplicada a convencer a las personas entre tonos<BR>
autoritarios o condescendientes de que quien est&aacute; al<BR>
tel&eacute;fono es un superior que necesita informaci&oacute;n<BR>
urgentemente, y as&iacute; conseguir claves, n&uacute;meros de tel&eacute;fono<BR>
reservados, etc. La zambullida en la basura de las<BR>
centrales telef&oacute;nicas y compa&ntilde;&iacute;as de computaci&oacute;n
para<BR>
conseguir documentaci&oacute;n clasificada y comprender<BR>
t&eacute;cnicamente sus objetivos preferidos. El estudio<BR>
concienzudo de las falencias de seguridad de los grandes<BR>
sistemas operativos, que permiten colarse sin ser<BR>
notados.<BR>
     Describen tambi&eacute;n los blancos preferidos para la<BR>
diversi&oacute;n y para el negocio. Los casos son numerosos en<BR>
cualquiera de los dos casos. Desde aquellos que<BR>
entablaban batallas contra los administradores de sus<BR>
sistema preferido, volvi&eacute;ndolo loco con intromisiones<BR>
sucesivas, asign&aacute;ndose derechos de acceso superiores a<BR>
los de &eacute;stos mismos, llegando incluso a cerrarles la<BR>
puerta en la cara. Hasta qui&eacute;nes se dedicaban a vivir del<BR>
hacking apoder&aacute;ndose de n&uacute;meros de tarjeta de cr&eacute;dito,<BR>
alterando transacciones bancarias para quedarse su<BR>
tajada, etc.<BR>
     Pero el libro est&aacute; muy lejos de ser un incentivo a<BR>
la pirater&iacute;a. Sin negar simpat&iacute;a y admiraci&oacute;n hacia<BR>
algunos de los individuos estudiados, los autores exponen<BR>
los peligros que estas intromisiones generan a diversos<BR>
niveles para toda la sociedad, y finalmente, describen en<BR>
cada caso el proceso, a veces largo y tortuoso, que<BR>
desemboc&oacute; en el arresto y condena en la mayor&iacute;a de los<BR>
casos.<BR>
     No quedan fuera de la obra, por supuesto, esa<BR>
extra&ntilde;a clase de hacker dedicada al sutil arte de dise&ntilde;ar<BR>
virus. M&aacute;s a&uacute;n, hacen un racconto minucioso del origen de<BR>
los primeros gusanos, programas autorreproductores<BR>
producidos como entretenimiento y con fines de<BR>
investigaci&oacute;n te&oacute;rica. Cuentan como se construy&oacute; una
moda<BR>
entre los universitarios inform&aacute;ticos y como se inici&oacute; la<BR>
idea de los programas que viajaran de m&aacute;quina en m&aacute;quina<BR>
v&iacute;a diskette o redes.<BR>
     La explosi&oacute;n de lo que posteriormente ser&iacute;an<BR>
denominados virus, los primeros caballos de Troya, las<BR>
bombas de tiempo instaladas en sistemas por venganza, son<BR>
analizados en totalidad en un cap&iacute;tulo aparte, para<BR>
desembocar en el siguiente, focalizado en un extra&ntilde;o<BR>
fen&oacute;meno cultural.<BR>
     Como explica uno de los entrevistados, si crear<BR>
virus fuera una actividad paga, Bulgaria ser&iacute;a<BR>
probablemente una de las naciones m&aacute;s ricas del mundo.<BR>
Parad&oacute;jicamente, la virulencia b&uacute;lgara tiene su ra&iacute;z
en<BR>
las ansias de crecimiento en base a la industria<BR>
inform&aacute;tica. A principios de los 80, el anciano<BR>
presidente Todor Zhivkov decidi&oacute; que su pa&iacute;s deb&iacute;a<BR>
convertirse en una superpotencia tecnol&oacute;gica, y para<BR>
ello, deb&iacute;an fabricar computadoras. Se inici&oacute; entonces<BR>
una carrera incre&iacute;ble de fabricaci&oacute;n de clones de IBM PC.<BR>
Estos eran por cierto de dudosa calidad, pero el<BR>
aguijoneo del estado gener&oacute; que en poco tiempo Bulgaria<BR>
apostar&aacute; todo a llenarse de PCs. Hasta que alguien<BR>
descubri&oacute; que no ten&iacute;an software, ni dinero para<BR>
comprarlo. As&iacute; que empez&oacute; a piratearse.<BR>
     Como todos sabemos, la pirater&iacute;a en un sentido<BR>
fomenta la pirater&iacute;a en otros, y as&iacute;, entre malas artes y<BR>
la pericia t&eacute;cnica aprendida necesariamente para superar<BR>
las protecciones (que por aquella &eacute;poca eran una pr&aacute;ctica<BR>
m&aacute;s com&uacute;n y sofisticada que hoy en d&iacute;a) Bulgaria cri&oacute;
una<BR>
generaci&oacute;n de inform&aacute;ticos j&oacute;venes, brillantes y con<BR>
pocos escr&uacute;pulos.<BR>
     Clough y Mungo siguen la pista de la ola de virus<BR>
que lleg&oacute; hasta el punto en que en Bulgaria se<BR>
registraban en promedio dos nuevos virus por semana, y<BR>
especialmente rastrean la carrera del m&aacute;s famosos de sus<BR>
creadores: Dark Avenger, art&iacute;fice de unos cuantos de los<BR>
m&aacute;s famosos, sofisticados y da&ntilde;inos virus existentes.</P>

<P>     Los hackers, llamados tambi&eacute;n Cyberpunks (nombre<BR>
heredado de autores de ciencia ficci&oacute;n que hablan sobre<BR>
este submundo, como William Gibson y Bruce Sterling), han<BR>
ganado un lugar prominente en el &aacute;mbito de la<BR>
delincuencia moderna. Sus comienzos inofensivos y su<BR>
gestas romanticistas se pierden hoy en una confusa mezcla<BR>
de extorsiones, fraudes, da&ntilde;os indiscriminados, espionaje<BR>
y delincuencia com&uacute;n.<BR>
     Por supuesto, &eacute;sta no es la regla. Afortunadamente,<BR>
quedan a&uacute;n muchos de ellos que navegan por las redes (o<BR>
esa inmensa red de redes interconectadas entre s&iacute; que<BR>
algunos llaman cyberespacio) en busca de conocimiento,<BR>
con esp&iacute;ritu de aventura pero tambi&eacute;n de investigaci&oacute;n,<BR>
con respeto y sin malicia, apenas con picard&iacute;a y, eso s&iacute;,<BR>
bastante astucia.<BR>
     Este libro est&aacute; dedicado, sin duda, a ellos.</P>

<P>&nbsp;</P>

<P>&nbsp;</P>

<P>Titulo original:   Aproaching zero<BR>
Autores:           Bryan Clough &amp; Paul Mungo<BR>
Colecci&oacute;n:         Documentos<BR>
Editorial:         Ediciones B<BR>
Extensi&oacute;n:         352 p&aacute;ginas<BR>
Edici&oacute;n original:  1992
</BODY>
</HTML>
