<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Scan</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>SCAN</CENTER></H1>

<P><CENTER>&nbsp;</CENTER></P>

<P><CENTER>Uno de los m&aacute;s famosos anti virus del mundo es el Scan.<BR>
En el pa&iacute;s es el m&aacute;s usado, por ser shareware y de<BR>
actualizaci&oacute;n constante. Veamos como funciona.<BR>
</CENTER></P>

<P>     Scan es un programa Shareware producido por McAfee<BR>
associates. Es un detector de strings, busca dentro de<BR>
los programas que se le indiquen pedazos de c&oacute;digo o<BR>
datos pertenecientes a virus conocidos. De esta forma<BR>
puede determinar con gran rapidez la existencia o no de<BR>
virus conocidos en cualquier sistema, aunque antes de<BR>
usarse jam&aacute;s se le hubiese aplicado ninguna medida<BR>
preventiva con un antivirus. Para lograr esto contiene<BR>
una base de datos con toda la informaci&oacute;n necesaria como<BR>
para diferenciar esos virus de entre los archivos<BR>
normales del disco. Su eficiencia depende m&aacute;s que nada de<BR>
la informaci&oacute;n que consigue la gente de McAfee para la<BR>
actualizaci&oacute;n de esa base con los nuevos virus. Mes a mes<BR>
sale una versi&oacute;n nueva con nuevas definiciones de virus,<BR>
los cuales provienen de todo el mundo. Han conseguido<BR>
armar una red impresionante de investigadores y<BR>
colaboradores voluntarios en todo el mundo, con lo cual<BR>
pasa muy poco tiempo desde que se descubre un virus en<BR>
cualquier lugar hasta que se lo incluye en el programa.<BR>
     Una contra que tiene este m&eacute;todo de detecci&oacute;n es que<BR>
peque&ntilde;os cambios en el virus lo hacen totalmente<BR>
indetectable. Un programador de virus podr&iacute;a tomar un<BR>
archivo infectado can alguna creaci&oacute;n suya y pasarle el<BR>
scan para ver si lo detecta. Si es as&iacute;, puede ir<BR>
cort&aacute;ndole partes hasta detectar que porci&oacute;n es la que<BR>
usa Scan para detectarlo. El m&eacute;todo que suelen usar los<BR>
creadores de virus es una b&uacute;squeda recursiva binaria:<BR>
cortar el virus en dos mitades, pasarle el scan /A a cada<BR>
mitad, ver en que mitad est&aacute; el string de identificaci&oacute;n<BR>
y repetir el proceso con la mitad donde detecta el virus<BR>
hasta encontrar la porcion m&iacute;nima que detecta. Dentro de<BR>
esa porcion est&aacute; el string. Si se quiere reducir a&uacute;n mas<BR>
el string hasta que sea exactamente lo que usa el Scan se<BR>
pueden ir borrando alternativamente el primer y &uacute;ltimo<BR>
byte del archivo hasta que deje de detectarlo. Por lo<BR>
general ese string es de unos 10 o 20 bytes. Cuando el<BR>
programador del virus tiene el string simplemente se fija<BR>
a que parte del c&oacute;digo corresponde y lo cambia levemente,<BR>
por ejemplo cambiando un mov ax,0 por un xor ax,ax. Eso<BR>
basta para que el scan no lo detecte m&aacute;s.</P>

<P>     Utilizando el programa</P>

<P>     Su uso es extremadamente sencillo. Con solo tipear<BR>
'scan c:' se hace que el programa busque en todo el drive<BR>
C:, incluyendo subdirectorios. Adem&aacute;s de eso, busca en la<BR>
memoria los virus que pueden afectar su correcto<BR>
funcionamiento, como ser los 'stealth', o sea, no<BR>
detectables en el disco, o los que se propagan con<BR>
cualquier tipo de acceso a los archivos (precauci&oacute;n sin<BR>
la cual el solo hecho de pasar el Scan har&iacute;a que el disco<BR>
se llene de virus). En el caso de detectarse un virus<BR>
'cr&iacute;tico' en memoria el programa avisa al usuario y deja<BR>
de funcionar en el momento, pidiendo que se carge el DOS<BR>
desde un disco limpio para evitar mayores problemas.<BR>
     Para los que quieren mayor seguridad, existen m&aacute;s<BR>
opciones. Podemos especificar un directorio donde va a<BR>
buscar el programa, con lo cual podemos verificar si el<BR>
software nuevo que tenemos est&aacute; limpio o no, sin tener<BR>
que revisar nuevamente todo el disco. Con la opci&oacute;n /A<BR>
podemos revisar todos los tipos de archivos, y no solo<BR>
los que tienen extensiones de ejecutable. Con /CHKHI<BR>
podemos revisar la memoria desde 0Kb hasta 1088Kb. Con<BR>
/NOMEM podemos decirle que no revise la memoria, opci&oacute;n<BR>
&uacute;til por ejemplo si queremos revisar gran cantidad de<BR>
diskettes y acelerar el proceso. La opci&oacute;n /M hace que<BR>
busque todos los virus conocidos en memoria, con lo cual<BR>
podemos detectar r&aacute;pidamente la actividad de un virus.<BR>
     <BR>
     Controlando el sistema</P>

<P>     Scan tambi&eacute;n tiene opciones para verificar la<BR>
integridad de los programas, con lo cual puede detectar<BR>
si han sido modificados por alg&uacute;n virus. Permite al<BR>
usuario guardar la informaci&oacute;n necesaria como para<BR>
comparar el estado del archivo sano con su estado actual,<BR>
y detectar cualquier diferencia que pueda ser producida<BR>
por un virus. De esta forma se implementa un control muy<BR>
efectivo sobre el sistema. Tambien se puede usar un modo<BR>
extendido que permite incluso restaurar los archivos a su<BR>
estado original antes de la posible infecci&oacute;n. Tambien<BR>
esto puede ser usado para controlar &aacute;reas cr&iacute;ticas del<BR>
disco, como ser la tabla de particiones, el sector de<BR>
booteo y los archivos de sistema.</P>

<P>     Limpiando la m&aacute;quina de virus</P>

<P>     &iquest;Qu&eacute; hacer cuando descubrimos un virus en nuestra<BR>
m&aacute;quina y queremos sacarlo? Con el Scan podemos utilizar<BR>
la opci&oacute;n /D, que cada vez que encuentra un archivo<BR>
infectado nos da la opci&oacute;n de borrarlo de forma que sea<BR>
imposible de recuperar. Pero esto no nos sirve para virus<BR>
de tablas de particiones, de sectores de booteo o cuando<BR>
simplemente no queremos destruir por completo el archivo<BR>
infectado. Para esto usamos el programa acompa&ntilde;ante del<BR>
Scan, el Clean. Esta utilidad nos permite eliminar<BR>
algunos virus conocidos de nuestra m&aacute;quina. Simplemente<BR>
hay que decirle qu&eacute; virus detect&oacute; el Scan y luego se<BR>
encarga de borrarlo si eso es posible. Hay una lista<BR>
bastante limitada de virus que puede limpiar, por lo cual<BR>
se recomienda usarlo s&oacute;lo en caso de no disponer de una<BR>
copia del archivo sin infectar. En el caso de virus de<BR>
boot sector o de tabla de particiones es mucho m&aacute;s &uacute;til,<BR>
ya que es m&aacute;s dificil limpiar esas &aacute;reas del sistema sin<BR>
utilizar programas complejos y sin saber bastante de lo<BR>
que se est&aacute; haciendo. De todas formas Clean limpia los<BR>
virus m&aacute;s comunes, por lo tanto no representan tanto<BR>
problema sus falencias.</P>

<P>     Ayuda y manuales</P>

<P>     Scan puede mostrar sus mensajes en ingl&eacute;s, frances o<BR>
espa&ntilde;ol, lo cual lo hace m&aacute;s f&aacute;cil de usar para quienes<BR>
hablan esos idiomas. El manual que lo acompa&ntilde;a, un<BR>
archivo de texto, es bastante completo, y no es necesario<BR>
tener grandes conocimientos como para usar el programa<BR>
con su ayuda, ya que todo est&aacute; muy bien explicado.<BR>
</BODY>
</HTML>
