<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Virus XUXA</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1>Analisis de virus</H1>

<P>Por Aldo B. Castelar</P>

<P>&nbsp;</P>

<P>En este n&uacute;mero vamos a analizar los virus hechos por Hugo<BR>
Pe&ntilde;a, nuestro entrevistado. Estos son el Xuxa y el Anti-D</P>

<H3>Xuxa</H3>

<P>El Xuxa es un virus que infecta todos los archivos .com<BR>
excepto el command.com. La rutina de infecci&oacute;n realiza el<BR>
contagio cada vez que se ejecuta un programa infectable,<BR>
si &eacute;ste no est&aacute; previamente infectado. El autor del virus<BR>
me lo entreg&oacute; personalmente a mi, por lo tanto no se sabe<BR>
si est&aacute; o no diseminado en el ambiente inform&aacute;tico.<BR>
Todav&iacute;a no se vi&oacute; ningun Xuxa fuera de las copias de<BR>
estudio que existen.<BR>
Fue hecho a principios de 1992, y existen dos versiones.<BR>
Estas tienen muy poca diferencia entre si,<BR>
fundamentalmente en porciones no cr&iacute;ticas del c&oacute;digo y<BR>
datos. Se instala residente en memoria y ocupa 1,712<BR>
bytes.<BR>
Su efecto es muy interesante: entre las 17 y las 18 horas<BR>
toca por el parlante de la m&aacute;quina la canci&oacute;n 'Illarie'<BR>
del Show de Xuxa. Justamente, el show era emitido en ese<BR>
horario por telvisi&oacute;n en el a&ntilde;o en que el virus fue<BR>
creado. La canci&oacute;n suena en background, no interrumpe los<BR>
programas que est&eacute;n funcionando en la m&aacute;quina en el<BR>
momento de su activaci&oacute;n. Solo se notar&aacute; que la m&aacute;quina<BR>
se hace un poco m&aacute;s lenta mientras suena la m&uacute;sica.<BR>
Toma las interrupciones 1Ch y 21h. La interrupci&oacute;n 1Ch es<BR>
llamada 18.2 veces por segundo por la interrupci&oacute;n 08h.<BR>
Se usa normalmente para ejecutar peque&ntilde;as rutinas en<BR>
background o cuando se necesita controlar algo que debe<BR>
ocurrir en algun momento determinado, desde un residente.<BR>
En esta interrupci&oacute;n instala la rutina que verifica si es<BR>
la hora correcta de activaci&oacute;n, y en ese caso, toca la<BR>
musica. La interrupci&oacute;n 21h la usa para infectar a los<BR>
nuevos programas que se ejecuten. Cada vez que se pide al<BR>
DOS la ejecuci&oacute;n de un programa, el virus verifica si es<BR>
un .com y si no est&aacute; previamente infectado. Si lo debe<BR>
infectar copia el c&oacute;digo residente del virus a un archivo<BR>
llamado TMP$$TMP.COM y el c&oacute;digo del programa a infectar<BR>
despu&eacute;s de &eacute;ste. Cuando ya cre&oacute; el programa infectado,<BR>
borra el primero y renombra el temporario como el<BR>
programa original.<BR>
La idea de virus musicales es vieja, ya hace tiempo<BR>
existen virus como el Oropax o Yankee Doodle que a<BR>
determinada hora, en el caso del segundo, o poco despues<BR>
de infectar un archivo, en el caso del primero, tocaban<BR>
distintas melod&iacute;as. Es interesante que en el caso del<BR>
Yankee Doodle incluso coincide la hora de activaci&oacute;n con<BR>
el Xuxa, a las 17 horas. La diferencia es que el el<BR>
Yankee Doodle la melod&iacute;a suena s&oacute;lo una vez, y en el Xuxa<BR>
se repite hasta las 18 horas. Ambos virus son<BR>
completamente independientes entre si, ninguno de los dos<BR>
est&aacute; basado en el otro, a pesar de sus coincidencias.</P>

<H3>Anti-D</H3>

<P>El anti-D infecta los archivos .COM, exepto el<BR>
command.com. Su funcionamiento es muy similar al Xuxa, en<BR>
cuanto a su contagio e infecci&oacute;n. La diferencia es que en<BR>
lugar de tomar la interrupci&oacute;n 1Ch toma la 09h. Con ella<BR>
cuenta la cantidad de veces que el usuario presiona la<BR>
tecla D en el teclado. Cuando esa cuenta llega a 33,<BR>
deshabilita dicha tecla.<BR>
Veamos como lo hace:</P>

<P><TT><FONT SIZE=-1>int_09:<BR>
int_09h_handler   proc    far</FONT></TT></P>

<P><TT><FONT SIZE=-1>  pushf<BR>
  push    ax<BR>
  push    cx<BR>
  push    dx<BR>
  push    ds<BR>
  push    es<BR>
  push    si<BR>
  push    di<BR>
  push    cs<BR>
  pop     ds           ; guarda el estado del procesador</FONT></TT></P>

<P><TT><FONT SIZE=-1>  in      al,60h       ; lee la tecla directamente
del port<BR>
  cmp     al,32        ; verifica si es la D<BR>
  jnz     no_d         ; si no es, sigue con la interrupcion<BR>
                       ; original</FONT></TT></P>

<P><TT><FONT SIZE=-1>  cmp     byte ptr activo, 33<BR>
  jne     es_d         ; si es la D controla la cantidad<BR>
                       ; de veces que fue pulsada<BR>
                       ; Si es menos de 33<BR>
                       ; sigue</FONT></TT></P>

<P><TT><FONT SIZE=-1>; Si se puls&oacute; 33 veces la tecla la borra del
teclado</FONT></TT></P>

<P><TT><FONT SIZE=-1>  in      al,61h<BR>
  or      al,80h<BR>
  out     61h,al       ; manda al 61 lo recibido OR 80h<BR>
                       ; simula liberacion de tecla</FONT></TT></P>

<P><TT><FONT SIZE=-1>  and     al,7Fh<BR>
  out     61h,al       ; manda al 61 lo recibido AND 7Fh</FONT></TT></P>

<P><TT><FONT SIZE=-1>  mov     al,20h<BR>
  out     20h,al       ; y manda al 20 un 20h</FONT></TT></P>

<P><TT><FONT SIZE=-1>  pop     di<BR>
  pop     si<BR>
  pop     es<BR>
  pop     ds<BR>
  pop     dx<BR>
  pop     cx<BR>
  pop     ax<BR>
  popf</FONT></TT></P>

<P><TT><FONT SIZE=-1>  iret          ; retorna de la interrupci&oacute;n
sin la tecla</FONT></TT></P>

<P><TT><FONT SIZE=-1>es_d:</FONT></TT></P>

<P><TT><FONT SIZE=-1>  inc     activo   ; incrementa el contador de<BR>
                   ; teclas D pulsadas</FONT></TT></P>

<P><TT><FONT SIZE=-1>no_d:</FONT></TT></P>

<P><TT><FONT SIZE=-1>   pop     di<BR>
   pop     si<BR>
   pop     es<BR>
   pop     ds<BR>
   pop     dx<BR>
   pop     cx<BR>
   pop     ax<BR>
   popf<BR>
   jmp     cs:adrkb     ; sigue con la interrupcion<BR>
                        ; del teclado del BIOS</FONT></TT></P>

<P><TT><FONT SIZE=-1>int_09h_handler   endp</FONT></TT></P>

<P>Como vemos, maneja la interrupci&oacute;n en forma normal, como<BR>
cualquier programa residente. La interrupci&oacute;n 09h es<BR>
generada cada vez que el usuario toca una tecla en el<BR>
teclado. El handler normal del BIOS lee dicha tecla y<BR>
pone el c&oacute;digo correspondiente en una zona de memoria<BR>
llamada buffer de teclado. El virus verifica si debe<BR>
anular la tecla, y si es as&iacute; lee el estado del teclado,<BR>
le indica que la tecla ya fue procesada, y vuelve de la<BR>
interrupci&oacute;n sin permitir que el BIOS procese la tecla.<BR>
Esta rutina no interfiere para nada con el resto del<BR>
teclado, s&oacute;lo con la tecla D. En la forma como est&aacute;<BR>
hecha, no tiene en cuenta si el shift est&aacute; o no<BR>
presionado, por lo tanto no importa si la D es may&uacute;scula<BR>
o min&uacute;scula. El efecto buscado por el programador del<BR>
virus fue el de simular un error f&iacute;sico en el teclado,<BR>
como si &eacute;ste estuviese roto y no fuera un problema de<BR>
software.<BR>
Existen otros virus que interfieren con el teclado, como<BR>
el Keyboard Bug, que agrega en forma intermitente<BR>
caracteres aleatorios al buffer de teclado. Tambien el<BR>
virus 10 Past 3 interfiere con el teclado, activando el<BR>
estado de las teclas control o shift, con lo cual lo que<BR>
el usuario tipea se ve modificado. Uno muy interesante es<BR>
el Fu Manchu, que se ativa cuando el usuario tipea<BR>
determinados nombres de pol&iacute;ticos. El virus agrega al<BR>
buffer del teclado frases insultantes contra estos<BR>
pol&iacute;ticos, con lo cual si estamos tipeando en un<BR>
procesador de texto esas frases terminan en el documento<BR>
a menos que las borremos.<BR>
</BODY>
</HTML>
