<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Analisis de virus: Michel&aacute;ngelo, Ping Pong y Piazzolla</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1>Analisis de virus</H1>

<P>por Fernando Bonsembiante</P>

<P>&nbsp;</P>

<H4>Michel&aacute;ngelo, uno de los virus m&aacute;s famosos de los &uacute;ltimos
tiempos.</H4>

<P>En 1992 los virus tuvieron una gran publicidad<BR>
gracias a que se activaba el Michelangelo el d&iacute;a 6 de<BR>
marzo. Probablemente la causa de tanto interes repentino<BR>
de la prensa fue que era muy destructivo y estaba<BR>
diseminado en gran cantidad de m&aacute;quinas. El d&iacute;a fat&iacute;dico<BR>
se reportaron muchos casos de informaci&oacute;n perdida, pero<BR>
mucha m&aacute;s gente ni siquiera prendi&oacute; su m&aacute;quina por
miedo<BR>
a lo que pudiera pasar. Las p&eacute;rdidas que origin&oacute; este<BR>
virus, por lo tanto, no solo deben contarse por la<BR>
informaci&oacute;n destruida, sino por el lucro cesante causado<BR>
por tantas m&aacute;quinas apagadas. Quien sabe que hubiera sido<BR>
peor, si nadie hubiese estado advertido del virus quiz&aacute;<BR>
hubiesen habido muchas m&aacute;s p&eacute;rdidas de informaci&oacute;n,
pero<BR>
de esta forma se perdi&oacute; un d&iacute;a de trabajo para mucha<BR>
gente. Seguramente si la gente supiera m&aacute;s sobre virus no<BR>
habr&iacute;a estos problemas. Se dijeron muchas cosas absurdas<BR>
de este virus, por ejemplo que se contagiaba por modem,<BR>
cosa rid&iacute;cula, ya que la &uacute;nica forma de contagiar un<BR>
virus es en el momento de ejecuci&oacute;n de un programa (o en<BR>
el booteo de un disco, que tambien es la ejecuci&oacute;n de un<BR>
programa). Para transmitir un virus por modem hay que<BR>
transmitir un programa infectado y el que lo recibe debe<BR>
ejecutarlo. En el caso de un virus de boot esto es mucho<BR>
m&aacute;s complicado ya que se deber&iacute;a enviar una imagen de<BR>
disco y reconstruirla del otro lado, y bootear con ese<BR>
disco.<BR>
Michel&aacute;ngelo es un virus de boot sector, que lleva<BR>
ese nombre porque se activa en la fecha de cumplea&ntilde;os del<BR>
genial artista italiano. Se cree que se origin&oacute; en Suecia<BR>
o en Holanda, o por lo menos fue aislado all&iacute;. Est&aacute;<BR>
basado en el virus Stoned, pero a diferencia de este<BR>
&uacute;ltimo, que es inofensivo, Michel&aacute;ngelo es altamente<BR>
destructivo cuando se activa. El virus queda residente en<BR>
memoria cuando se intenta bootear con un diskette<BR>
infectado, y aunque el disco no contenga el sistema<BR>
operativo puede copiarse a un disco r&iacute;gido. Se instala<BR>
residente dentro de los 640k de memoria del DOS, y ocupa<BR>
2k. El DOS va a reportar 2k menos de memoria disponible<BR>
si el virus est&aacute; activo. El virus se instala en el boot<BR>
de los diskettes, y copia el boot original en uno de los<BR>
sectores finales del directorio. En los discos r&iacute;gidos se<BR>
instala en la tabla de particiones y copia la tabla<BR>
original en una parte del disco que normalmente no se<BR>
usa. Cuando el virus est&aacute; activo en memoria infecta cada<BR>
disco al que se acceda para lectura o escritura. El d&iacute;a 6<BR>
de marzo (de cualquier a&ntilde;o) se activa su rutina de<BR>
destrucci&oacute;n. Esta rutina toma un &aacute;rea de memoria y copia<BR>
su contenido secuencialmente en el disco r&iacute;gido, con lo<BR>
cual se pierde toda la informaci&oacute;n, e incluso el DOS no<BR>
reconoce m&aacute;s el disco ya que sobreescribe la tabla de<BR>
particiones. La mejor forma de detectarlo es usando el<BR>
Scan, con la precauci&oacute;n de que sea la versi&oacute;n m&aacute;s nueva<BR>
que se pueda encontrar. Al momento de escribir esto, la<BR>
&uacute;ltima versi&oacute;n es la 100. Para limpiarlo podemos usar el<BR>
Clean o el Mdisk.</P>

<H4>Ping Pong, un virus tradicional</H4>

<P>El virus Ping Pong es el primero en hacer explosi&oacute;n<BR>
en Argentina. Fue descubierto en marzo de 1988, y en poco<BR>
tiempo estuvo en nuestro pa&iacute;s, donde se convirti&oacute;<BR>
r&aacute;pidamente en epidemia. La falta de conocimiento sobre<BR>
los virus lo ayud&oacute; a que se diseminara por todos lados, y<BR>
fuera incontrolable en un principio. En centros<BR>
universitarios como la Facultad de Ciencias Exactas de la<BR>
UBA o la Facultad de Inform&aacute;tica de la Universidad de<BR>
Mor&oacute;n era dif&iacute;cil encontrar un disco sin infectar. El<BR>
desconocimiento del tema llev&oacute; a que pasara bastante<BR>
tiempo hasta que se empezaran a tomar medidas. Solo<BR>
despues de algunos meses medios como Compu Magazine<BR>
empezaron a publicar formas de desinfectar los discos, y<BR>
se aplicaron pol&iacute;ticas de seguridad en las universidades.<BR>
Lo que siempre se ve como positivo de esto fue que la<BR>
gente empez&oacute; a conocer el DOS m&aacute;s profundamente, por<BR>
ejemplo, a conocer el boot sector, para que serv&iacute;a y que<BR>
era, ya que se usaban las m&aacute;quinas pero nadie sab&iacute;a como<BR>
funcionaban realmente. Demostr&oacute; que la ignorancia es el<BR>
peor enemigo. Por eso mismo, pensamos que la mejor forma<BR>
de combatirlos y evitar que se repita una epidemia de<BR>
esas proporciones es conocerlos lo m&aacute;s posible. Otro<BR>
efecto que caus&oacute; en la gente es la confusi&oacute;n entre el<BR>
s&iacute;ntoma y el virus en si. Como ten&iacute;a un s&iacute;ntoma muy<BR>
evidente, la famosa pelotita que rebota, pensaron que<BR>
todos los virus deb&iacute;an ser tan visibles. Los siguientes<BR>
fueron m&aacute;s ocultos, y se limitaban a reproducirse o<BR>
destruir sin avisar al usuario.<BR>
El Ping Pong original no pod&iacute;a infectar discos<BR>
r&iacute;gidos, pero la versi&oacute;n que se populariz&oacute; aqu&iacute;
fue la B,<BR>
que pod&iacute;a hacerlo. Se cre&oacute; una variante en Argentina,<BR>
probablemente fue la primera variante de virus originada<BR>
en el pa&iacute;s, el Ping Pong C, que no mostraba la pelotita<BR>
que rebota en la pantalla. Este virus est&aacute; extinto en<BR>
este momento ya que s&oacute;lo pod&iacute;a funcionar en m&aacute;quinas
con<BR>
procesador 8088 o 8086, porque ejecutaba una instrucci&oacute;n<BR>
que es indocumentada en estos e ilegal en los siguientes.</P>

<H4>Virus Piazzolla</H4>

<H4>Caracter&iacute;sticas</H4>

<P>Piazzolla es un virus que infecta todos los archivos<BR>
.COM, ejecutados despues de que est&eacute; activo en memoria,<BR>
excepto el command.com. Su s&iacute;ntoma m&aacute;s notable es que el<BR>
archivo infectado crece en 874 bytes, y que se instala<BR>
como un residente de 1,136 bytes. Tambien toma la<BR>
interrupci&oacute;n 21h. Una vez que est&aacute; residente, infecta<BR>
todos los archivos .com que se ejecuten. No cambia la<BR>
fecha y hora del archivo. En el programa infectado se<BR>
pueden ver los siguientes textos:</P>

<P>&quot;Piazzolla&quot;<BR>
&quot;COMMANDCOM&quot;<BR>
&quot;Piazzoll.$$$&quot;</P>

<P>No hace nada, excepto reproducirse.</P>

<H4>Funcionamiento</H4>

<P>En el programa infectado por Piazzolla, primero est&aacute;<BR>
el c&oacute;digo del virus, y a continuaci&oacute;n el programa<BR>
original. Cuando el DOS carga el programa en la memoria,<BR>
deja el virus primero y el programa original a<BR>
continuaci&oacute;n. Lo que empieza a ejecutarse es el c&oacute;digo<BR>
del virus, ya que la ejecuci&oacute;n de un .com empieza en el<BR>
principio del archivo, cargado por el DOS en la posici&oacute;n<BR>
de memoria CS:0100h<BR>
Es interesante que veamos como funciona en detalle,<BR>
ya que es un virus sencillo de archivos .COM, y no hace<BR>
uso de ningun truco extra&ntilde;o del sistema operativo,<BR>
funciona como si fuese un residente com&uacute;n y corriente.<BR>
Instala una rutina en la interrupci&oacute;n 21h (en la<BR>
funci&oacute;n DDh) que restaura el programa cargado a<BR>
continuaci&oacute;n del virus y le da control a este. Cuando se<BR>
carga un programa infectado, lo primero que hace es<BR>
llamar a esa funci&oacute;n, (poniendo en ah 0DDh y llamando a<BR>
la interrupci&oacute;n 21h). Si el virus ya est&aacute; activo en<BR>
memoria, esta rutina copia el programa original desde la<BR>
zona de memoria en que lo carg&oacute; el DOS, (a continuaci&oacute;n<BR>
del virus) a donde deber&iacute;a estar normalmente, en<BR>
CS:0100h. Obviamente, el CS es el CS del programa cargado<BR>
y no el de la rutina residente del virus, que es<BR>
distinto. Despues de restaurar el programa, salta a la<BR>
direcci&oacute;n de origen del mismo (CS:0100h) con lo que lo<BR>
ejecuta. De esta forma no se nota nada raro al ejecutar<BR>
un programa infectado.<BR>
En el caso de que el virus no est&eacute; ya presente en la<BR>
memoria, instala una rutina propia para la interrupci&oacute;n<BR>
21h, y reserva memoria para dejar su c&oacute;digo completo<BR>
residente. Es importante este detalle, ya que para<BR>
infectar un programa copia el c&oacute;digo del virus que est&aacute;<BR>
en memoria antes del programa original. Si no hiciera<BR>
esto deber&iacute;a sacar el c&oacute;digo del virus del disco, es<BR>
f&aacute;cil ver que esta estrategia es mejor. Por esta causa<BR>
los virus suelen ocupar m&aacute;s lugar en memoria que en<BR>
disco, o por lo menos el mismo lugar, ya que deben<BR>
guardar todo su c&oacute;digo en memoria y no solo la parte que<BR>
van a usar. Cuando instal&oacute; esa rutina, llama a la<BR>
interrupci&oacute;n 21h servicio 4B00h para ejecutar el programa<BR>
original desde disco. La forma en que lo hace es<BR>
interesante, ya que busca el nombre con el que fue<BR>
llamado el programa en el environment del mismo. En esa<BR>
&aacute;rea de memoria, apuntada por el byte que est&aacute; en el<BR>
offset 2Ch del Program Segment Prefix (PSP), est&aacute;n todas<BR>
las variables del environment del programa (path,<BR>
comspec, etc.) A continuaci&oacute;n de esas variables est&aacute; el<BR>
nombre completo con el que fue llamado el programa. Est&aacute;<BR>
despu&eacute;s del primer par de bytes con valor 0 (o sea, un<BR>
byte 0 del final de la cadena ASCIIZ (ASCII terminado en<BR>
cero) de la &uacute;ltima variable de environment, y un byte 0<BR>
que se&ntilde;ala el final del environment) El c&oacute;digo que hace<BR>
eso es as&iacute;:</P>

<P>mov cx,0FFFFh<BR>
xor ax,ax<BR>
xor di,di<BR>
mov es,ds:env_seg ; previamente se hizo env_seg equ<BR>
2Ch</P>

<P>busca:<BR>
repne scasb ; Repetir mientras zf=0 y cx&gt;0<BR>
; Scan es:[di] hasta que sea = ax<BR>
(0)<BR>
cmp byte ptr es:[di],0<BR>
je encontro ; si lo encontr&oacute;<BR>
scasb ; Scan es:[di] hasta que sea = ax<BR>
(0)<BR>
jnz busca ; repetir hasta que lo encuentre</P>

<P>encontro:<BR>
mov dx,di<BR>
add dx,3 ; dx = di + 3 (el primer word es el<BR>
nro<BR>
; de strings despues del<BR>
environment)<BR>
push es<BR>
pop ds ; ds = es<BR>
mov bx,13Ah<BR>
mov ax,4B00h<BR>
push cs ; llama a la int 21h<BR>
pop es ; 4B00h load and execute<BR>
pushf ; ejecuta el programa huesped desde<BR>
disco<BR>
; En int21h est&aacute; la<BR>
direcci&oacute;n de<BR>
call dword ptr cs:int21h ; la interrupci&oacute;n 21h<BR>
original</P>

<P>mov ah,4Dh ; obtiene el codigo de retorno del<BR>
programa<BR>
int 21h ; para devolverlo despues de terminar</P>

<P>mov dx,cs:tamres ; en tamres tiene el tama&ntilde;o del<BR>
c&oacute;digo<BR>
mov ah,31h<BR>
int 21h ; termina y queda residente</P>

<P>N&oacute;tese que no hace una llamada a la interrupci&oacute;n<BR>
21h, sino que usa la instrucci&oacute;n call, como si fuese una<BR>
subrutina m&aacute;s, pasando por encima de la interrupci&oacute;n<BR>
instalada por el programa. Esto es una t&eacute;cnica muy usada<BR>
por los virus cuando quieren ejecutar una interrupci&oacute;n<BR>
modificada por ellos mismos pero como si no estuviese<BR>
modificada.<BR>
La interrupci&oacute;n 21h instalada por el virus<BR>
b&aacute;sicamente tiene dos funciones. Cuando es llamada<BR>
verifica si ah es 0DDh o ax es 4B00h. Si es la primera,<BR>
realiza la rutina descrita anteriormente para restaurar<BR>
el programa original. Si es la segunda, (servicio de<BR>
cargar y ejecutar un programa) infecta al archivo. Veamos<BR>
como lo hace: Crea un stack temporario, porque va a usar<BR>
servicios de la interrupci&oacute;n 21h, y como es un programa<BR>
residente esto causa problemas en el stack. Luego<BR>
convierte el nombre del programa que se quiso ejecutar a<BR>
may&uacute;sculas (el nombre est&aacute; en DS:DX) y verifica si la<BR>
extensi&oacute;n es .COM. Como el programa puede ser un .EXE<BR>
renombrado a .COM, el virus verifica si tiene el<BR>
identificador interno de los .EXE, en los cuales los dos<BR>
primeros bytes del archivo son los caracteres ASCII 'MZ'.<BR>
Si el archivo es el command.com, tampoco lo infecta. Para<BR>
saber si est&aacute; previamente infectado verifica que el<BR>
cuarto y quinto byte sean 'ia'. A partir del tercer byte<BR>
de todos los programas infectados est&aacute; el string<BR>
'Piazzolla', aunque el virus utiliza solamente los bytes<BR>
'ia' como identificador, no el nombre completo. Si no es<BR>
un .COM real, es el command.com o ya est&aacute; infectado,<BR>
sigue con la interrupci&oacute;n normal, con un jmp dword ptr<BR>
cs:int21h, ya que no debe infectar esos archivos.</P>

<H4>Infecci&oacute;n</H4>

<P>La rutina de infecci&oacute;n crea un archivo temporario<BR>
llamado PIAZZOLL.$$$ donde el copia c&oacute;digo del virus<BR>
residente en la memoria, y a continuaci&oacute;n el programa a<BR>
infectar, ley&eacute;ndolo del disco. De esta forma genera lo<BR>
que luego ser&aacute; el programa infectado. Para hacerlo<BR>
eficientemente crea un buffer de 20k reservando memoria<BR>
con el servicio 48h de la interrupci&oacute;n 21h. Cuando ya<BR>
gener&oacute; el programa infectado, utiliza una estrategia algo<BR>
extra&ntilde;a, en vez de borrar el programa original y<BR>
renombrar el temporario, borra el original, copia<BR>
nuevamente el temporario con el nombre del original, y<BR>
borra el temporario. Esto parece una p&eacute;rdida de tiempo,<BR>
pero quiz&aacute; es un truco para enga&ntilde;ar a alg&uacute;n antivirus.<BR>
Cuando termina la infecci&oacute;n, cambia la hora y fecha del<BR>
archivo recien infectado para que sea igual al original.<BR>
Mientras est&aacute; haciendo la copia redirecciona<BR>
temporariamente la interrupci&oacute;n 24h (manejo de errores<BR>
cr&iacute;ticos del DOS) para que siempre devuelva 0, o sea,<BR>
para que el DOS no note posibles errores mientras se est&aacute;<BR>
infectando, como ser que no hay lugar en el disco, etc.<BR>
Si el virus detecta alg&uacute;n error en algun momento de la<BR>
infecci&oacute;n, o sea, si la interrupci&oacute;n 21h vuelve con el<BR>
flag de carry encendido, aborta toda la operaci&oacute;n.
</BODY>
</HTML>
