<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Caballeros de las redes de comunicaciones.</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Caballeros de las redes de comunicaciones.<BR>
Reportaje a un Hacker.</CENTER></H1>

<P>&nbsp;</P>

<P>F- &iquest;Cual era tu nombre de guerra?<BR>
E- <A HREF="chacal.jpg" tppabs="http://www.ubik.to/VR/01/chacal.jpg">Chacal.</A><BR>
F- Contanos que edad ten&eacute;s y a que te dedic&aacute;s ahora.<BR>
E- Obviamente esa informaci&oacute;n no se puede decir tan<BR>
abiertamente. La edad... pisando la treintena. Ocupaci&oacute;n<BR>
actual... tengo una empresa de consultor&iacute;a en el &aacute;rea de<BR>
inform&aacute;tica, vinculada con toda la parte de comunicaciones y<BR>
redes. Y cuando era m&aacute;s joven me dedicaba al hacking, creo<BR>
que ese es el motivo de esta entrevista.<BR>
F- &iquest;M&aacute;s o menos en qu&eacute; a&ntilde;o y qu&eacute; edad
ten&iacute;as?<BR>
E- El pico de la actividad fue aproximadamente en el a&ntilde;o 87.<BR>
En esa &eacute;poca andaba en los veinti algo... Era otra etapa de<BR>
la vida en la que ten&iacute;a m&aacute;s tiempo para dedicarle a este tipo<BR>
de cosas.<BR>
F- &iquest;Y por qu&eacute; lo dejaste?<BR>
E- Por un lado, porque es una actividad que lleva mucho<BR>
tiempo. Por otro lado, porque de alguna manera pude<BR>
reestructurar todos los conocimientos que adquir&iacute; en esa<BR>
etapa de hacking. Los he capitalizado para dedicarlos a la<BR>
actividad productiva y no al hacking, que es en s&iacute; un hobby,<BR>
una diversi&oacute;n.<BR>
F- &iquest;Para vos, qu&eacute; es ser hacker?<BR>
E- Se ha dicho mucho acerca de lo que es ser hacker. El<BR>
concepto popular del hacker es que es la persona que accede a<BR>
otras computadoras en formas no muy oficiales, rondando o no<BR>
la ilegalidad, depende como se lo considere. Es el personaje<BR>
popularizado por pel&iacute;culas como &quot;Juegos de Guerra&quot;, que<BR>
utilizando las computadoras y las redes telef&oacute;nicas entra en<BR>
el Pent&aacute;gono, en la NASA... En la realidad se puede acceder a<BR>
distintos tipos de lugares, obviamente todos quieren llegar<BR>
al Pent&aacute;gono o a la NASA pero tambi&eacute;n hay centros de<BR>
informaci&oacute;n, empresas, compa&ntilde;&iacute;as, museos, universidades...<BR>
F- &iquest;Qu&eacute; tipo de cosas hac&iacute;as en tu &eacute;poca dorada?<BR>
E- La actividad del hacker es investigar d&oacute;nde puede entrar,<BR>
c&oacute;mo entrar, c&oacute;mo violar la seguridad de los mecanismos de<BR>
acceso a las comunicaciones por sat&eacute;lite, a las<BR>
universidades, a las empresas o centros gubernamentales en el<BR>
exterior. Una vez que est&aacute; all&iacute; es m&aacute;s que nada una
actividad<BR>
voyeur&iacute;stica, un juego de ajedrez intelectual contra la<BR>
seguridad del sistema que se pretende violar. Es ingresar,<BR>
mirar y nada m&aacute;s. La intenci&oacute;n del hacker, por lo menos del<BR>
hacker bien entendido, no es destruir informaci&oacute;n, eso es un<BR>
poco infantil. Acceder a un sistema para destruir informaci&oacute;n<BR>
de pobres inocentes que no participan en el juego no tiene<BR>
ninguna gracia.<BR>
F- Ahora hay gente que quiere entrar a los BBS para borrar<BR>
sus discos...<BR>
E- Bueno, pero eso ser&iacute;a como ir a la puerta de un colegio y<BR>
robarles las figuritas a los nenes. No tiene ninguna gracia.<BR>
Hackear un BBS es una estupidez. Un BBS es un servicio que da<BR>
una persona para que otros puedan comunicarse. &iquest;Hackearlo y<BR>
destruirlo? No, eso es rid&iacute;culo. Cada uno busca el desaf&iacute;o
de<BR>
acuerdo a su capacidad, el que hackea un BBS sabe que esas<BR>
son sus limitaciones. El verdadero hacker, o por lo menos el<BR>
que tiene un poco m&aacute;s de capacidad intelectual, pretende<BR>
acceder a alguna universidad en el extranjero, o a un centro<BR>
europeo de investigaciones nucleares, o a una compa&ntilde;&iacute;a minera<BR>
en Sud&aacute;frica. Cada uno sabe cu&aacute;les son las metas que se<BR>
plantea. El objetivo nunca es destruir, porque el hacker<BR>
quiere pasar desapercibido. Es una satisfacci&oacute;n intelectual.<BR>
Yo s&eacute; que pude entrar a tal sistema, ya est&aacute;. A lo sumo se<BR>
comparte con un c&iacute;rculo de iniciados. Tiene esa<BR>
caracter&iacute;stica un poco m&iacute;stica.<BR>
F- Es muy lindo tu discurso de pacifismo, pero hay cuentas de<BR>
tel&eacute;fono enormes pagadas por algun otro, llamadas al<BR>
exterior, accesos ilegales y usos de bases de datos en el<BR>
extranjero... todo eso cuesta dinero y obviamente ustedes no<BR>
lo pagan.<BR>
E- Bueno, eso podr&iacute;amos considerarlo casi como una travesura.<BR>
El uso que puede hacer un hacker de un sistema en el<BR>
extranjero, desde un punto de vista legal, es una<BR>
contravenci&oacute;n. En realidad es un uso de tiempo de computadora<BR>
que no representa un costo importante para las empresas que<BR>
prestan el servicio, y que si est&aacute; hecho con moderaci&oacute;n no<BR>
pasa de ser una travesura. Es parte de los costos que puede<BR>
asumir cualquier empresa, insisto, hecho moderadamente y en<BR>
forma adecuada. Un pseudo-hacker que descubre c&oacute;mo acceder a<BR>
un sistema e inmediatamente abre cincuenta cuentas para todos<BR>
sus amigos, obviamente est&aacute; creando un problema grave. Pero<BR>
el que entra a un sistema y lo utiliza para conseguir<BR>
informaci&oacute;n t&eacute;cnica, o para comunicarse con gente con la cual<BR>
intercambiar informaci&oacute;n no est&aacute; creando un perjuicio<BR>
significativo. Un supermercado asume que va a tener un costo<BR>
porque pas&oacute; una se&ntilde;ora con un chiquito y rompi&oacute; una
botella,<BR>
son costos que se asumen. Ya est&aacute; calculado y no representa<BR>
un problema importante. En los casos de empresas a las que yo<BR>
asesoro y pueden llegar a brindar este tipo de servicios, se<BR>
calcula el costo de infiltraciones o de un abuso del sistema.<BR>
F- Pienso que una persona no dice &quot;voy a ser hacker&quot; y al<BR>
otro d&iacute;a ya entra a bases de datos en el exterior. &iquest;C&oacute;mo<BR>
fueron tus inicios en el tema?<BR>
E- En los viejos tiempos las cosas eran mucho m&aacute;s complicadas<BR>
que hoy en d&iacute;a. En la &eacute;poca de la que estamos hablando hab&iacute;a<BR>
muy pocos modems y muy poca informaci&oacute;n. Era todo un trabajo<BR>
a pulm&oacute;n. Hab&iacute;a que empezar de cero, ir investigando y<BR>
descubriendo, comprar revistas extranjeras para enterarse<BR>
d&oacute;nde hab&iacute;a sistemas disponibles, leer much&iacute;simo, y
bueno,<BR>
as&iacute;, de a poquito, uno se iba enterando de ad&oacute;nde se pod&iacute;a<BR>
acceder. Ah&iacute; se buscaban las formas de llegar... muchas veces<BR>
se paga parte de la comunicaci&oacute;n y se accede por izquierda en<BR>
otras partes de la comunicaci&oacute;n. En fin, hoy en d&iacute;a est&aacute;<BR>
mucho m&aacute;s vulgarizado, y hay un mont&oacute;n de pseudo-hackers que<BR>
obtienen informaci&oacute;n de alg&uacute;n amigo que sabe un poquito m&aacute;s,<BR>
les pasan una serie de archivos completos, entran, no saben<BR>
c&oacute;mo, no saben qu&eacute; es lo que hacen, y eso no tiene gracia.<BR>
Los usuarios son muy poco conscientes de la posibilidad de<BR>
que otra persona les descubra sus claves. Investigando un<BR>
poco, probando, probando, con muchas horas, con mucho tiempo,<BR>
mucho trabajo, uno va llegando. Y a medida que uno acced&iacute;a al<BR>
extranjero, empezaba a entrar a c&iacute;rculos de hackers de todo<BR>
el mundo donde se intercamba de informaci&oacute;n. Uno descubri&oacute;<BR>
una computadora en Tanzania de una empresa que se est&aacute;<BR>
instalando y se la cambia a otro por un acceso a una compa&ntilde;&iacute;a<BR>
en Jap&oacute;n, y entonces ah&iacute; consigue informaci&oacute;n porque
esa<BR>
computadora de Jap&oacute;n se comunica con otra en Alemania,<BR>
entonces, sabiendo mucho de sistemas, se buscan archivos que<BR>
dan una pista de c&oacute;mo est&aacute; comunic&aacute;ndose esa computadora
y se<BR>
intentan utilizar los mismos mecanismos. Entonces se entra a<BR>
esa computadora de Alemania haci&eacute;ndose pasar por la<BR>
computadora de Jap&oacute;n y as&iacute; se va armando una cadena donde
se<BR>
van encontrando cosas a las que acceder.<BR>
F- &iquest;Pens&aacute;s que tu posici&oacute;n econ&oacute;mica actual,
bastante buena,<BR>
la deb&eacute;s a haber sido hacker en alg&uacute;n momento?<BR>
E- No directamente, s&iacute; indirectamente porque la actividad de<BR>
hacking me permiti&oacute; adquirir una serie de conocimientos...<BR>
F- No me refiero a que hayas robado a algun banco...<BR>
E- No, no, por supesto, eso no. He adquirido much&iacute;simos<BR>
conocimientos, que despu&eacute;s los he podido aplicar. Hoy en d&iacute;a<BR>
puedo desarrollar t&eacute;cnicas de seguridad basadas en mis<BR>
conocimientos de c&oacute;mo yo acced&iacute;a a otros sistemas. Ese<BR>
conociento interno de la cosa me permite desarrollar sistemas<BR>
que son entre comillas infalibles. Siempre entre comillas<BR>
porque no existe un sistema de seguridad perfecto. En cierto<BR>
modo es lo mismo que preguntar qui&eacute;n es el mejor especialista<BR>
en caja fuertes: es el ladr&oacute;n de caja fuertes. Ese es el que<BR>
m&aacute;s va a saber c&oacute;mo hacer una caja fuerte inviolable. Es algo<BR>
parecido. Esos conocimientos despu&eacute;s pueden ser aplicados<BR>
para hacer lo contrario. No deja de ser parte de este juego<BR>
de ajedrez, nada m&aacute;s que al principio se juega de un lado del<BR>
tablero y ahora del otro. Antes el juego era violar los<BR>
sistemas y ahora es crear sistemas seguros y brindar ese<BR>
servicio a las empresas.<BR>
F- &iquest;A qu&eacute; otros hackers conociste?<BR>
E- Bueno, aqu&iacute; en Argentina hab&iacute;a un grupo de hackers de<BR>
mediana importancia. Recuerdo al famoso Dr. Trucho, a<BR>
Nibbler, gente que hac&iacute;a lo suyo.<BR>
F- &iquest;Vos pertenec&iacute;as a ese grupo?<BR>
E- S&iacute;, digamos que intercambi&aacute;bamos informaci&oacute;n, o<BR>
encar&aacute;bamos proyectos juntos. Inclusive el famoso &quot;PUA&quot;,<BR>
Piratas Unidos Argentinos, que surgi&oacute; como una broma en su<BR>
momento y tomo cierta envergadura despu&eacute;s. Los hackers<BR>
argentinos que hab&iacute;a en ese momento eran hackers conscientes,<BR>
y esa consciencia surg&iacute;a por la necesidad de haber trabajado<BR>
mucho a pulm&oacute;n. No hab&iacute;an amigos o hadas madrinas que nos<BR>
regalasen grandes archivos con informaci&oacute;n. Y en el exterior,<BR>
por supuesto, conoc&iacute; much&iacute;simos hackers importantes,<BR>
alemanes, inclusive gente del Chaos, ingleses, italianos,<BR>
australianos, obviamente norteamericanos. En ese momento<BR>
exist&iacute;an distintos lugares en el mundo donde los hackers<BR>
intercambiaban informaci&oacute;n, puntos de reuni&oacute;n o grandes<BR>
bancos de datos solamente conocidos por los hackers de cierto<BR>
nivel hacia arriba y un poco m&iacute;tico para los que todav&iacute;a no<BR>
ten&iacute;an capacidad para acceder a ellos. Eran lugares secretos<BR>
que unos dec&iacute;an que exist&iacute;an, que ten&iacute;an un amigo que
alguna<BR>
vez los hab&iacute;a visto y otros dec&iacute;an que no, que en realidad
no<BR>
exist&iacute;an. Bueno, algunos eran fantas&iacute;a y otros reales.<BR>
F- &iquest;Esos lugares eran m&aacute;quinas, bases de datos?<BR>
E- S&iacute;, computadoras escondidas en las redes mundiales de<BR>
comunicaciones, con accesos que no estaban en las gu&iacute;as<BR>
telef&oacute;nicas de computadoras en el mundo.<BR>
E- Y ah&iacute; se intercambiaba informaci&oacute;n...<BR>
F- As&iacute; es, all&iacute; se pod&iacute;a encontrar desde los c&oacute;digos
para<BR>
mover los sat&eacute;lites de EEUU dejados por la gente del Chaos<BR>
Computer Club hasta como infiltrarse en las comunicaciones<BR>
telef&oacute;nicas de Australia, o los c&oacute;digos de acceso a una<BR>
compa&ntilde;&iacute;a minera sudafricana. Tambi&eacute;n hab&iacute;a informacion<BR>
t&eacute;cnica vinculada con las comunicaciones, con los modems, que<BR>
pod&iacute;an ser utilizadas no s&oacute;lo para hacking, sino para<BR>
actividades legales.<BR>
F- &iquest;Pod&eacute;s decirme algunos nombres de esos lugares en donde
se<BR>
encontraban?<BR>
E- Bueno uno famoso y m&iacute;tico era Altos, un lugar en Alemania<BR>
que nadie conoc&iacute;a y todos mencionaban un poco m&iacute;ticamente.<BR>
Otro lugar importante era AMP, Adventure Multi Player, un<BR>
juego de aventuras multiusuario en Inglaterra que adem&aacute;s de<BR>
ser un juego de aventuras era un lugar de intercambio de<BR>
informaci&oacute;n.<BR>
F- Yo escuch&eacute; hablar de un lugar que se llamaba QSD...<BR>
E- Nunca me gust&oacute; QSD. Surg&iacute;o cuando yo ya me retiraba de
la<BR>
actividad, pero nunca me gust&oacute; por la forma del chat en s&iacute;,<BR>
la interfase de usuario del chat, y adem&aacute;s la gente que se<BR>
reun&iacute;a en QSD... hab&iacute;a de todo un poco, pero no se encontraba<BR>
el alto nivel t&eacute;cnico de la gente de otros lugares.<BR>
F- &iquest;Es cierto ese rumor que dice que algunos miembros del<BR>
Chaos Computer Club de Hamburgo estuvieron en Argentina?<BR>
E- Si, hace casi dos a&ntilde;os, un par de ellos estuvieron<BR>
visitando latinoamerica y se quedaron varios dias en<BR>
Argentina. Pararon en el departamento de un familar mio, que<BR>
en ese momento estaba de vacaciones, y como hablaban solo<BR>
alem&aacute;n e ingl&eacute;s, varias veces tuve que hacerles de<BR>
interprete. No sabes lo que era explicarles qu&eacute; es chorizo y<BR>
una morcilla.<BR>
F- &iquest;Intentaron hackear algo ac&aacute;?<BR>
E- &iexcl;Ja! Se sorprendieron del estado de los telefonos. Al<BR>
principio no podian creer que cuando levantaban el tubo<BR>
tardaba un par de segundos en venir tono. Despues de 10 dias,<BR>
cuando asimilaron que en la Argentina un telefono es un<BR>
aparato casi inutil, se fueron a Peru. Lo que si hicieron en<BR>
alg&uacute;n pais de Am&eacute;rica, no voy a decir cual, fueron algunas<BR>
truchadas con tarjetas de credito. Nada de mucho valor,<BR>
simples travesuras.<BR>
F- &iquest;Alguna an&eacute;cdota interesante?<BR>
E- Uno de ellos, el mas serio, se enamor&oacute; de una brasilera<BR>
amiga mia. Por supuesto que, mientras la tenia delante, lo<BR>
unico que le decia era &quot;buenos dias&quot; y &quot;adios&quot;. Pero
cuando<BR>
volvi&oacute; a Alemania, empezo a llamarme por telefono todos los<BR>
dias para que le diera la direccion y el tel&eacute;fono de la mina.<BR>
Para peor, ella volvio a Brasil y perd&iacute; contacto, asi que no<BR>
podia hacer nada. El a&ntilde;o pasado, el flaco viaj&oacute; a Brasil,
y<BR>
antes de ir me dejaba mensajes en el contestador cada media<BR>
hora pidiendome por favor que le averiguara la direccion, o<BR>
al menos en que barrio de Rio estaba, asi trataba de<BR>
encontr&aacute;rsela por la calle.<BR>
F- &iquest;Que pod&eacute;s decirnos sobre ellos como personas?<BR>
E- Son muy distintos. Uno de ellos es el t&iacute;pico alem&aacute;n<BR>
ordenado, organizado y serio, siempre con la ropa planchada y<BR>
limpia. El otro es un borracho, desordenado, amante del heavy<BR>
metal. Era comun que llegara a buscarlos al mediodia, y<BR>
mientras uno vomitaba la curda de la noche anterior, el otro<BR>
le leia de una libretita las actividades planificadas para el<BR>
dia. Un show. Por supuesto, ambos son brillantes, tienen un<BR>
cerebro que es una aplanadora, y saben much&iacute;simo de<BR>
telefon&iacute;a, comunicaciones y computaci&oacute;n. Por la an&eacute;cdota
de<BR>
la brasilera y otras cosas mas que pasaron, no los veo muy<BR>
diestros en su trato con las mujeres, pero puede tener que<BR>
ver con que crecieron en una cultura donde no son muy<BR>
demostrativos en lo emotivo.<BR>
F- &iquest;Ten&eacute;s alguna an&eacute;cdota que puedas contar de tus
d&iacute;as de<BR>
hacker, algo divertido?<BR>
E- Bueno, s&iacute;, hab&iacute;a cosas divertidas... por ejemplo para<BR>
evitar el rastreo era com&uacute;n entrar con algo que era llamado<BR>
PAD, computadoras que permiten entrar a ellas y generar una<BR>
nueva comunicaci&oacute;n hacia otro lugar. Los hackers m&aacute;s<BR>
paranoicos usaban 4 o 5 de estos PADs para puentear sus<BR>
comunicaciones. Como an&eacute;cdotas locales, hab&iacute;a en ese momento<BR>
un servicio de informaciones aqu&iacute; en Argentina, con el cual<BR>
ten&iacute;amos un poco infantilmente una especie de peque&ntilde;a pelea.<BR>
Nosotros acced&iacute;amos a su sistema y le ped&iacute;amos que<BR>
reconocieran nuestra existencia abri&eacute;ndonos una cuenta a<BR>
nombre de &quot;Grupo Piratas Unidos Argentinos&quot;. Hay an&eacute;cdotas<BR>
con los chicos del &quot;Chaos Computer Club&quot; de Hamburgo, que se<BR>
metieron en las computadoras de EEUU y, cuando se dieron<BR>
cuenta de que ya los hab&iacute;an rastreado, decidieron hablar con<BR>
la prensa de su pa&iacute;s para sacar una especie de seguro de vida<BR>
ante el riesgo que los hicieran desaparecer o terminaran con<BR>
&quot;extremo perjuicio&quot; como es el eufemismo de la CIA para este<BR>
tipo de casos. Despu&eacute;s algunos de ellos tuvieron accidentes<BR>
un poco inexplicables... Muchas an&eacute;cdotas no se pueden<BR>
comentar porque involucran conocimientos que no son para<BR>
difundir al dominio p&uacute;blico.<BR>
F- &iquest;Alguna vez tuviste alg&uacute;n problema de ese nivel, o<BR>
amenazas?<BR>
E- No, a nivel de amenazas no, pero hubieron situaciones<BR>
graciosas. A veces la inocente actividad de un hacker puede<BR>
destapar negociaciones complicadas entre empresas, o puede<BR>
provocar otro tipo de inconvenientes, donde muchas veces el<BR>
mismo hacker no sabe que es lo que pasa. Problemas<BR>
interempresarios vinculados con costos de comunicaciones o<BR>
cosas as&iacute;. Eso es sano en cierto modo. Llev&aacute;ndolo a un plano<BR>
idealista, el hacker bien entendido es una especie de Robin<BR>
Hood de la informaci&oacute;n, que permite que todo el mundo acceda<BR>
a informaci&oacute;n que de otra manera se mantiene oculta.<BR>
F- En este momento existe una revalorizaci&oacute;n del hacker, en<BR>
obras de ciencia ficci&oacute;n, como por ejemplo Neuromancer de<BR>
William Gibson, no s&eacute; si le&iacute;ste algo de eso.<BR>
E- S&iacute; seguro. Todo lo que es la corriente &quot;CyberPunk&quot; en
la<BR>
ciencia ficci&oacute;n, obras como &quot;Neuromancer&quot;, &quot;Conde
Cero&quot; o<BR>
&quot;Mona Lisa Overdrive&quot;, presentan un modelo de futuro que es<BR>
probable que est&eacute; bastante cercano a lo que va a ocurrir. Ah&iacute;<BR>
lo que se presenta es lo que est&aacute;bamos diciendo. Hackers que<BR>
act&uacute;an con reglas t&aacute;citas de juego. Eso probablemente va a<BR>
ocurrir. Gente como Gibson o Sterling ha logrado pintar un<BR>
futuro bastante realista y bastante macabro, porque el futuro<BR>
tiene su faceta macabra. Pintan un mundo superpoblado, con<BR>
una gran difusi&oacute;n de drogas alucin&oacute;genas, con redes de<BR>
computadoras que permiten la comunicaci&oacute;n a trav&eacute;s de todo
el<BR>
planeta, con el poder econ&oacute;mico y pol&iacute;tico en manos de<BR>
grandes corporaciones. Es l&oacute;gico que va a haber cosas que nos<BR>
gusten y otras que no nos gusten. Han logrado pintar muy bien<BR>
el hecho de que quienes sepan desenvolverse en un mundo<BR>
inform&aacute;tico van a controlar a las computadoras y quienes no<BR>
sepan hacerlo van a estar controlados por ellas.<BR>
F- &iquest;Pens&aacute;s que el background t&eacute;cnico de gente como
Gibson o<BR>
Sterling es correcto?<BR>
E- No me cabe ninguna duda de que Gibson y otra gente del<BR>
movimiento han sido hackers en su momento. El conocimiento<BR>
interno que tienen, no solo de la informaci&oacute;n t&eacute;cnica, sino<BR>
de cierta m&iacute;stica, es obviamente conocimiento adquirido<BR>
internamente. Con respecto a las extrapolaciones que hacen,<BR>
evidentemente algunas son correctas y otras son licencias<BR>
literarias, pero creo que son bastante acertadas. En t&eacute;rminos<BR>
generales describen un futuro que est&aacute; bastante enraizado en<BR>
la realidad actual. Lograron combinar muy acertadamente un<BR>
mundo bastante macabro con una cierta dosis de romanticismo.<BR>
En cierto modo plantean la alternativa ante un mundo que<BR>
degenera y empeora: el mundo paralelo que se crea en la<BR>
inform&aacute;tica, visto como un escapismo o visto como una<BR>
posibilidad de contruir un mundo distinto y mejor.<BR>
F- Algo muy rom&aacute;ntico.<BR>
E- Es muy rom&aacute;ntico. Tiene que existir esa contrapartida, que<BR>
es parte del equilibrio que tiene que tener cualquier ser<BR>
humano para no volverse loco. Tengamos en cuenta que el<BR>
verdadero hacker ha llegado a tener cierto poder en sus<BR>
manos. Los chicos del Chaos Computer Club de Hamburgo han<BR>
llegado acceder a informaci&oacute;n muy confidencial del<BR>
departamento de defensa norteamericano, sin embargo esa<BR>
faceta rom&aacute;ntica permiti&oacute; que actuaran de buena fe y se<BR>
comportaran como caballeros.<BR>
F- En vez de romper cosas...<BR>
E- Por supuesto, romper cosas es muy f&aacute;cil. Una vez que uno<BR>
tiene poder es mucho mejor abstenerse de usarlo que usarlo<BR>
mal.<BR>
F- &iquest;C&oacute;mo ser&iacute;a la personalidad del hacker? Porque uno
se<BR>
imagina que el hacker est&aacute; enchufado casi f&iacute;sicamente a la<BR>
m&aacute;quina.<BR>
E- En muchos casos es as&iacute;. Normalmente hay etapas en la vida<BR>
de toda la gente donde tiene m&aacute;s o menos dedicaci&oacute;n a una<BR>
actividad. Hay muchos hackers que se aislan de la realidad,<BR>
lo cual puede ser v&aacute;lido o no. Se puede establecer un perfil,<BR>
en general es una persona con profundos conocimientos<BR>
t&eacute;cnicos, es un poco un nuevo marginado, un nuevo bohemio, un<BR>
nuevo artista. Por su propia mentalidad va a estar m&aacute;s<BR>
inclinado a hackear un sistema con la computadora que a ir<BR>
con sus compa&ntilde;eros de facultad o del secundario a un partido<BR>
de f&uacute;tbol. Eso puede hacer que se a&iacute;sle y que no interact&uacute;e<BR>
muy bien socialmente. Es probable que tenga ciertas<BR>
inclinaciones locas, como que prefiera ir a un recital de<BR>
heavy metal o practicar un deporte peligroso como<BR>
paracaidismo o aladeltismo. Hoy en d&iacute;a el hacker ya se fue<BR>
incorporando al tejido de la sociedad, podemos encontrar<BR>
hackers de todo tipo. Es dif&iacute;cil definir un perfil &uacute;nico de<BR>
hacker. Podemos encontrar hackers de derecha, de izquierda,<BR>
sin ideolog&iacute;a pol&iacute;tica, homosexuales, lo que quieran...<BR>
F- &iquest;Y cuales son las edades de los hackers?<BR>
E- En general el hacker se inicia durante la adolescencia<BR>
porque en ese momento tiene la capacidad intelectual para<BR>
dedicarse al tema y dispone del tiempo. Cuando ya es m&aacute;s<BR>
grande es dif&iacute;cil que pueda empezar porque tiene otras<BR>
responsabilidades y ocupaciones que le quitan tiempo. El que<BR>
se ha iniciado en esa etapa que dispon&iacute;a de tiempo y ten&iacute;a<BR>
pilas como para entusiasmarse con eso, es probable que m&aacute;s<BR>
adelante de siga vinculado con esa actividad, o como hacker o<BR>
como en mi caso, brindando servicios relacionados con la<BR>
seguridad inform&aacute;tica.<BR>
F- Mucha gente asocia la palabra hacker con virus. &iquest;Hiciste<BR>
alg&uacute;n virus?<BR>
E- Creo que la idea de los virus surgi&oacute; simultaneamente en<BR>
muchos lugares del mundo, es una idea que estaba madura para<BR>
que surgiera. En su momento tuve la idea de algo que yo<BR>
llamaba programa v&iacute;rico, m&aacute;s o menos en la misma &eacute;poca
que<BR>
surgi&oacute; en otros lugares. Hice mis investigaciones, pero<BR>
quiz&aacute;s ingenuamente nunca se me ocurri&oacute; la idea de hacer un<BR>
virus que destruyera informaci&oacute;n. La idea era crear un<BR>
programa v&iacute;rico que mostrara mensajes, que dijera algo.<BR>
F- &iquest;Algo as&iacute; como el &quot;ping pong&quot;?<BR>
E- S&iacute;, pero hoy en d&iacute;a esa travesura se transform&oacute;
en un<BR>
problema. En ese momento no ten&iacute;amos consciencia de que un<BR>
virus supuestamente inofensivo puede crear incompatibilidades<BR>
o no entenderse con otros programas importantes como un cach&eacute;<BR>
o un controlador de memoria, y crear desastres<BR>
accidentalmente. Esto degener&oacute; en los virus que<BR>
intencionalmente destruyen informaci&oacute;n y crean problemas.<BR>
Creo que es consecuencia de la mentalidad un poco<BR>
megalom&aacute;n&iacute;ica del adolescente frustrado, que es el perfil<BR>
t&iacute;pico del creador de virus. Es el adolescente fustrado que<BR>
de esa manera llena su ego sinti&eacute;ndose una persona<BR>
importante, porque crea un virus que despu&eacute;s destruye<BR>
millones de datos. Tiene que ver con que mucha gente que se<BR>
inicia en computaci&oacute;n lo toma como una diversi&oacute;n y no tiene<BR>
una consciencia real de lo que significa la inform&aacute;tica en el<BR>
mundo moderno. Cuando esos mismos adolescentes crezcan un<BR>
poco m&aacute;s, y comiencen a trabajar se van a dar cuenta de las<BR>
consecuencias de la p&eacute;rdida de informaci&oacute;n en una empresa.<BR>
Ah&iacute; van a cambiar su mentalidad. Es lo que ha sucedido con<BR>
los hackers en su momento.<BR>
F- Podr&iacute;amos hacer un paralelismo entre lo que dec&iacute;as de lo<BR>
que uno aprende siendo hacker. Lo que se aprende haciendo<BR>
virus se puede utilizar para el bien..<BR>
E- Por supuesto, las mismas t&eacute;cnicas de programaci&oacute;n que se<BR>
usan para desarrollar un virus pueden servir para muchas<BR>
cosas, inclusive para la seguridad de los programas. Para<BR>
desarrollar un anti-virus es necesario conocer como funciona<BR>
un virus. Las mismas t&eacute;cnicas que se utilizan los virus,<BR>
muchas veces son, por necesidad de espacio, t&eacute;cnicas super<BR>
&oacute;ptimas para alguna funci&oacute;n. Con el tema del virus existe
un<BR>
riesgo, y es que se puede escapar de las manos del<BR>
programador. El hacker, al acceder a un sistema sabe qu&eacute; est&aacute;<BR>
haciendo, d&oacute;nde se est&aacute; metiendo, y es dif&iacute;cil que<BR>
accidentalmente destruya informaci&oacute;n, si sabe lo que hace. El<BR>
peligro potencial del virus es que se escape y que pueda<BR>
destruir informaci&oacute;n, aunque uno en un pricipio no pensara<BR>
que pod&iacute;a provocar da&ntilde;os. Lo que se puede recomendar a quien<BR>
quiera investigar sobre virus es que establezca medidas de<BR>
seguridad para que no se les escapen de las manos. En segundo<BR>
lugar, no se debe desarrollar un virus con la intenci&oacute;n de<BR>
destruir informaci&oacute;n, porque eso no pasa de ser una actitud<BR>
da&ntilde;ina, in&uacute;til. Ese es el l&iacute;mite, el l&iacute;mite
entre la<BR>
travesura y la actividad criminal.<BR>
F- Ahora ten&eacute;s una posici&oacute;n muy legalista y seria. Hace unos<BR>
a&ntilde;os, cuando eras hacker, &iquest;pensabas de la misma forma o eras<BR>
un poco m&aacute;s anarquista?<BR>
E- Probablemente era un poco m&aacute;s anarquista. Igualmente,<BR>
todav&iacute;a hoy estoy a favor del libre flujo de la informaci&oacute;n.<BR>
Creo que es importante que la gente pueda acceder a la<BR>
informaci&oacute;n, que las computadoras y las comunicaciones entre<BR>
computadoras permitan, como lo dec&iacute;a Mac Luhan, la &quot;global<BR>
village&quot;, la aldea global. Insisto en lo de siempre, a&uacute;n<BR>
cuando me dedicaba a la actividad del hacking, lo hac&iacute;a con<BR>
criterio, con un cierto sentido del deber. Era un poco<BR>
rom&aacute;ntico lo que hac&iacute;amos en esa &eacute;poca, era un desaf&iacute;o
con<BR>
ciertas reglas de caballerosidad. Eramos caballeros de las<BR>
redes de comunicaciones. Es lo mismo que sucede en cualquier<BR>
actividad: cuando eso se masifica, empieza a haber todo tipo<BR>
de personas, buenos y malos, y se pierde muchas veces el<BR>
sentido original. La persona que hace un mes no sab&iacute;a nada de<BR>
computadoras y sin que le costara conseguirla accedi&oacute; a<BR>
informaci&oacute;n t&eacute;cnica y de repente puede meterse en una red
en<BR>
cualquier lugar del mundo, no tiene una consciencia bien<BR>
formada. Lo que le puedo recomendar a cualquiera que le<BR>
interese este tipo de actividades traviesas, es que lo<BR>
disfrute, que investigue y que vaya haciendo las cosas por su<BR>
cuenta, sanamente y con buena fe, que es realmente lo m&aacute;s<BR>
divertido. Es como jugar al ajedrez haciendo trampa o<BR>
peg&aacute;ndole con las piezas en la cabeza al contrincante, no<BR>
tiene ninguna gracia. La gracia est&aacute; en ganar respetando las<BR>
reglas del juego. Esto es lo mismo, las reglas del juego son:<BR>
romperse la cabeza para conseguir la informaci&oacute;n, lograr<BR>
acceder y actuar caballerosamente, igual que un buen jugador<BR>
de ajedrez.
</BODY>
</HTML>
