<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Delito Inform&aacute;tico</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Delito Informatico</CENTER></H2>

<H2><CENTER>La seguridad no pasa solamente por el Backup</CENTER></H2>

<H2><CENTER>&nbsp;</CENTER></H2>

<P>     La consecuencia l&oacute;gica de un conflicto gremial es<BR>
por lo general una conciliaci&oacute;n obligatoria, despidos o<BR>
juicios. Es muy dif&iacute;cil que &eacute;ste termine en el<BR>
descubrimiento de una estafa, que ven&iacute;a realiz&aacute;ndose<BR>
desde dos a&ntilde;os atr&aacute;s. Esta es la historia real de la que<BR>
hoy nos ocuparemos.<BR>
     Seg&uacute;n dicen las estad&iacute;sticas, la persona que<BR>
delinque por medio de una computadora es por lo general<BR>
el operador que tom&oacute; conciencia de la falta de seguridad<BR>
el sistema. El caso de Mar&iacute;a del Carmen no fue la<BR>
exepci&oacute;n a la regla. Ella se desempe&ntilde;aba como empleada de<BR>
personal de una compa&ntilde;&iacute;a mixta formada por capitales<BR>
estatales y alemanes. De esta &uacute;ltima nacionalidad era el<BR>
director de la empresa, quien ten&iacute;a como pol&iacute;tica una<BR>
f&eacute;rrea disciplina con sus empleados.<BR>
     El centro de c&oacute;mputos contaba con un gran equipo IBM<BR>
de la l&iacute;nea 4300, con varias terminales que brindaban<BR>
todo tipo de servicio, incluyendo el de sueldos, sector<BR>
del cual era responsable Mar&iacute;a del Carmen.<BR>
     La gerencia de sistemas, con el objetivo de<BR>
facilitar la liquidaci&oacute;n de sueldos, adquiri&oacute; un software<BR>
muy vers&aacute;til para el equipamiento central, que permit&iacute;a<BR>
al &aacute;rea de personal encargarse en forma aut&oacute;noma de las<BR>
liquidaciones y del mantenimiento. El mismo consist&iacute;a en<BR>
tablas que se cargaban o se modificaban seg&uacute;n las<BR>
necesidades del usuario, y el archivo maestro del<BR>
personal ten&iacute;a un campo llamado actividad, donde los<BR>
activos se cargaban con el n&uacute;mero nueve, los de baja con<BR>
el uno y las liquidaciones por &uacute;ltima vez con cero.<BR>
     Un d&iacute;a, Mar&iacute;a del Carmen, luego de la emisi&oacute;n
de los<BR>
cheques de haberes, se dio cuenta de que se efectu&oacute; una<BR>
liquidaci&oacute;n en una persona dada de baja, que ya no<BR>
trabajaba en la empresa desde hac&iacute;a tiempo. En el<BR>
registro del archivo maestro esa persona figuraba con 1,<BR>
esto quer&iacute;a decir que no se deber&iacute;a haber emitido el<BR>
cheque. No ten&iacute;a manera de comprobar lo que sucedi&oacute; sin<BR>
llamar la atenci&oacute;n, y en el caso de que fuera un error lo<BR>
deb&iacute;a ocultar, dado que su trabajo corr&iacute;a riesgo por la<BR>
disciplina existente. La soluci&oacute;n fue mandar a cobrar el<BR>
cheque y luego averiguar qu&eacute; hab&iacute;a pasado. De esta forma,<BR>
fue cobrado por el cadete de la empresa sin ning&uacute;n<BR>
problema, ya que era el d&iacute;a de pago de una empresa<BR>
prestigiosa. Por esto, sumado a la gran cantidad de gente<BR>
que concirr&iacute;a al banco, el cajero no verificaba la<BR>
documentaci&oacute;n del cobrador.<BR>
     Pas&oacute; el tiempo, y nadie dijo nada, con lo que se dio<BR>
cuenta de que en los controles de tesorer&iacute;a s&oacute;lo se<BR>
auditaba la suma a pagar, sin controlar qu&eacute; empleados<BR>
fueron liquidados. El error de esa liquidaci&oacute;n hab&iacute;a sido<BR>
poner cero en el campo de actividad, de esa manera este<BR>
empleado fantasma tuvo una liquidaci&oacute;n por &uacute;ltima vez, y<BR>
pas&oacute; nuevamente como baja.<BR>
     A finales de la d&eacute;cada de los 80, los sueldos en las<BR>
empresas estatales y de capitales mixtos descendieron<BR>
r&aacute;pidamente, y a nuestra empleada le aumentaron sus<BR>
necesidades econ&oacute;micas. La tentaci&oacute;n fue tan grande como<BR>
las facilidades para cometer el delito. La &uacute;nica traba<BR>
era que no pod&iacute;a utilizar un cadete de la empresa, y<BR>
deb&iacute;a mandar personas distintas a cobrar. Esto no fue<BR>
dif&iacute;cil, ella era una mujer agraciada y consigui&oacute;<BR>
r&aacute;pidamente cuatro amigos, los que peri&oacute;dicamente<BR>
concurr&iacute;an sol&iacute;citos al banco a hacerle un favor a su<BR>
amiga. Como es obvio, no se conoc&iacute;an entre ellos.<BR>
     Todo sigui&oacute; sin problemas por el t&eacute;rmino de dos<BR>
a&ntilde;os, aproximadamente, hasta que estall&oacute; un conflito<BR>
gremial por el congelamiento de los salarios. Los<BR>
empleados del centro de c&oacute;mputos, para fundamentar sus<BR>
reclamos, decidieron listar los archivos de los sueldos<BR>
de los directivos y empleados de la empresa de acuerdo al<BR>
monto. Los primeros eran extranjeros y aparentemente sus<BR>
salarios no hab&iacute;an sido congelados. Fue as&iacute; como figur&oacute;<BR>
en primer lugar, cobrando m&aacute;s que los cargos gerenciales,<BR>
un empleado dado de baja desde un a&ntilde;o atr&aacute;s. Primero se<BR>
pens&oacute; en un error, y la gente de c&oacute;mputos se lanz&oacute;
a su<BR>
b&uacute;squeda. Se investig&oacute; la auditor&iacute;a del sistema, que<BR>
guardaba las liquidaciones mes a mes y daba estad&iacute;sticas.<BR>
Esta nunca hab&iacute;a sido inspeccionada, y all&iacute; se pudo ver<BR>
que esos &quot;errores&quot; fueron cometidos peri&oacute;dicamente, y que<BR>
algunos esos sueldos ten&iacute;an sumados conceptos especiales,<BR>
como horas extras o bonificaciones. Las liquidaciones<BR>
fantasmas disminu&iacute;an cuando se hac&iacute;a cargo un nuevo<BR>
director, hasta que se reestablec&iacute;a la confianza y la<BR>
impunidad segura.<BR>
     Los progresos econ&oacute;micos de la empleada, que en esos<BR>
momentos pas&oacute; de sus apremios a poseer un auto &uacute;ltimo<BR>
modelo y comprar una casa en un barrio residencial,<BR>
dieron pie a las sospechas y la empresa efectu&oacute; la<BR>
correspondiente denncia. Despues de una paciente<BR>
investigaci&oacute;n que dur&oacute; diez meses, los t&eacute;cnicos<BR>
policiales comprobaron la maniobra. Ella y sus c&oacute;mplices<BR>
fueron procesados por la justicia, si bien algunos s&oacute;lo<BR>
pensaban que le hac&iacute;an un favor al ir a cobrar.<BR>
     Esta historia es real, no fueron mencionados los<BR>
autores ni la empresa porque el tr&aacute;mite judicial a&uacute;n<BR>
sigue vigente.</P>

<P>     Se puede definir la seguridad como &quot;la certeza del<BR>
cumplimiento de un orden&quot;. Aqu&iacute; el sistema era seguro,<BR>
dado que el orden se cumpl&iacute;a, pero &iquest;el orden de quien?.<BR>
Por eso no solo es necesario tomar precauciones en lo que<BR>
hace al software o hardware, sino tambien en las<BR>
distintas &aacute;reas sistematizadas de la empresa. Una<BR>
soluci&oacute;n ser&iacute;a tener personal de auditor&iacute;a, con oficinas<BR>
descentralizadas y que ellos realicen inspecciones<BR>
peri&oacute;dicas.<BR>
     En los pr&oacute;ximos art&iacute;culos iremos viendo como la<BR>
computaci&oacute;n fue abarcando toda la actividad humana, hasta<BR>
la delictiva. Mostraremos distintos casos, tan variados<BR>
como el ingenio de cada persona.</P>

<P>     Licenciado Juan Santa Ana.<BR>
</BODY>
</HTML>
