<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Neuromante</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<P>Neuromante<BR>
Autor: William Gibson<BR>
Editorial: Minotauro<BR>
N&uacute;mero de p&aacute;ginas: 316<BR>
Impreso en Espa&ntilde;a<BR>
A&ntilde;o de edici&oacute;n: 1989<BR>
T&iacute;tulo original: Neuromancer<BR>
Primera edici&oacute;n original: 1984</P>

<P>&nbsp;</P>

<H2><CENTER>Deambulando por el Ciberespacio</CENTER></H2>

<P><CENTER>por Mart&iacute;n Sal&iacute;as</CENTER></P>

<P><CENTER>&nbsp;</CENTER></P>

<P>     Neuromante, la novela de ciencia ficci&oacute;n del<BR>
norteamericano William Gibson, es considerada la obra<BR>
principal de la corriente de escritores conocida como<BR>
cyber-punk, y esto se debe a que es la que mejor ha<BR>
logrado exponer, hasta el momento, algunos de los temas<BR>
fundamentales de este grupo.<BR>
     Los mirrorshades (lentes espejados), como gustan<BR>
autodenominarse estos modernos literatos, basan su<BR>
universo ficcional en la tecnolog&iacute;a de punta y los<BR>
conflictos sociales que la difusi&oacute;n masiva de &eacute;sta<BR>
acarrea.<BR>
     La corriente tiene su origen en la revista<BR>
subterr&aacute;nea CHEAP TRUTH (juego de palabras entre &quot;verdad<BR>
barata&quot; y &quot;la verdad del chip&quot;), en la que escrib&iacute;an<BR>
cuentos y art&iacute;culos sobre biotecnolog&iacute;a, inteligencia<BR>
artificial, y sobre todo, sobre una de sus m&aacute;s caras<BR>
obsesiones: las realidades virtuales.<BR>
     En Neuromante, Gibson narra una historia casi<BR>
policial, el la que el protagonista es Case (el nombre no<BR>
es casual), un vaquero del ciberespacio. Y aqu&iacute; est&aacute; un<BR>
de las ideas m&aacute;s logradas de Gibson y Cia; ellos suponen<BR>
que en alg&uacute;n momento del futuro, no muy lejano, las<BR>
comunicaciones envolver&aacute;n al mundo en un gigantesco de<BR>
redes, que inevitablemente tendr&aacute;n puntos de contacto<BR>
entre s&iacute;, creando una trama cerrada de informaci&oacute;n que<BR>
envolver&aacute; la esfera terrestre.<BR>
     Este fen&oacute;meno, sumado al perfeccionamiento de los<BR>
dispositivos de conexi&oacute;n neuronal, permitir&aacute;n a los<BR>
operadores sumergirse en la ciberesf&eacute;ra, deambulando por<BR>
ella como si fuera un extraordinario complejo de<BR>
laberintos, dado que computadoras especializadas<BR>
convertir&aacute;n los paquetes de datos y los c&uacute;mulos de<BR>
informaci&oacute;n en una realidad virtual, con imagen y color,<BR>
olor y textura, inducida directamente al los centros<BR>
sensitivos del cerebro.<BR>
     De esta forma Gibson describe un paisaje<BR>
alucinatorio (llamado tambi&eacute;n la matriz) en donde no es<BR>
f&aacute;cil moverse, pero que requiere la adopci&oacute;n de nuevos<BR>
m&eacute;todos de seguridad.<BR>
     As&iacute;, las estructuras de informaci&oacute;n confidencial de<BR>
las grandes corporaciones u organismos militares protegen<BR>
su informaci&oacute;n mediante el hielo (por ICE, Intrusion<BR>
Countermeasures Electronics, &oacute; Contramedidas electr&oacute;nicas<BR>
de intrusi&oacute;n), y por supuesto, hay especialistas en<BR>
burlarlas. Case es uno de ellos, un ladr&oacute;n de<BR>
informaci&oacute;n, un vaquero de consola. Ellos logran<BR>
filtrarse por la matriz mediante la utilizaci&oacute;n de virus<BR>
que enga&ntilde;an a los sistemas de defensa, abriendo el hueco<BR>
por el que filtrar los datos valiosos.</P>

<P>     La base t&eacute;cnica de Gibson es discutible, al menos en<BR>
los detalles formales, pero la tendencia de la idea y el<BR>
entorno general de la obra no son m&aacute;s que la<BR>
extrapolaci&oacute;n m&iacute;nima de elementos existentes hoy en d&iacute;a.<BR>
Las realidades virtuales ya son un hecho, y de all&iacute; a la<BR>
inmersi&oacute;n en una computadora no hay m&aacute;s que una cuesti&oacute;n<BR>
de representaci&oacute;n. As&iacute; como hoy un programa puede<BR>
mostrarnos un archivo como una carpeta o un icono<BR>
cualquiera en la pantalla, ma&ntilde;ana, lentes o electrodos<BR>
mediante, podremos verlo como, por ejemplo, un cubo rojo,<BR>
al que podemos tocar, mover, patear y hasta &iquest;por qu&eacute; no?<BR>
tambi&eacute;n estrujar. Y cada una de estas operaciones podr&aacute;<BR>
corresponder con una acci&oacute;n que el software interpretar&aacute;<BR>
y efectuar&aacute; de verdad sobre la memoria o el disco de la<BR>
m&aacute;quina.<BR>
     En la novela, por ejemplo, Case debe ingresar en un<BR>
&aacute;rea especialmente protegida (no especifica si es<BR>
memoria, disco, o qu&eacute;; &eacute;l s&oacute;lo habla de estructuras)
por<BR>
un hielo muy poderoso. Para ayudarse en la tarea de<BR>
penetraci&oacute;n dispara, como si fuese una bengala, un virus<BR>
militar chino, un virus lento, que act&uacute;a mutando y<BR>
mezcl&aacute;ndose con el c&oacute;digo del sistema de seguridad mismo,<BR>
hasta convencerlo de que todo est&aacute; bien, mientras va<BR>
abriendo la brecha.<BR>
     Como este hay montones de episodios en la novela que<BR>
resultan atrapantes para los aficionados a la inform&aacute;tica<BR>
y a la hi-tech, y aunque alg&uacute;n detalle sea poco<BR>
convincente, la descripci&oacute;n es tan v&iacute;vida y atrapante que<BR>
evita que el lector se detenga a examinarlo.<BR>
     Y la atm&oacute;sfera del relato es inquietante. Desde la<BR>
cantidad de aparatitos que se muestran cotidianamente, el<BR>
lenguaje de los personajes, plagado de jerga sin resultar<BR>
extravagante, el clima de decadencia y artificialidad de<BR>
toda la sociedad, y sobre todo, los personajes mismos.<BR>
     Est&aacute;, por ejemplo, Molly, la c&oacute;mplice-guardaespaldas<BR>
de Case, que tiene lentes espejados implantados<BR>
directamente sobre las &oacute;rbitas oculares, protegiendo un<BR>
sistema de visi&oacute;n cibern&eacute;ticamente mejorado, que le<BR>
permite ver en la oscuridad, y entre otras cosas, ver<BR>
cont&iacute;nuamente dentro de sus campo de visi&oacute;n un reloj<BR>
digital.<BR>
     Existe tambi&eacute;n el simestim, un aparato que ha<BR>
reemplazado en gran parte a la televisi&oacute;n, que permite a<BR>
los espectadores sentir lo que sienten los protagonistas<BR>
de las series, y participar pr&aacute;cticamente en vivo en las<BR>
pel&iacute;culas, que utilizan Case y Molly para que &eacute;l, sin<BR>
separarse de su consola de ciberespacio, con s&oacute;lo mover<BR>
un switch, pueda conectarse con ella y ver lo que ella<BR>
ve, tocar lo que ella toca.<BR>
     Pero tambi&eacute;n a trav&eacute;s de su consola Case se comunica<BR>
con su amigo y maestro, el Flatline, muerto de un ataque<BR>
al coraz&oacute;n, pero cuyo intelecto, copiado en una cartucho<BR>
ROM, es rescatado y reconectado por Case, para que lo<BR>
ayude en su compleja misi&oacute;n.<BR>
     Otros colaboradores eventuales son los adolescentes<BR>
de la organizaci&oacute;n neo-terroristas llamados Panteras<BR>
Modernos, que visten trajes de Policarbono que adoptan el<BR>
color del ambiente en forma camale&oacute;nica y se insertan<BR>
microsofts (no es publicidad, son microchips en forma de<BR>
conector), en unos z&oacute;calos implantados especialmente<BR>
detr&aacute;s de la oreja. As&iacute;, con diversos softwares<BR>
implantados, se convierten en especialistas eventuales en<BR>
alg&uacute;n tema o adquieren moment&aacute;neas capacidades extras.<BR>
     Y adem&aacute;s desfilan millonarios exc&eacute;ntricos,<BR>
inteligencias artificiales que luchan por expandirse,<BR>
polic&iacute;as especiales dedicados a evitar que las IA lo<BR>
logren, asesinos ninja clonados, traficantes de software<BR>
o enzimas prohibidos, pilotos espaciales rastafaris,<BR>
ilusionistas hologr&aacute;ficos, y un sinn&uacute;mero de<BR>
personalidades claramente delineadas, con rasgos<BR>
convincentes y particulares.</P>

<P>     En suma, Neuromante, escrita en 1984, es una novela<BR>
apasionante para quien se interesa en el futuro de la<BR>
tecnolog&iacute;a, ideal para acercarse a la visi&oacute;n y el<BR>
pensamiento del cyber-punk, una de las corrientes<BR>
literarias m&aacute;s extra&ntilde;as y cuestionadas del posmodernismo,<BR>
y ante todo, un libro apasionante sobre el conflicto del<BR>
esp&iacute;ritu humano en la era digital.<BR>
</BODY>
</HTML>
