<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Corewar</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<P>&nbsp;</P>

<H1><CENTER>CoreWar</CENTER></H1>

<P><CENTER><BR>
Nuestro programa lucha contra sus enemigos en una m&aacute;quina<BR>
virtual. Solo una programaci&oacute;n inteligente puede darle la<BR>
victoria. Y su victoria ser&aacute; tambien la nuestra, en el<BR>
torneo de CoreWar que est&aacute; organizando Virus Report.</CENTER></P>

<P>&nbsp;</P>

<P>En el a&ntilde;o 1984, A. K. Dewdney present&oacute; un juego en su<BR>
columna de Scientific American (Investigaci&oacute;n y Ciencia).<BR>
En este juego, llamado CoreWar, dos programas escritos en<BR>
un assembler imaginario y limitado luchaban entre si. El<BR>
juego tuvo tanto &eacute;xito que se cre&oacute; la ICWS (International<BR>
Core Wars Society), organizaci&oacute;n que realiza torneos<BR>
internacionales todos los a&ntilde;os. No solo eso, sino que la<BR>
sociedad se expandi&oacute; por el mundo e incluso se efectuaron<BR>
torneos en Buenos Aires, el primero de ellos en 1988 en<BR>
la Universidad de Buenos Aires.</P>

<P>El lenguaje</P>

<P>El assembler que se utiliza se llama Redcode, y consta de<BR>
s&oacute;lo diez instrucciones. En el recuadro 1 vemos la lista<BR>
de las instrucciones. En este assembler no existen los<BR>
registros ni el direccionamiento absoluto. Para ejecutar<BR>
los programas necesitamos un simulador de la m&aacute;quina<BR>
virtual que los contiene: el MARS. Estas son las siglas<BR>
de Memory Array Redcode Simulator, adem&aacute;s de significar<BR>
Marte en ingl&eacute;s, el dios de la guerra. La memoria de esta<BR>
m&aacute;quina es circular, o sea, si tiene 2000 posiciones de<BR>
memoria, numeradas de 0 a 1999 la posici&oacute;n 2000 equivale<BR>
nuevamente a la primera posicion o n&uacute;mero 0. De todas<BR>
formas, los n&uacute;meros veraderos no importan, ya que no<BR>
existe el direccionamiento absoluto, s&oacute;lo trabajamos con<BR>
posiciones relativas a la actual. Cada posici&oacute;n de<BR>
memoria, a diferencia de las m&aacute;quinas que conocemos,<BR>
contiene una instrucci&oacute;n completa con hasta dos<BR>
operandos. De esta forma, de una sola vez podemos copiar<BR>
una instrucci&oacute;n completa o un dato. Otra cosa extra&ntilde;a que<BR>
tiene este procesador, es la instrucci&oacute;n SPL. Con ella<BR>
podemos dividir el procesamiento de nuestro programa en<BR>
varias copias, haciendo un multitasking. Esto tiene sus<BR>
ventajas obvias, como tener m&aacute;s frentes de ataque, pero<BR>
tambien tiene desventajas. Para hacer multitasking de<BR>
esta forma el programa primero debe copiarse a otra<BR>
posici&oacute;n de memoria y luego pasarle el control del<BR>
procesador mediante la instrucci&oacute;n SPL. Cada contrincante<BR>
tiene uso del procesador por turnos, y si existe m&aacute;s de<BR>
una copia de uno de ellos le tocar&aacute; una vez a cada copia.<BR>
Esto es as&iacute;: supongamos que existen los programas A y B.<BR>
Si el A se divide en A1 y A2, la secuencia de ejecuci&oacute;n<BR>
ser&aacute;: A1, B, A2, B, A1, B, A2... etc. Vemos que para que<BR>
el multitasking sea eficaz debemos tener en cuenta este<BR>
esquema de funcionamiento para que no sea una molestia<BR>
in&uacute;til dividirse en varios programas.</P>

<P>Direccionamiento</P>

<P>Como podemos ver en el recuadro 2, hay cuatro modos de<BR>
direccionamiento. El primero es inmediato, y se refiere a<BR>
un n&uacute;mero y no a una direcci&oacute;n de memoria. El segundo es<BR>
directo, y es el modo usado por default. Este se refiere<BR>
a una posici&oacute;n de memoria. El tercero, el indirecto, toma<BR>
la posici&oacute;n de memoria como un puntero hacia otra<BR>
direcci&oacute;n. Y el cuarto, m&aacute;s complejo, es el de<BR>
autodecremento indirecto. Es similar al indirecto pero<BR>
antes de usar el puntero lo decrementa en uno. Vayamos a<BR>
algunos ejemplos:</P>

<P>Mov #0 $1</P>

<P>Pone un 0 en la posici&oacute;n de memoria que se encuentra a<BR>
una posici&oacute;n de distancia.</P>

<P>Mov #0 @1<BR>
Dat 5</P>

<P>Pone un 0 en la posici&oacute;n apuntada por el Dat, o sea,<BR>
cinco posiciones adelante del Mov.</P>

<P>Mov #0 &lt;1<BR>
Dat 5</P>

<P>Esto decrementa el Dat en uno, con lo cual pasa a valer<BR>
cuatro, y pone un cero en la cuarta celda a partir del<BR>
Mov.</P>

<P>Para simplificar la programaci&oacute;n podemos usar labels como<BR>
en assembler, por ejemplo</P>

<P>Bomba 0<BR>
Start Mov bomba 5</P>

<P>Esto mueve el contenido de la casilla llamada bomba cinco<BR>
posiciones adelante. Tambien tenemos un label especial<BR>
llamado START que indica d&oacute;nde empieza la ejecuci&oacute;n de<BR>
nuestro programa. Tambien, si utilizamos n&uacute;meros<BR>
negativos el direccionamiento, como es l&oacute;gico, apuntar&aacute; a<BR>
ese n&uacute;mero de casillas atr&aacute;s de nuestra instrucci&oacute;n.</P>

<P>La lucha</P>

<P>Los programas tienen todo permitido para destruir a su<BR>
adversario. Pueden tener t&aacute;cticas de defensa, de<BR>
ocultaci&oacute;n, o de ataque frontal. La lucha termina cuando<BR>
de uno de los dos programas no queda ninguna copia en<BR>
funcionamiento. Para que un programa deje de funcionar<BR>
debe intentar ejecutar una instrucci&oacute;n ilegal, o sea, una<BR>
que no est&eacute; definida, un c&oacute;digo de operaci&oacute;n que no
est&eacute;<BR>
de 1 a 10. Es obvio que una t&aacute;ctica posible es llenar la<BR>
memoria de ceros para que el otro programa se tropiece<BR>
con uno de ellos y muera. Pero hay que tener en cuenta<BR>
que si nuestro propio programa encuentra uno de esos<BR>
ceros tambien va a morir. Otra forma de terminar la<BR>
batalla es con empate, es posible que ninguno de los dos<BR>
programas destruya al otro en un tiempo razonable, por lo<BR>
tanto el MARS detiene su ejecuci&oacute;n.</P>

<P>El torneo</P>

<P>Llamamos a todos los programadores que deseen luchar que<BR>
empiezen a preparar sus programas. Dentro de unos meses<BR>
lanzaremos la convocatoria para nuestro torneo, que<BR>
tendr&aacute; como premio un modem de 2400. Para que empiecen a<BR>
practicar, pondremos a disposici&oacute;n de todos en nuestro<BR>
BBS, en el 954-1792, las 24 horas, el programa que se us&oacute;<BR>
para el &uacute;ltimo torneo de CoreWar en Buenos Aires, escrito<BR>
por Fabio Friedlaender.<BR>
En la pr&oacute;xima nota, para los que prefieren otros<BR>
lenguajes, hablaremos del torneo de C-Robots y P-Robots,<BR>
en C y en Pascal respectivamente. Y tambien presentaremos<BR>
ejemplos de programas escritos en Redcode.
</BODY>
</HTML>
