<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Una casualidad fatal</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Una casualidad fatal</CENTER></H2>

<P><CENTER><BR>
Por Lic. Juan Santa Ana</CENTER></P>

<P>Hace aproximadamente 8 a&ntilde;os, el diario Clar&iacute;n dio a<BR>
conocer la noticia de que algunos agencieros de loter&iacute;a<BR>
se quejaban porque dentro del paquete de billetes que<BR>
recib&iacute;an faltaban n&uacute;meros. En su lugar encontraban el<BR>
dinero correspondiente a su valor de venta. Si bien esto<BR>
pareci&oacute; una simple noticia, detr&aacute;s de ella se escond&iacute;a
la<BR>
trama de uno de los primeros delitos con computadoras del<BR>
pa&iacute;s.<BR>
Las averiguaciones de la loter&iacute;a comenzaron por el sector<BR>
de distribuici&oacute;n, donde detectaron un empleado que<BR>
realizaba una &quot;labor extra&quot;. La misma consist&iacute;a en cobrar<BR>
una comisi&oacute;n por los n&uacute;meros requeridos, los que sacaba<BR>
del env&iacute;o colocando el dinero en su lugar. De esa manera<BR>
evitaba que el comprador que quer&iacute;a un n&uacute;mero determinado<BR>
recorriera las distintas agencias para localizarlo. Este<BR>
empleado fue despedido y pareci&oacute; el fin de la historia,<BR>
pero la cosa reci&eacute;n comenzaba.<BR>
Si bien se comprob&oacute; que la persona despedida jam&aacute;s tuvo<BR>
otro objetivo que el de conseguir f&aacute;cilmente los n&uacute;meros<BR>
deseados, la loter&iacute;a decidi&oacute; verificar quienes fueron los<BR>
beneficiados con los premios.<BR>
En esa &eacute;poca, los billetes de las distintas loter&iacute;as<BR>
contaban con un premio extra en base a una &quot;raspadita&quot;.<BR>
Este sistema consist&iacute;a en raspar distintos casilleros del<BR>
billete y con tres o m&aacute;s coincidencias de n&uacute;meros o<BR>
s&iacute;mbolos que aparecieran se hac&iacute;an acreedores a un<BR>
premio, que en algunos casos era millonario.<BR>
En la auditor&iacute;a de los premios se lleg&oacute; a ver que las<BR>
raspaditas siempre eran ganadas por personas de igual<BR>
apellido o de una misma zona. Despu&eacute;s de varias<BR>
hip&oacute;tesis, la investigaci&oacute;n se centr&oacute; en la empresa
que<BR>
realizaba el proceso de impresi&oacute;n. Esta era una de las<BR>
m&aacute;s importantes del mercado y tambi&eacute;n se dedicaba a la<BR>
impresi&oacute;n de cheques, documentos, boletas de prode, etc.<BR>
Se hac&iacute;a dif&iacute;cil pensar que con las medidas de seguridad<BR>
que ten&iacute;a esa empresa se filtrara alguna informaci&oacute;n para<BR>
sacar los premios de las raspaditas. Adem&aacute;s, &iquest;c&oacute;mo
se<BR>
podr&iacute;a hacer esto, si en teor&iacute;a los premios tendr&iacute;an
que<BR>
ser por azar?<BR>
Se comenz&oacute; inspeccionando el sistema de computaci&oacute;n que<BR>
se utilizaba para hacer los billetes de loter&iacute;a. El mismo<BR>
ten&iacute;a un dise&ntilde;o de registro con los siguientes datos:<BR>
n&uacute;mero principal y los d&eacute;cimos correspondientes, es decir<BR>
si el n&uacute;mero era de mil, los billetes ser&iacute;an mil diez,<BR>
mil veinte, y as&iacute; hasta llegar al dos mil; otro dato era<BR>
el lugar de venta que se cambiaba peri&oacute;dicamente, para<BR>
que los agencias no vendieran siempre los mismos n&uacute;meros.<BR>
Un requerimiento del sistema era que cada diez billetes<BR>
hubiera uno premiado, esto se hac&iacute;a grabando en un campo<BR>
del registro una se&ntilde;al donde estaba el premio.<BR>
Toda la programaci&oacute;n era en COBOL y con archivos planos.<BR>
El proceso se realizaba en dos etapas. La primera sobre<BR>
un equipo IBM de la l&iacute;nea 4300 con D.O.S., que generaba<BR>
una cinta con informaci&oacute;n, que era remitida a la<BR>
rotogr&aacute;fica. La segunda etapa era la de impresi&oacute;n de los<BR>
billetes conjuntamente con la &quot;raspadita&quot; premiada en el<BR>
n&uacute;mero que informaba la cinta.<BR>
La seguridad de estos procesos estaba prevista por el<BR>
encargado de seguridad de la empresa. El disco que<BR>
conten&iacute;a la informaci&oacute;n era removible y se guardaba en<BR>
una caja fuerte, en el momento del proceso era trasladado<BR>
al Centro de C&oacute;mputos bajo estrictas medidas de<BR>
seguridad, con un custodio. Se colocaba en el gabinete, y<BR>
una vez finalizada la cinta, se remit&iacute;a, tambi&eacute;n bajo<BR>
custodia, a la rotogr&aacute;fica y el disco era retirado del<BR>
lugar en iguales condiciones.<BR>
&iquest;C&oacute;mo fue posible que se escapara la informaci&oacute;n de
los<BR>
billetes premiados si en todo momento el material estaba<BR>
bajo vigilancia y estas personas nada sab&iacute;an de<BR>
computaci&oacute;n como para rescatar la informaci&oacute;n?<BR>
Pero ah&iacute; estaba el error, en la ignorancia de los que<BR>
brindaban la seguridad, y por tal motivo no se dieron<BR>
cuenta de la maniobra.<BR>
Un encargado de operaciones consigui&oacute; en alg&uacute;n momento el<BR>
dise&ntilde;o del registro del archivo usado para el proceso de<BR>
impresi&oacute;n de billetes de loter&iacute;a. No le fue muy dif&iacute;cil<BR>
hacer un programa en COBOL que buscara secuencialmente<BR>
todos los billetes marcados como premiados, y que en base<BR>
a eso listara los n&uacute;meros y lugar de venta. En el Job de<BR>
corrida agreg&oacute; otra tarjeta con la orden de ejecutar este<BR>
&quot;programa buscador de premios&quot; total &quot;nadie entend&iacute;a<BR>
nada&quot; y pasaba inadvertido que el proceso durara un<BR>
tiempo m&aacute;s.<BR>
El operador, una vez con el listado en su poder, recorr&iacute;a<BR>
las distintas agencias comprando los billetes premiados,<BR>
que en algunos casos se los hac&iacute;a cobrar a parientes y<BR>
vecinos. Este hombre nada tuvo que ver con el primero,<BR>
que cobraba una comisi&oacute;n para evitar recorrer las<BR>
agencias, y jam&aacute;s requiri&oacute; sus servicios. Existieron<BR>
casualidades fatales que pusieron al descubierto su<BR>
operaci&oacute;n durante la investigaci&oacute;n del otro caso.<BR>
En el proceso aleg&oacute; en su defensa que se presentaran los<BR>
damnificados, pero la Loter&iacute;a no se sent&iacute;a damnificada<BR>
porque los billetes fueron comprados, y la empresa<BR>
rotogr&aacute;fica tampoco. El final de la historia fue su<BR>
libertad.<BR>
La empresa y las Loter&iacute;as, para evitar en el futuro<BR>
hechos similares, modificaron el sistema de impresi&oacute;n, en<BR>
mismo se comenz&oacute; a realizar en dos etapas. En la primera<BR>
se imprim&iacute;an los n&uacute;meros, luego las resmas eran mezcladas<BR>
por personal de loter&iacute;a y reci&eacute;n as&iacute; se imprim&iacute;an
las<BR>
raspaditas.<BR>
Lo relatado es un caso real, por tal motivo no se<BR>
menciona ni a la empresa ni al autor.<BR>
</BODY>
</HTML>
