<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Heroes por azar</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Pirateando a los piratas</CENTER></H2>

<P><CENTER><BR>
por Mart&iacute;n Sal&iacute;as</CENTER></P>

<P>&nbsp;</P>

<P>H&eacute;roes por azar (&quot;Sneakers&quot;, de Phil Alden Robinson,
con<BR>
gui&oacute;n de &eacute;ste, Lawrence Lasker y Walter F. Parkes,<BR>
protagonizada por Robert Redford, Sidney Poitier, Dan<BR>
Aykroid, Ben Kingsley, Mary McDonell, River Phoenix y<BR>
David Strathairn. M&uacute;sica de James Horner con Branford<BR>
Marsalis)</P>

<P>Esta pel&iacute;cula, estrenada recientemente en el circuito<BR>
cinematogr&aacute;fico porte&ntilde;o (y que seguramente estar&aacute; dentro<BR>
de poco en video), trata sobre una clase especial de<BR>
hackers, los sneakers del t&iacute;tulo original.<BR>
     Los sneakers son piratas de los sistemas de<BR>
seguridad, mas all&aacute; de sus componentes puramente<BR>
inform&aacute;ticos, pero teniendo &eacute;stos como uno de los<BR>
elementos principales.<BR>
     El film, escrito en parte por Lawrence Lasker, quien<BR>
ya participara en el de Juegos de Guerra (la pel&iacute;cula de<BR>
John Badham sobre el chico que penetraba con su<BR>
computadora en el sistema de defensa norteamericano casi<BR>
produciendo una guerra termonuclear global), adolece de<BR>
algunas ingenuidades y simplificaciones, am&eacute;n de algunos<BR>
conceptos un tanto err&oacute;neos, en su parte t&eacute;cnica.<BR>
Planteado b&aacute;sicamente como un entretenimiento, es eficaz,<BR>
y una de sus conclusiones principales es tal vez poco<BR>
novedosa para los que hacemos o leemos estas p&aacute;ginas: se<BR>
dice que el poder en el mundo actual pasa m&aacute;s que por las<BR>
armas, el dinero o la tecnolog&iacute;a, por el dominio de la<BR>
informaci&oacute;n.<BR>
     La historia que se narra es la de un grupo de<BR>
t&eacute;cnicos cuyo antecedente f&iacute;lmico literario est&aacute; entre<BR>
los integrantes de misi&oacute;n imposible y el mism&iacute;simo<BR>
McGyver. Todos ellos han tenido en alguna oportunidad<BR>
problemas con la justicia o las autoridades<BR>
principalmente por temas relacionados con la infiltraci&oacute;n<BR>
o manoseo de informaci&oacute;n ajena. Pero, ya en el buen<BR>
camino, se dedican a ejercer sus habilidades cuasi-<BR>
delictivas para simular robos o penetraciones a diversos<BR>
organismos (bancos, empresas, etc), al servicio de &eacute;stos<BR>
mismos, con el objeto de detectar las falencias en sus<BR>
medidas de seguridad.<BR>
     La trama se complica cuando unos agentes<BR>
gubernamentales los presionan mediante el pasado non<BR>
sancto de uno de los miembros para que acepten un trabajo<BR>
sucio, que ellos mismos no pueden llevar a cabo por<BR>
cuestiones legales: robar un dispositivo desarrollado por<BR>
un matem&aacute;tico que supuestamente est&aacute; pagado por lo que<BR>
queda de la desmantelada red rusa de espionaje.<BR>
     Este aparatito milagroso, y la lucha de distintos<BR>
intereses por apoderarse de &eacute;l, es el que da motivo a<BR>
toda la aventura. Pero es con &eacute;l, precisamente, donde se<BR>
comete una de las peores ingenuidades t&eacute;cnicas.<BR>
     La &quot;caja negra&quot;, seg&uacute;n descubren despu&eacute;s de
robarla<BR>
los protagonistas, es nada m&aacute;s ni nada menos que un<BR>
desencriptador universal; una interfase que, conectada a<BR>
cualquier canal de datos encriptados, los decodifica en<BR>
el acto, convirti&eacute;ndose en una especie de llave m&aacute;gica<BR>
que permite acceder a cualquier sistema.<BR>
     Para entender por qu&eacute; esto es imposible (al menos en<BR>
la forma en que se plantea en la pel&iacute;cula) debemos hacer<BR>
una interrupci&oacute;n y ver un poco de qu&eacute; se trata la<BR>
encriptaci&oacute;n de datos.<BR>
     M&aacute;s all&aacute; de los distintos m&eacute;todos, que pueden
llegar<BR>
a alcanzar complejidades y rebusques insospechados, hay<BR>
una base com&uacute;n a todos. Analicemos un m&eacute;todo sencillo y<BR>
medianamente eficaz, mediante un ejemplo concreto.<BR>
     Supongamos que queremos encriptar la palabra &quot;Hola&quot;.<BR>
Una forma sencilla de encriptarla y desencriptarla es<BR>
utilizar la funci&oacute;n l&oacute;gica XOR (disponible en diversas<BR>
formas en casi todos los lenguajes de programaci&oacute;n).<BR>
     Primero debemos tomar los valores ASCII de cada<BR>
letra. Estos son respectivamente: 72, 111, 108 y 97.<BR>
     Ahora, si a cada uno de ellos le aplicamos la<BR>
funci&oacute;n XOR contra, por ejemplo, un 7, obtenemos la<BR>
secuencia 79, 104, 107 y 102. Y si volvemos a convertir<BR>
estos c&oacute;digos a letras, vemos que &quot;Hola&quot; se ha<BR>
transformado en &quot;Ohkf&quot;. Lo hemos encriptado. La elecci&oacute;n<BR>
de XOR y no otra funci&oacute;n es porque si repetimos el<BR>
proceso sobre la palabra &quot;Ohkf&quot;, o sea, volvemos a<BR>
XORearlo con 7 (debe ser el mismo valor que antes),<BR>
obtendremos nuevamente &quot;Hola&quot;. Lo hemos desencriptado.<BR>
     Ahora bien. Este m&eacute;todo simpl&iacute;simo y super b&aacute;sico<BR>
puede complicarse todo lo que queramos. Por ejemplo,<BR>
podr&iacute;amos hacer el XOR de la primera letra con un valor,<BR>
la segunda con el ASCII de la primera, la tercera con el<BR>
de la segunda, y as&iacute; sucesivamente, y ya tendr&iacute;amos una<BR>
clave un poco m&aacute;s dif&iacute;cil. A&uacute;n as&iacute;, los verdaderos<BR>
m&eacute;todos de encriptaci&oacute;n son much&iacute;simo m&aacute;s complejos<BR>
porque tienen en cuenta la frecuencia de aparici&oacute;n de una<BR>
letra (o una secuencia de ellas), e incluyen mucha<BR>
matem&aacute;tica aplicada, especialmente estad&iacute;stica,<BR>
probabilidades, etc.<BR>
     Pero la cuesti&oacute;n b&aacute;sica es que siempre se codifica<BR>
en base a alg&uacute;n tipo de clave b&aacute;sica (en nuestro ejemplo,<BR>
el n&uacute;mero 7), y es a partir de all&iacute; desde donde se<BR>
empieza a deformar un mensaje, de modo que para<BR>
decodificarlo, adem&aacute;s del m&eacute;todo, hay que conocer esa<BR>
clave. Y el problema es que para descubrir un elemento se<BR>
necesita estar muy cerca del otro. As&iacute;, en la pr&aacute;ctica,<BR>
para decodificar un mensaje necesitamos conocer, para<BR>
empezar, de qu&eacute; se trata; debemos tener una m&iacute;nima idea<BR>
de lo que debe decir, o que tipo de informaci&oacute;n contiene.<BR>
Se va probando con distintos m&eacute;todos y valores y se van<BR>
viendo los resultados hasta encontrar algo m&iacute;nimamente<BR>
inteligible.<BR>
     Esto es algo que podr&iacute;amos simplificar con la<BR>
computadora, obviamente, poni&eacute;ndola a probar cuantas<BR>
veces sea necesario hasta encontrar alg&uacute;n fragmento de<BR>
informaci&oacute;n coherente que pueda dar un pista de la forma<BR>
en que se encript&oacute;. Pero, &iquest;qu&eacute; es para la computadora<BR>
informaci&oacute;n coherente? algo que de alguna manera pueda<BR>
comparar contra, digamos, un diccionario. El problema se<BR>
presenta cuando la informaci&oacute;n no consta s&oacute;lo de texto<BR>
sino tambi&eacute;n de n&uacute;meros o comandos.<BR>
     Resumiendo, podemos arriesgarnos a afirmar que no<BR>
puede existir UN m&eacute;todo de desencriptar cualquier cosa.<BR>
     Volviendo a la pel&iacute;cula, y a&uacute;n suponiendo que &eacute;ste<BR>
fen&oacute;meno se lograra, es sumamente ingenuo suponer que<BR>
conect&aacute;ndonos v&iacute;a m&oacute;dem a cualquier red con tal aparato<BR>
accederemos directamente y sin otras claves y mecanismos<BR>
de seguridad posteriores a los centros de control de<BR>
cualquier empresa u organizaci&oacute;n.<BR>
     Si esto fuera as&iacute; de f&aacute;cil, habr&iacute;a varios millones<BR>
de hackers en cada pa&iacute;s y la situaci&oacute;n se volver&iacute;a<BR>
bastante complicada.<BR>
     En s&iacute;ntesis, aunque la pel&iacute;cula es entretenida e<BR>
interesante en muchos aspectos, la mayor&iacute;a de los<BR>
prodigios realizados tanto por los buenos como por los<BR>
malos son tan reales como McGyver reorientando l&aacute;seres<BR>
con dos espejitos en las manos, o construyendo en un par<BR>
de horas un ultraliviano con ca&ntilde;os de pl&aacute;stico, bolsas de<BR>
nylon y un ventilador grandote.<BR>
</BODY>
</HTML>
