<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Analisis de virus: Stoned, 512 y Argentina</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H1><CENTER>Analisis de virus</CENTER></H1>

<P><CENTER><BR>
En este n&uacute;mero presentamos un virus stealth, el 512, el<BR>
virus Argentina, uno de los primeros creados en el pa&iacute;s,<BR>
y analizamos en detalle un virus de boot muy com&uacute;n: el<BR>
Stoned</CENTER></P>

<P>&nbsp;</P>

<H2>512</H2>

<P>El virus 512 fue originado en Bulgaria en 1989. Infecta<BR>
archivos .com inclusive al command.com. Ocupa exactamente<BR>
12 bytes, de ah&iacute; su nombre. Su descubridor fue Vesselin<BR>
Bontchev, un importante investigador b&uacute;lgaro de virus.<BR>
Este virus es importante porque es el primer virus<BR>
stealth de archivos que se conoce. Un virus stealth es<BR>
aquel que se hace casi indetectable para el sistema que<BR>
infecta. Esto se logra enga&ntilde;ando al sistema operativo<BR>
para que cada vez que quiera leer una parte de un archivo<BR>
donde se oculta el virus le devuelve la informaci&oacute;n que<BR>
habr&iacute;a all&iacute; si el archivo no estuviese infectado. De esta<BR>
forma, aunque comparemos byte por byte un programa<BR>
infectado con una copia del mismo sin infectar no<BR>
notar&iacute;amos ninguna diferencia, mientras el virus est&eacute;<BR>
activo en memoria controlando las operaciones de lectura<BR>
del DOS.<BR>
Este virus utilizaba una t&eacute;cnica muy particular, porque<BR>
accede en forma directa al File System Table, una tabla<BR>
de uso interno del DOS. Esta estructura es distinta en<BR>
diferentes versiones del DOS, por lo que no funciona en<BR>
un DOS que no sea el 3.3. En memoria se oculta en el<BR>
primer buffer de acceso a disco del DOS, obtiene su<BR>
direccion en memoria con una estructura de datos &uacute;nica al<BR>
DOS 3.1 y 3.3. Por estas causas, el 512 funciona<BR>
solamente en DOS 3.3 o compatibles muy cercanos (como el<BR>
DOS 3.31 de Compaq).<BR>
Por esta causa est&aacute; pr&aacute;cticamente extinguido en este<BR>
momento, ya que dado el precio promocional del MS DOS 5.0<BR>
y su capacidad para cargarse en memoria alta y soportar<BR>
discos de m&aacute;s de treinta megas, casi nadie usa otro DOS.<BR>
Hace unos a&ntilde;os, en 1990, era muy com&uacute;n en nuestro pa&iacute;s.<BR>
En Estados Unidos nunca estuvo muy extendido, era casi<BR>
desconocido. Esto nos hace pensar que aunque muchas veces<BR>
creamos que los virus que aparecen en nuestro pa&iacute;s vienen<BR>
de Estados Unidos, esto no es siempre as&iacute;. Probablemente<BR>
haya llegado desde Europa o desde Asia.<BR>
El 512 no hace nada exepto reproducirse. Es un virus muy<BR>
bien hecho desde el punto de vista del conocimiento del<BR>
DOS. Utiliza estructuras y funciones que no est&aacute;n<BR>
documentadas oficialmente y son dif&iacute;ciles de conseguir.<BR>
Es obvio que el autor tiene acceso a mucha informaci&oacute;n,<BR>
probablemente a la lista de interrupciones de Ralf Brown,<BR>
donde encontramos toda la informaci&oacute;n necesaria como para<BR>
desensamblarlo. No es com&uacute;n ver virus tan complejos y tan<BR>
peque&ntilde;os, por lo general usan funciones m&aacute;s documentadas.<BR>
Desde el punto de vista de compatibilidad no es tan<BR>
bueno, ya que a penas se cambia de versi&oacute;n de DOS &eacute;ste<BR>
deja de funcionar colgando los programas h&uacute;espedes. Quiz&aacute;<BR>
el &eacute;xito de virus como el Jerusalem, Stoned, u otros se<BR>
deba m&aacute;s a la compatibilidad con todos los sistemas<BR>
operativos o programas que a grandes esfuerzos para no<BR>
ser detectados. Es m&aacute;s f&aacute;cil detectar un virus cuando<BR>
vemos que no anda algo que cuando anda todo, a pesar de<BR>
que cambie o no la longitud de los programas infectados.<BR>
Se cree que su autor no es otro que el famoso Dark<BR>
Avenger. Este es un prol&iacute;fico escritor b&uacute;lgaro de virus,<BR>
creador de algunos muy destructivos y con ideas<BR>
innovadoras.</P>

<H2>Argentina</H2>

<P>En octubre de 1991 en el BBS argentino PC-HOST, el<BR>
usuario Alberto Wurzel le dej&oacute; a Ricardo Pesce, el SysOp,<BR>
un programa para que viera por qu&eacute; le daba mensajes<BR>
extra&ntilde;os cada vez que lo trataba de usar. Ese programa,<BR>
luego de ser analizado por mi, result&oacute; ser un virus.<BR>
Probablemente sea el primer virus argentino en ser algo<BR>
m&aacute;s que una peque&ntilde;a variante de un virus anterior. Antes<BR>
que este se crearon en el pa&iacute;s los virus Jerusalem<BR>
Mendoza y Ping-Pong C, pero eran variantes menores de<BR>
otros virus. De todas formas, Argentina es una variante<BR>
del virus Suriv, aunque est&aacute; lo bastante modificado como<BR>
para merecer un nombre propio. Este virus infecta s&oacute;lo<BR>
archivos .COM, excepto el command.com. No es un virus<BR>
destructivo. Los d&iacute;as 25 de mayo, 20 de junio, 9 de julio<BR>
y 17 de agosto se activa, mostrando uno de los siguientes<BR>
mensajes de acuerdo a la fecha:</P>

<P>25 de Mayo Declaraci&oacute;n de la independencia Argentina<BR>
20 de Junio Dia de la bandera Argentina<BR>
9 de Julio Dia de la independencia Argentina<BR>
17 de Agosto Aniversario de la defunci&oacute;n del Gral. San<BR>
Martin</P>

<P>Despues del mensaje de acuerdo al d&iacute;a, muestra lo<BR>
siguiente:</P>

<P>Argentina Virus escrito por AfA - Virus benigno - ENET 35<BR>
Pulse una tecla para continuar...</P>

<P>De esto podemos sacar varias conclusiones. Por un lado,<BR>
hay un error en la primera fecha, ya que el 25 de mayo se<BR>
festeja la creaci&oacute;n del primer gobierno patrio y no la<BR>
independencia argentina. Por otro lado, vemos que dice<BR>
ENET 35, lo que nos permite pensar que fue escrito por un<BR>
alumno secundario de una escuela t&eacute;cnica. Esto apoya a la<BR>
creencia que circula por el ambiente inform&aacute;tico de que<BR>
la mayor&iacute;a de los autores de virus son adolescentes. AfA<BR>
seguramente son las iniciales del autor del virus.<BR>
El 'Virus benigno' que aparece entre los mensajes y el<BR>
hecho de que efectivamente el virus no pretenda hacer<BR>
ningun da&ntilde;o subrayan la idea de que el autor s&oacute;lo quiso<BR>
hacer un experimento, y no pretendi&oacute; causar da&ntilde;os. Corre<BR>
un rumor que dice que el autor de este virus no pretendi&oacute;<BR>
que se escapara y llegara a infectar programas de gente<BR>
inocente. Esto es muy posible, ya que es muy com&uacute;n que un<BR>
autor cree un virus sin m&aacute;s intenciones que las de<BR>
divertirse o hacer un experimento y luego se le escape<BR>
sin notarlo.</P>

<H2><A HREF="stoned.gif" tppabs="http://www.ubik.to/VR/02/stoned.gif">Stoned</A></H2>

<P>Stoned es un virus de boot sector. Se instala en el<BR>
sector 0 (boot) en diskettes y en la tabla de particiones<BR>
de los discos r&iacute;gidos. En los diskettes de 360k copia el<BR>
sector de booteo original en el sector 11, donde se<BR>
encuentra el final del directorio ra&iacute;z, por lo cual se<BR>
perder&iacute;a informaci&oacute;n del disco si hab&iacute;an archivos en
esa<BR>
parte del directorio. En los discos r&iacute;gidos copia la<BR>
tabla de particiones al lado 0, cilindro 0, sector 7,<BR>
donde normalmente no hay datos. En la memoria se instala<BR>
en la parte m&aacute;s alta de la memoria libre, cambiando el<BR>
valor de la cantidad de memoria disponible a 2 k menos<BR>
para no ser sobreescrito por alg&uacute;n programa. En discos<BR>
r&iacute;gidos con controladora RLL se cuelga al intentar<BR>
funcionar.<BR>
El s&iacute;ntoma m&aacute;s visible, adem&aacute;s de la falta de 2 k en
la<BR>
memoria principal, es un mensaje que aparece en forma<BR>
aparentemente aleatoria al bootear, que dice &quot;Your<BR>
computer is now stoned&quot; o &quot;Your PC is now Stoned!&quot;<BR>
dependiendo de la versi&oacute;n del virus. Luego de esto la<BR>
computadora se cuelga. Algunas versiones agregan el texto<BR>
&quot;LEGALISE MARIJUANA&quot;, que est&aacute; presente en pr&aacute;cticamente<BR>
todas las versiones pero algunas lo muestran y otras no.<BR>
Estar &quot;stoned&quot; significa, en el uso popular de Estados<BR>
Unidos y otros pa&iacute;ses, estar bajo los efectos de la<BR>
marihuana. Por lo tanto, el mensaje dir&iacute;a que la<BR>
computadora est&aacute; drogada y pide la legalizaci&oacute;n de la<BR>
marihuana. Es com&uacute;n encontrar virus con mensajes de tipo<BR>
propagand&iacute;stico a favor o en contra de alguna cosa, este<BR>
caso no es nuevo, pensemos por ejemplo en el virus Brain<BR>
y su lucha en contra de la pirater&iacute;a de software. Adem&aacute;s<BR>
de estos mensajes y los problemas de compatibilidad ya<BR>
nombrados, este virus no causa ningun da&ntilde;o intencional.<BR>
Se cree que el virus fue originado en Nueva Zelandia, ya<BR>
que de all&iacute; vinieron los primeros reportes de este virus,<BR>
en el a&ntilde;o 1988. Ahora est&aacute; muy difundido por todo el<BR>
mundo, incluso en Argentina es muy com&uacute;n verlo.</P>

<P>Funcionamiento</P>

<P>Al bootear la m&aacute;quina el BIOS carga el boot de los<BR>
diskettes o la tabla de particiones en la direcci&oacute;n<BR>
07C0:0000 y le pasa el control. Luego, el c&oacute;digo del boot<BR>
sector se encarga de cargar el resto del sistema<BR>
operativo. Cuando el disco est&aacute; infectado por el Stoned,<BR>
el BIOS carga el virus, y le pasa el control.<BR>
Lo primero que hace es definir un stack propio para sus<BR>
rutinas. Luego guarda el viejo valor de la interrupci&oacute;n<BR>
13h (acceso a disco) e instala su propia rutina. Modifica<BR>
el contenido de la posici&oacute;n de memoria 0000:0413,<BR>
rest&aacute;ndole 2, con lo cual el BIOS va a informar que hay 2<BR>
k menos de memoria RAM. Despues de esto se copia al tope<BR>
de la memoria, donde rest&oacute; esos 2 k, y salta a ese<BR>
c&oacute;digo. Obviamente, la rutina que reemplaza la<BR>
interrupci&oacute;n 13h est&aacute; en esta parte alta de la memoria y<BR>
no donde se carg&oacute; el virus originalmente.<BR>
A continuaci&oacute;n carga el boot original, que guard&oacute; en el<BR>
sector 11 de los diskettes o en el sector 7 de los discos<BR>
r&iacute;gidos. Luego de hacerlo verifica que el byte ubicado en<BR>
0000:046C sea 7. Ese byte es la parte baja del timer de<BR>
la m&aacute;quina, en realidad funcionar&iacute;a como una rutina burda<BR>
de azar. Si es 7, escribe el mensaje &quot;Your PC is now<BR>
Stoned!&quot;. Si no es as&iacute;, y se carg&oacute; de diskette, procede
a<BR>
verificar si el disco r&iacute;gido est&aacute; infectado. En el caso<BR>
de que se haya cargado de disco r&iacute;gido salta al boot<BR>
original para que siga carg&aacute;ndose normalmente el sistema<BR>
operativo.<BR>
Para verificar el disco r&iacute;gido, lee la tabla de<BR>
particiones y compara parte de su c&oacute;digo con si mismo<BR>
para comprobar si est&aacute; infectada. Si lo est&aacute; sigue<BR>
cargando el sistema operativo, si no lo est&aacute; procede a<BR>
infectar el disco. Para infectar, escribe la tabla de<BR>
particiones que ley&oacute; en el sector 7, track 0, cabeza 0, y<BR>
se copia a si mismo desde la memoria en la tabla de<BR>
particiones. Luego de esto, ya infectado el disco r&iacute;gido,<BR>
continua ejecutando el boot sector original para que<BR>
termine de cargar el sistema operativo. Con esto<BR>
comprender&aacute;n por qu&eacute; a pesar de que no est&eacute; el sistema<BR>
operativo en un diskette el virus puede contagiarse si<BR>
booteamos con un disco infectado. Con solo tener el virus<BR>
ya se contagia, porque lo hace antes de cargar el DOS y<BR>
con interrupciones del BIOS exclusivamente.<BR>
Una vez instalado el virus, quedan dos rutinas activas en<BR>
la memoria. Una es la que reemplaza la interrupci&oacute;n 13h y<BR>
la otra es la que se encarga de infectar los diskettes.<BR>
Es interesante notar que el disco r&iacute;gido es infectado<BR>
s&oacute;lo en el caso de que el virus se cargue de diskette y<BR>
en el momento de la carga, no despu&eacute;s. Esto es l&oacute;gico,<BR>
porque el disco r&iacute;gido no es removible y si se infect&oacute; al<BR>
principio de la carga del DOS o ya estaba infectado,<BR>
luego no va a cambiarse el disco y va a seguir en el<BR>
mismo estado. Esto es interesante a la hora de<BR>
desinfectar un disco r&iacute;gido, no es necesario sacar el<BR>
virus de memoria para hacerlo, ya que no va a intentar la<BR>
reinfecci&oacute;n.<BR>
La rutina que reemplaza la interrupci&oacute;n 13h del BIOS<BR>
verifica si se pidi&oacute; un servicio 2 o 3, o sea, si ah es 2<BR>
o 3, y que dl sea cero. Esto significa, si se pidi&oacute; leer<BR>
o escribir sectores de disco (ah=2 o ah=3), y el drive es<BR>
el A (dl=0). Si las condiciones se dan, llama a la rutina<BR>
de infecci&oacute;n y luego retoma la interrupci&oacute;n 13h original.<BR>
Si no se dan las condiciones, saltea la infecci&oacute;n y sigue<BR>
con la interrupci&oacute;n.<BR>
La rutina de infecci&oacute;n lee el boot sector del diskette,<BR>
haciendo un call al c&oacute;digo de la interrupci&oacute;n 13h en el<BR>
BIOS, y verifica si est&aacute; infectado previamente,<BR>
comparando su c&oacute;digo con el que all&iacute; encuentre. Si no lo<BR>
est&aacute;, escribe el boot sector recien le&iacute;do en el sector 3,<BR>
track 0, cabeza 1, y luego escribe su propio c&oacute;digo sobre<BR>
el boot original. Despu&eacute;s de esto, vuelve a la<BR>
interrupci&oacute;n 13h original.<BR>
Vemos que este virus es de funcionamiento muy sencillo, y<BR>
con pocas instrucciones logra funcionar en forma eficaz.
</BODY>
</HTML>
