<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Uno de los primeros virus</TITLE>
</HEAD>
<BODY BGCOLOR="#0080ff">

<H2><CENTER>Uno de los primeros virus</CENTER></H2>

<P><CENTER>Presentamos la historia de un primitivo virus contada por<BR>
su autor. En 1981 recien empezaban a aparecer las PC, y<BR>
ya exist&iacute;an los virus inform&aacute;ticos, basados en una<BR>
m&aacute;quina popular en ese momento, la Apple II. Joe<BR>
Dellinger, estudiante de la universidad A&amp;M de Texas,<BR>
probablemente jam&aacute;s se imagin&oacute; que lo que hizo casi como<BR>
un juego iba a convertirse, pocos a&ntilde;os despu&eacute;s, en un<BR>
problema a nivel mundial.</CENTER></P>

<P>&nbsp;</P>

<P>Cuando era estudiante universitario en la universidad A&amp;M<BR>
de Texas (eso fue en 1981) hab&iacute;a una activa comunidad de<BR>
usuarios de Apple II en mi residencia universitaria<BR>
(Shuhmacher) con una incre&iacute;ble cantidad de copias piratas<BR>
de juegos. Observ&eacute; que la mayor&iacute;a estaban da&ntilde;ados de<BR>
diferentes formas, pero casi siempre se pod&iacute;a jugar con<BR>
ellos a pesar de eso. (Por ejemplo, hab&iacute;a un conocido<BR>
juego llamado &quot;Star Trek&quot; en BASIC que ocasionalmente<BR>
ten&iacute;a basura en sentencias que no eran cr&iacute;ticas, como REM<BR>
y PRINT, los juegos de guerra espacial muy frecuentemente<BR>
ten&iacute;an basura aleatoria que reemplazaba algunos dibujos<BR>
de naves, etc.) Decid&iacute; que pod&iacute;a explicar esto como una<BR>
especie de &quot;evoluci&oacute;n&quot;.</P>

<P>Para que la evoluci&oacute;n se produzca hacen falta mutaci&oacute;n
y<BR>
selecci&oacute;n natural. En realidad, hab&iacute;a &quot;mutaci&oacute;n&quot;
causada<BR>
por gente que intentaba modificar los juegos; lo que es<BR>
m&aacute;s importante a&uacute;n, hab&iacute;a computadoras y disquettes<BR>
enfermos que deformaban en forma accidental muchas copias<BR>
de estos juegos.</P>

<P>La gente segu&iacute;a utilizando los disquettes de los juegos<BR>
hasta que literalmente se desintegraran. Mi Apple II, de<BR>
un modelo antiguo, era muy poco confiable y sol&iacute;a<BR>
colgarse cada 30 minutos de todo tipo de interesantes<BR>
formas. Por lo com&uacute;n unos pocos golpecitos bien dados la<BR>
pon&iacute;an nuevamente en funcionamiento. La &quot;Selecci&oacute;n<BR>
Natural&quot; entraba en escena con las acciones de los<BR>
usuarios de &quot;reproducir&quot; o bien &quot;matar&quot; copias de los<BR>
juegos. Por ejemplo, si no se pod&iacute;a jugar con la copia<BR>
del juego que uno ten&iacute;a se intentaba conseguir otra copia<BR>
de ese mismo juego reproduciendo esta copia y matando la<BR>
otra. Como hab&iacute;a espacio limitado para juegos en los<BR>
discos, tambi&eacute;n hab&iacute;a una gran competencia entre las<BR>
diferentes especies de programas.</P>

<P>Esta idea de programas que habitan una especie de<BR>
biosfera de la computadora llev&oacute; naturalmente al concepto<BR>
de un &quot;Virus de Computadora&quot;, como un resultado<BR>
accidental probable de dicha evoluci&oacute;n. Mis experimentos<BR>
comenzaron cuando intent&eacute; averiguar cual era el cambio<BR>
m&iacute;nimo que har&iacute;a al DOS vir&oacute;sico. Pensaba en algo as&iacute;<BR>
como un prion, una especie de proto-virus.<BR>
Recuerdo que la respuesta para el DOS 3.3 era de<BR>
aproximadamente 16 bytes, que estaba dentro de los<BR>
l&iacute;mites de lo que suceder&iacute;a naturalmente si las<BR>
Computadoras Apple II, en manos de gente que copiara<BR>
programas de juegos aleatoriamente, existieran durante<BR>
algunos millones de a&ntilde;os.<BR>
El pr&oacute;ximo paso l&oacute;gico era intentar determinar como ser&iacute;a<BR>
un programa evolucionariamente &oacute;ptimo. Obviamente el<BR>
programa ser&iacute;a m&aacute;s exitoso si no confiara en la buena<BR>
voluntad de los humanos para reproducirse, pero asimismo<BR>
no es una buena idea da&ntilde;ar al hu&eacute;sped (o darle a los<BR>
humanos una raz&oacute;n para gastar energ&iacute;as intentando matarlo<BR>
a uno). Por ello que el virus ideal se extender&iacute;a por s&iacute;<BR>
mismo sin causar ning&uacute;n tipo de da&ntilde;o o &quot;s&iacute;ntoma&quot;,
si<BR>
pudiese evitarlo.</P>

<P>Trat&eacute; estas ideas con amigos, muchos de ellos tambi&eacute;n<BR>
usuarios de Computadoras Apple. Hasta ese momento ninguno<BR>
de ellos hab&iacute;a escuchado lo que era un &quot;virus de<BR>
computadora&quot;. (Muchos usuarios de Apple que conoc&iacute;a se<BR>
burlaban de la idea de que algo as&iacute; pudiera existir).<BR>
Bien, en ese momento crear un virus sonaba como un<BR>
proyecto realmente interesante y era un buena excusa para<BR>
aprender el lenguaje de m&aacute;quina del procesador 6502. Por<BR>
lo tanto, en nuestro (poco frecuente) tiempo libre, un<BR>
grupo de nosotros comenz&oacute; a trabajar sobre mi &quot;programa<BR>
evolucionariamente &oacute;ptimo&quot;.<BR>
Finalizamos nuestro primer intento, la &quot;Versi&oacute;n 1 del<BR>
Virus&quot; a comienzos de 1982. El Virus 1 era infeccioso<BR>
pero a&uacute;n causaba s&iacute;ntomas en mi computadora a pesar de<BR>
nuestros mejores esfuerzos, por ello que lo dejamos en<BR>
estricta cuarentena y continuamos experimentando con &eacute;l.</P>

<P>Unos meses m&aacute;s tarde terminamos el dise&ntilde;o del Virus 2.<BR>
Parec&iacute;a no causar serios da&ntilde;os, por ello proced&iacute; con
el<BR>
pr&oacute;ximo paso en mis experimentos y lo solt&eacute; en mis<BR>
propios discos. El objetivo era determinar con qu&eacute;<BR>
velocidad dicho programa se diseminar&iacute;a por mis propios<BR>
discos si segu&iacute;a utilizando mi computadora en forma<BR>
normal. Ten&iacute;a otra buena raz&oacute;n para querer asegurarme de<BR>
que el virus era totalmente inocuo. De hecho casi todo el<BR>
c&oacute;digo del Virus 2 era para verificar diferentes tipos de<BR>
situaciones peligrosas: un DOS no convencional, discos no<BR>
convencionales, programas que alteran el DOS, etc. En<BR>
estos casos los virus o no infectar&iacute;an o bien se<BR>
desconectar&iacute;an inmediatamente del DOS, y se<BR>
&quot;suicidar&iacute;an&quot;.</P>

<P>Los usuarios de Apple II de la Universidad A&amp;M de Texas<BR>
estaban muy interesados en mi &quot;investigaci&oacute;n&quot;, por eso<BR>
les di tambi&eacute;n copias del Virus 2 a varios amigos que<BR>
quer&iacute;an jugar con &eacute;l. La idea del virus de computadoras<BR>
se extendi&oacute; r&aacute;pidamente; muchos otros comenzaron a<BR>
trabajar en los suyos propios propios, &quot;menos aburridos&quot;<BR>
(l&eacute;ase da&ntilde;inos).<BR>
Afortunadamente, (por lo que yo supe) se pasaban la mayor<BR>
parte del tiempo intentando idear bomas interesantes para<BR>
que los virus produjesen s&iacute;ntomas &quot;divertidos&quot;, en lugar<BR>
de intentar decididamente crear un virus maligno activo.</P>

<P>Al comienzo mantuvimos el Virus 2 cuidadosamente en<BR>
cuarentena, pero despues de unos pocos meses de no haber<BR>
presentado s&iacute;ntomas da&ntilde;inos, nos descuidamos y sucedi&oacute;
lo<BR>
inevitable. Supe por primera vez que el Virus 2 se hab&iacute;a<BR>
escapado por uno de mis amigos de la universidad que se<BR>
hab&iacute;a graduado y mudado a la universidad UIUC para<BR>
continuar sus estudios. Me inform&oacute; que en ese lugar todas<BR>
las copias de un juego llamado &quot;Congo&quot; hab&iacute;an dejado de<BR>
funcionar misteriosamente. Cuando la gente quer&iacute;a obtener<BR>
una nueva copia que funcionara, se encontraba con que las<BR>
copias anteriores, que andaban, ahora dejaban de hacerlo.<BR>
Mi amigo se dio cuenta de lo que hab&iacute;a sucedido y me<BR>
inform&oacute; acerca de ello. Inmediatamente dise&ntilde;amos un<BR>
programa &quot;inmunizador&quot; y lo distribuimos en UIUC; el<BR>
utilitario standard de Apple II &quot;master create&quot; fue<BR>
suficiente como desinfectante. Sin embargo, nunca<BR>
estuvimos seguros de haber matado todas las copias que se<BR>
hab&iacute;an escapado del Virus 2 en UIUC.</P>

<P>Estaba desilusionado porque el Virus 2 era un fracaso, y<BR>
comenc&eacute; a dise&ntilde;ar el Virus 3. Result&oacute; ser que el Virus
2<BR>
causaba problemas porque agrandaba el sector 1 del DOS en<BR>
256 bytes, &iexcl;una significativa cantidad de memoria!, para<BR>
albergar el c&oacute;digo extra. Unos pocos programas se<BR>
destruir&iacute;an en forma extra&ntilde;a por esta raz&oacute;n. (La soluci&oacute;n<BR>
era simplemente bootear desde un disco no infectado y<BR>
luego correr los programas).<BR>
Entonces, el objetivo para el Virus 3 era que no ocupara<BR>
lugar ni en la memoria ni en el disco. Despu&eacute;s de pensar<BR>
un poco se nos ocurri&oacute; una soluci&oacute;n: la mayor parte del<BR>
n&uacute;cleo del Virus 3 se alojaba en la memoria no protegida<BR>
sobre la que se pod&iacute;a escribir libremente. Una peque&ntilde;a<BR>
rutina oculta y a salvo dentro de agujeros en la tabla de<BR>
conversi&oacute;n de lectura-escritura del DOS hac&iacute;a un triple<BR>
control del c&oacute;digo sin protecci&oacute;n antes de ejecutarlo.<BR>
Este c&oacute;digo era una verdadera pesadilla; algunos bytes en<BR>
la tabla cumpl&iacute;an doble funci&oacute;n: como valores de<BR>
informaci&oacute;n cr&iacute;ticos para el DOS y como c&oacute;digos de<BR>
operaci&oacute;n ejecutables para el virus. El Virus 3 fue un<BR>
&eacute;xito; nunca nos encontramos con ning&uacute;n programa cuyo<BR>
comportamiento se viera afectado por su presencia.<BR>
La peor parte de dise&ntilde;ar un virus de DOS fue que cada vez<BR>
que comet&iacute;a un error, el DOS dejaba de funcionar, y<BR>
entonces deb&iacute;a re-ubicar manualmente los bytes que ten&iacute;a<BR>
escritos en folletos de propaganda. Utilizar un<BR>
ensamblador no era en absoluto la soluci&oacute;n, ya que todo<BR>
el proceso constaba de s&oacute;lo 300 bytes y se desintegraba<BR>
en peque&ntilde;os pedacitos en varios sectores del DOS. Ten&iacute;a<BR>
gran cantidad de JMPs por todos lados, un c&oacute;digo de<BR>
modificaci&oacute;n propia y otras pesadillas similares, todo<BR>
esto para hacerlo lo m&aacute;s peque&ntilde;o posible. Cuanto m&aacute;s<BR>
grande era y m&aacute;s expuesto estaba a la memoria, m&aacute;s<BR>
trabajo ten&iacute;a para reproducirse y m&aacute;s posibilidades<BR>
exist&iacute;an de que algo inesperado sucediera.</P>

<P>Finalmente, no s&eacute; lo que sucedi&oacute;. Debido a que el Virus
3<BR>
de hecho era completamente invisible, luego de un tiempo<BR>
perdimos el inter&eacute;s y lo dejamos en el olvido. Nuevamente<BR>
intentamos poner el virus en cuarentena pero en el<BR>
invierno de 1983, poco despu&eacute;s de graduarme y mudarme a<BR>
Stanford, un chequeo revel&oacute; su existencia en varios<BR>
discos de mis amigos, que ellos supon&iacute;an no estaban<BR>
infectados. Sin embargo, en ese momento no cre&iacute;an que<BR>
valiese la pena sacarlo, y por eso se expandi&oacute; sin<BR>
control. A esa altura, tambi&eacute;n en A&amp;M, el inter&eacute;s por
los<BR>
virus hab&iacute;a desaparecido. S&oacute;lo tuve noticias de mi virus<BR>
una vez m&aacute;s: durante 1984 mi amigo en UIUC me inform&oacute; que<BR>
un virus maligno estaba atacando computadoras Apple y que<BR>
estaba causando mucho da&ntilde;o, inicializando discos<BR>
aleatoriamente. Algunos discos ten&iacute;an una especie de<BR>
inmunidad contra el Virus Maligno; sin embargo, cuando<BR>
dichos discos estaban infectados por el virus se colgaban<BR>
en el momento de bootear (que era mejor que aparentar un<BR>
booteo normal y luego causar mayores da&ntilde;os). &iexcl;Result&oacute;
ser<BR>
que los discos inmunes eran aquellos que previamente<BR>
hab&iacute;an sido infectados por el Virus 3!<BR>
</BODY>
</HTML>
